{
  "component" : "vmw-k8s",
  "locale" : "fr",
  "messages" : {
    "vmc-kubernetes-cloud-as-platform.architecture-img-1-alt" : "Présentation de Tanzu",
    "vmc-kubernetes-cloud-as-platform.architecture-img-2-alt" : "Flux Tanzu de bout en bout",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-acquisition-desc" : "L'acquisition de Bitnami et Pivotal permet d'étendre largement les produits et les services que nous pouvons introduire sur le marché via VMware Tanzu. VMware a dorénavant établi une liaison étroite avec la communauté des développeurs et peut proposer à ces derniers une chaîne de fourniture d'applications modernes complète.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-packages-desc" : "Bitnami conditionne et fournit des applications pour Kubernetes à une échelle et une portée incroyables. Aujourd'hui, le catalogue de la communauté Bitnami propose 180 applications et composants installés plus de 1 million de fois chaque mois. Nous avons annoncé Project Galleon pour fournir aux entreprises des capacités Bitnami afin de proposer des piles d'applications personnalisées à leurs développeurs finaux.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-pivotal-desc-3" : "Pivotal est un acteur important de l'un des cadres d'application les plus populaires au monde (Spring) et offre aux clients une plate-forme d'application commerciale de premier plan (Pivotal Application Service). Pivotal a pleinement adopté Kubernetes. Il élabore des technologies Kubernetes natives depuis des années et a récemment annoncé que PAS et ses composants, notamment Pivotal Build Service et Pivotal Function Service, sont en cours d'évolution pour s'exécuter sur Kubernetes. Collectivement, Bitnami et Pivotal sont utilisés par près de 5 millions de développeurs. Cette évolution est amplifiée par l'écosystème d'ISV de VMware. Les partenaires de VMware développent des applications et offrent des services à valeur ajoutée sur Kubernetes s'intègrant à la pile SDDC VMware.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-title" : "1. Création d'applications modernes",
    "vmc-kubernetes-cloud-as-platform.kubernetes-implementation-title" : "2. Exécuter une mise en œuvre cohérente de Kubernetes",
    "vmc-kubernetes-cloud-as-platform.kubernetes-title" : "Kubernetes",
    "vmc-kubernetes-cloud-as-platform.manage-environments-desc" : "Alors que nous étendons la disponibilité de Kubernetes dans divers environnements et que les équipes de développement commencent à exploiter le service pour soutenir le développement moderne d'applications, vos installations deviennent plus compliquées à gérer. Nous souhaitons permettre à nos clients d'exploiter Kubernetes de manière cohérente entre clouds, clusters et équipes pour offrir une efficacité opérationnelle optimale digne d'une boîte à outils d'entreprise. C'est pourquoi nous avons également introduit VMware Tanzu Mission Control dans le cadre du portefeuille VMware Tanzu.",
    "vmc-kubernetes-cloud-as-platform.manage-kubernetes-title" : "3. Gérer l'intégralité de votre infrastructure Kubernetes depuis un point de contrôle unique",
    "vmc-kubernetes-cloud-as-platform.manage-mission-desc" : "Avec VMware Tanzu Mission Control, les clients gèrent TOUS leurs clusters Kubernetes sur vSphere, VMware PKS, les clouds publics, les services gérés, les distributions packagées ou les projets internes à partir d'un point de contrôle unique. Ils provisionnent de nouveaux clusters Kubernetes dans ces environnements à partir de VMware Tanzu Mission Control et tirent parti d'un moteur de stratégie pour établir des garde-fous. En particulier, les opérateurs appliquent des stratégies d'accès, de quotas, de sauvegarde, de sécurité, etc. à des clusters individuels ou à des groupes de clusters. Pendant ce temps, les équipes de développeurs ont accès à des espaces de travail dans lesquels ils peuvent librement consommer des ressources et collaborer.",
    "vmc-kubernetes-cloud-as-platform.pacific-implementation-desc" : "Project Pacific est un effort d'intégration de Kubernetes dans vSphere. L'intégration de Kubernetes et de vSphere s'effectue au niveau de l'API et des couches d'interface utilisateur, mais la couche de virtualisation de base en tant qu'ESXi exécutera également Kubernetes en mode natif. Project Pacific permettra à des centaines de milliers de clients vSphere et potentiellement à des millions d'administrateurs de profiter directement des fonctionnalités de Kubernetes. Mais cela permettra également à notre produit phare vSphere de mieux unifier les VM et conteneurs pour offrir une plate-forme d'applications unique à l'avenir. Les opérateurs auront accès aux fonctionnalités de Kubernetes via un ensemble de scripts et d'outils connus, tandis que les développeurs pourront accéder aux ressources cloud à l'aide d'API Kubernetes.",
    "vmc-kubernetes-cloud-as-platform.pacific-link" : "En savoir plus sur Project Pacific",
    "vmc-kubernetes-cloud-as-platform.pacific-video-link" : "Vidéo : présentation de Project Pacific",
    "vmc-kubernetes-cloud-as-platform.project-pacific-img-alt-1" : "Cadre d'applications modernes Tanzu",
    "vmc-kubernetes-cloud-as-platform.project-pacific-img-alt-2" : "Intégration de Kubernetes et de vSphere",
    "vmc-kubernetes-cloud-as-platform.tanzu" : "VMware Tanzu",
    "vmc-kubernetes-cloud-as-platform.tanzu-mission-control-img-alt" : "Tanzu Mission Control : utiliser Kubernetes de manière cohérente",
    "vmc-kubernetes-cloud-as-platform.tanzu-portfolio-desc" : "VMware Tanzu est notre portefeuille de produits et de services visant à transformer le mode de création des logiciels sur Kubernetes.",
    "vmc-kubernetes-cloud-as-platform.tanzu-strategy-desc" : "Dans le cadre de notre stratégie visant à aider les clients à développer des applications modernes, à exécuter Kubernetes de manière cohérente dans divers environnements et à le gérer globalement à partir d'un point de contrôle unique, nous proposons VMware Tanzu.",
    "vmc-kubernetes-cloud-as-platform.tanzu-title" : "{0} + {1} = {2}",
    "vmc-kubernetes-cloud-as-platform.tanzu-velocity-desc" : "Créez des applications avec vélocité, exécutez Kubernetes open source de manière cohérente et gérez l'ensemble de votre installation en toute confiance.",
    "vmc-kubernetes-cloud-as-platform.title" : "VMware Cloud en tant que plate-forme pour Kubernetes",
    "vmc-kubernetes-cloud-as-platform.vision-implementation-desc" : "Les clients enthousiasmés par cette vision n'ont pas besoin d'attendre. Notre offre Kubernetes actuelle, VMware PKS, est entièrement alignée sur VMware Tanzu, y compris Project Pacific. Toutes les offres de VMware sont basées sur un noyau commun de Kubernetes open source avec une gestion intégrée du cycle de vie et des clusters. En outre, les clients qui souhaitent exécuter Kubernetes de manière cohérente sur des clouds choisiront VMware PKS. En bref, les clients démarrant l'évolution vers Kubernetes avec VMware pourront faire le premier pas maintenant en achetant et en déployant VMware PKS.",
    "vmc-kubernetes-cloud-as-platform.vmware" : "VMware",
    "vmc-kubernetes-faqs.answer-1" : "Désormais, VMware Tanzu Kubernetes Grid Plus prend en charge VMware Cloud on AWS. Cela permet aux clients de déployer leur SDDC dans le cloud, avec les composants nécessaires pour définir l'architecture et dimensionner Kubernetes en fonction de leurs besoins. VMware Tanzu Kubernetes Grid Plus est un environnement d'exécution Kubernetes certifié avec accès sécurisé aux technologies open source, notamment Kubernetes, la gestion du cycle de vie des clusters (Cluster API) et la gestion des images de conteneur (Harbor). Lorsque Tanzu Kubernetes Grid Plus s'exécute sur VMware Cloud on AWS, les clients peuvent déployer, dimensionner et gérer des clusters Kubernetes dans le cloud. Cela établit une base fiable pour la gestion des applications natives du cloud et la modernisation des applications. Lisez le blog <a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\">ici<clr-icon shape=\"pop-out\"></clr-icon>.</a>",
    "vmc-kubernetes-faqs.answer-10" : "Contactez votre représentant VMware pour obtenir plus d'informations sur la tarification de TKG+ sur VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-11" : "vSphere 7 with Kubernetes est disponible via VMware Cloud Foundation. Il fournit les services essentiels qui mettent en place les services d'infrastructure hybride. Les services d'infrastructure hybride et le service Tanzu Kubernetes Grid font partie des services VMware Cloud Foundation, disponibles via VMware Cloud Foundation 4. Pour en savoir plus à ce sujet, consultez ce blog. vSphere 7 with Kubernetes sera disponible sur VMware Cloud on AWS à l'avenir. Les clients qui souhaitent commencer à utiliser Kubernetes et les conteneurs sur VMware Cloud on AWS peuvent commencer avec Tanzu Kubernetes Grid Plus. Les clients sont responsables du déploiement et de la gestion des clusters TKG+ sur VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-12" : "Le client peut obtenir un support pour Tanzu Kubernetes Grid Plus sur VMware Cloud on AWS via les canaux de support VMC existants, notamment via le support par chat.",
    "vmc-kubernetes-faqs.answer-2" : "TKG+ inclut les fichiers binaires principaux pour installer un cluster TKG sur VMware Cloud on AWS plus la prise en charge et les services de l'ingénierie de fiabilité client et afin d'aider les clients à planifier, déployer et maintenir leur environnement Kubernetes. Vous trouverez une liste détaillée des technologies et des services pris en charge dans TKG+ dans l'article<a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\"> 78173 de la base de connaissances<clr-icon shape=\"pop-out\"></clr-icon></a>. Voici quelques légendes pertinentes : <ul class=\"list\"><li>Correction des problèmes critiques avant les versions en amont</li><li>Interface de stockage de conteneur (CSI) vSAN</li><li>Calico 2.6 et versions ultérieures</li><li>Contour pour entrée</li><li>Registre de conteneur Harbor</li><li>Velero pour la sauvegarde de cluster</li><li>Prometheus, Grafana et Fluentbit pour l'observation</li></ul>",
    "vmc-kubernetes-faqs.answer-3" : "Les clients sont responsables du déploiement et de la gestion des clusters TKG+ sur VMware Cloud on AWS. Les workflows de déploiement et de gestion de l'infrastructure TKG+ sont les mêmes que ceux sur site. VMware est responsable de la gestion des composants logiciels SDDC et de l'infrastructure IaaS.",
    "vmc-kubernetes-faqs.answer-4" : "Non. Tanzu Kubernetes Grid Plus est un logiciel qui peut être déployé par des clients sur IaaS (infrastructure en tant que service), fourni par VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-5" : "Tanzu Kuberenets Grid Plus (TKG+) est identique à toute autre charge de travail sur VMware Cloud on AWS qui est installée sur des VM. Le cluster de gestion peut être une VM unique, le cluster Kubernetes de charge de travail nécessite au moins 1 VM pour le nœud master et 1 VM pour le nœud worker (c'est-à-dire 2 VM au total).",
    "vmc-kubernetes-faqs.answer-6" : "TKG+ sur VMware Cloud on AWS est pris en charge dans toutes les régions où VMware Cloud on AWS est disponible aujourd'hui.",
    "vmc-kubernetes-faqs.answer-7" : "TKG+ est indépendant de l'infrastructure et aucune dépendance ne conditionne l'utilisation de NSX-T sur site si vous souhaitez déployer des clusters TKG+ sur VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-8" : "Avec l'abonnement TKG+, les systèmes d'exploitation pris en charge pour le nœud Kubernetes incluent Photon OS et Amazon Linux OS. La prise en charge de systèmes d'exploitation supplémentaires est actuellement prévue dans la feuille de route.",
    "vmc-kubernetes-faqs.answer-9" : "Les instances existantes d'Enterprise PKS ou de PKS Essentials n'autorisent pas les clients à exécuter TKG+ sur VMware Cloud on AWS. Les clients seront obligés d'acheter une licence d'abonnement TKG+.",
    "vmc-kubernetes-faqs.question-1" : "Qu'est-ce qui a été annoncé par rapport à VMware Cloud on AWS et VMware Tanzu Kubernetes Grid Plus ?",
    "vmc-kubernetes-faqs.question-10" : "Où trouver plus d'informations sur la tarification de TKG+ sur VMware Cloud on AWS ?",
    "vmc-kubernetes-faqs.question-11" : "Comment la prise en charge de Tanzu Kubernetes Grid Plus pour VMware Cloud on AWS est-elle liée à vSphere with Kubernetes ?",
    "vmc-kubernetes-faqs.question-12" : "Comment les clients peuvent-ils obtenir un support pour TKG+ sur VMware Cloud on AWS ?",
    "vmc-kubernetes-faqs.question-2" : "Qu'est-ce qui est inclus dans TKG+ ?",
    "vmc-kubernetes-faqs.question-3" : "Qui est responsable du déploiement et de la gestion des clusters TKG+ sur VMware Cloud on AWS ?",
    "vmc-kubernetes-faqs.question-4" : "Tanzu Kubernetes Grid Plus est-il une partie constituante de VMware Cloud on AWS ?",
    "vmc-kubernetes-faqs.question-5" : "Quel est le nombre minimal d'hôtes VMware Cloud on AWS requis pour un cluster TKG+ ?",
    "vmc-kubernetes-faqs.question-6" : "Quelles régions prennent en charge TKG+ sur VMware Cloud on AWS ?",
    "vmc-kubernetes-faqs.question-7" : "Ai-je besoin de NSX-T déployé sur site pour utiliser TKG+ sur VMware Cloud on AWS ?",
    "vmc-kubernetes-faqs.question-8" : "Quels sont les systèmes d'exploitation pris en charge pour les nœuds Kubernetes ?",
    "vmc-kubernetes-faqs.question-9" : "Les clients peuvent-ils utiliser des licences Enterprise PKS ou PKS Essentials existantes pour un déploiement TKG+ sur VMware Cloud on AWS ?",
    "vmc-kubernetes-faqs.title" : "FAQ : Kubernetes",
    "vmc-kubernetes-journey.browser-title" : "Parcours Kubernetes",
    "vmc-kubernetes-journey.deploy-and-validate" : "Déployer et valider",
    "vmc-kubernetes-journey.deploy-and-validate-TKG" : "Déployer et valider Tanzu Kubernetes Grid",
    "vmc-kubernetes-journey.deploy-and-validate-demo-app" : "Créez une application de démonstration.",
    "vmc-kubernetes-journey.deploy-and-validate-ssh-demo" : "Dispositif de démonstration SSH vers TKG.",
    "vmc-kubernetes-journey.deploy-and-validate-stage-desc" : "Après avoir effectué la configuration préalable, suivez le guide pour déployer Tanzu Kubernetes Grid. Le guide vous indique comment créer application de démonstration.",
    "vmc-kubernetes-journey.deploy-and-validate-tkg-demo" : "Déployez le fichier OVA de démonstration de VMC TKG.",
    "vmc-kubernetes-journey.deploy-and-validate-workload-clusters" : "Déployez des clusters de gestion et de charge de travail TKG.",
    "vmc-kubernetes-journey.learn" : "Découvrir",
    "vmc-kubernetes-journey.learn-kubernetes" : "En savoir plus sur Kubernetes",
    "vmc-kubernetes-journey.learn-stage-desc" : "Avec nos ressources d'apprentissage, vous découvrirez des aspects inconnus de Kubernetes \n                  et obtiendrez les informations dont vous avez besoin pour convaincre vos équipes d'applications d'y adhérer.\n            ",
    "vmc-kubernetes-journey.learn.kubernetes-academy" : "Apprenez avec les didacticiels vidéo de la VMware Kubernetes Academy.",
    "vmc-kubernetes-journey.learn.kubernetes-view-faq" : "Consultez les FAQ.",
    "vmc-kubernetes-journey.learn.what-kubernetes" : "Qu'est-ce que Kubernetes ?",
    "vmc-kubernetes-journey.learn.why-kubernetes" : "Pourquoi VMware Cloud constitue-t-il une excellente plate-forme pour Kubernetes ?",
    "vmc-kubernetes-journey.pre-requisites" : "Conditions préalables à la configuration",
    "vmc-kubernetes-journey.prerequisites-1-node" : "SDDC existant ou déployer un nouveau SDDC à 1 nœud.",
    "vmc-kubernetes-journey.prerequisites-configure" : "Configurez la mise en réseau et vCenter.",
    "vmc-kubernetes-journey.prerequisites-demo-appliance" : "Poste de travail pour accéder au SDDC et au dispositif de démonstration VMC TKG avec des ports spécifiques ouverts.",
    "vmc-kubernetes-journey.prerequisites-dhcp" : "Réseau DHCP pour exécuter des charges de travail TKG.",
    "vmc-kubernetes-journey.prerequisites-review" : "Vérifiez les conditions préalables.",
    "vmc-kubernetes-journey.prerequisites-stage-desc" : "Pour déployer Tanzu Kubernetes Grid, les conditions préalables suivantes s'appliquent :",
    "vmc-kubernetes-journey.prerequisites-tkg-demo" : "Configurez l'OVA de démonstration de TKG.",
    "vmc-kubernetes-journey.prerequisites-view" : "Affichez le guide.",
    "vmc-kubernetes-journey.stage" : "Étape ",
    "vmc-kubernetes-journey.title" : "Votre transition vers Kubernetes commence ici !",
    "vmc-kubernetes-journey.view-guide-btn" : "Afficher le guide",
    "vmc-kubernetes-journey.view-guide-top-btn" : "Afficher le guide",
    "vmc-kubernetes-journey.view-resources-btn" : "Afficher les ressources",
    "vmc-kubernetes-overview.browser-title" : "Présentation de Kubernetes",
    "vmc-kubernetes-overview.capabilities-automated-desc" : "<strong>Opérations à plusieurs clusters automatisées :</strong> avec la gestion déclarative du cycle de vie à plusieurs clusters, les mises à niveau et la correction simplifiées, ainsi que les outils API et CLI pour les opérations automatisées, Tanzu Kubernetes Grid Plus vous aide à gérer plus facilement les déploiements Kubernetes à grande échelle et à plusieurs clusters, et à automatiser les tâches manuelles pour réduire les risques d'utilisation.",
    "vmc-kubernetes-overview.capabilities-installation-desc" : "<strong>Installation simplifiée :</strong> Tanzu Kubernetes Grid Plus est conçu pour inclure les outils et les technologies open source nécessaires au déploiement et à l'utilisation cohérente d'un environnement Kubernetes évolutif, où que vous deviez exécuter vSphere, dans votre cloud géré VMware, dans le cloud public ou en périphérie.",
    "vmc-kubernetes-overview.capabilities-title" : "Capacités clés",
    "vmc-kubernetes-overview.challenges-growth-desc" : "<strong>Les clients souhaitent réduire la charge opérationnelle</strong> Les clients souhaitent réduire la charge opérationnelle lors du déploiement et de la gestion d'un nombre croissant de clusters Kubernetes.",
    "vmc-kubernetes-overview.challenges-lifecycle-desc" : "<strong>Les clients souhaitent se consacrer aux applications et à l'innovation</strong>, et non pas à la gestion du cycle de vie d'une infrastructure à faible valeur.",
    "vmc-kubernetes-overview.challenges-operations-desc" : "<strong>Les clients ont besoin d'une infrastructure</strong> et d'opérations cohérentes afin de déployer, d'exécuter et de gérer des clusters Kubernetes sur site et dans des environnements cloud.",
    "vmc-kubernetes-overview.challenges-order-desc" : "Afin de développer des applications modernes, <strong>les clients ont besoin d'une infrastructure évolutive</strong> dans le cloud pouvant répondre à l'évolution des besoins de l'entreprise et optimiser le coût de l'infrastructure.",
    "vmc-kubernetes-overview.challenges-title" : "Défis",
    "vmc-kubernetes-overview.description" : "Tanzu Kubernetes Grid Plus permet à vos développeurs de créer, exécuter et gérer la prochaine génération d'applications à l'aide de conteneurs orchestrés par Kubernetes.",
    "vmc-kubernetes-overview.enterprise-support-desc" : "<strong>Prise en charge de niveau entreprise :</strong> les clients qui déploient Tanzu Kubernetes Grid Plus sur VMware Cloud on AWS peuvent bénéficier d'une prise en charge des correctifs 24h/24, 7j/7 pour Kubernetes et les technologies d'écosystème open source. En outre, les clients qui envisagent de transformer le mode de création des applications peuvent demander au service VMware Pivotal Labs de mettre en œuvre des méthodes de développement agiles dans leur organisation et de raccourcir l'accès à la production.",
    "vmc-kubernetes-overview.get-started-btn" : "Démarrage",
    "vmc-kubernetes-overview.infrastructure-label" : "Infrastructure prise en charge :",
    "vmc-kubernetes-overview.integrated-services-desc" : "<strong>Services de plate-forme intégrée :</strong> Tanzu Kubernetes Grid Plus rationalise le déploiement de services locaux et en cluster pour simplifier la configuration des stratégies de registre d'image de conteneur, la surveillance, la journalisation, l'entrée, la mise en réseau et le stockage, et pour préparer votre environnement Kubernetes pour les charges de travail de production.",
    "vmc-kubernetes-overview.open-source-desc" : "<strong>Alignement open source : </strong> Tanzu Kubernetes Grid Plus vous aide à exécuter vos applications en conteneur sur une distribution Kubernetes en amont et sur les technologies open source, telles que Cluster API, Fluentbit et Contour, afin de mettre en œuvre la portabilité et de profiter du soutien et de l'innovation de la communauté Kubernetes globale. Il vous fournit également un service de réparation et de support proactif pour votre écosystème open source avec une ingénierie de fiabilité client.",
    "vmc-kubernetes-overview.solution-containerized-desc" : "Avec Tanzu Kubernetes Grid Plus déployé sur VMware Cloud on AWS, vous pouvez tirer parti d'une infrastructure à évolutivité élastique dans le cloud pour les charges de travail conteneurisées, et créer et dimensionner rapidement des clusters Kubernetes en fonction de vos besoins.",
    "vmc-kubernetes-overview.solution-establishes-desc" : "Cela établit une base flexible et fiable pour la modernisation des applications. Avec Kubernetes, vous obtenez une véritable portabilité d'application, afin que les applications ne soient jamais bloquées dans une distribution spécifique au fournisseur.",
    "vmc-kubernetes-overview.solution-overview-img-alt" : "Diagramme de l'architecture de solution",
    "vmc-kubernetes-overview.solution-release-desc" : "Avec la sortie d'une nouvelle version de Kubernetes, VMware collabore avec la communauté open source pour la tester et la renforcer en amont. Une fois que les fichiers binaires en amont stables auront été publiés, VMware signera les fichiers binaires à des fins de sécurité et les rendra disponibles au téléchargement. La création et la gestion de VMware TKG n'ont jamais été aussi simples, car elles ont été développées par des professionnels de Kubernetes.",
    "vmc-kubernetes-overview.solution-tanzu-grid-desc" : "VMware Tanzu Kubernetes Grid Plus sur VMware Cloud on AWS vous permet de déployer votre SDDC dans le cloud, avec tous les composants requis pour concevoir et dimensionner Kubernetes en fonction de vos besoins. VMware Cloud on AWS fournit une solution de cloud hybride intégrée de manière transparente qui étend les environnements vSphere sur site à un SDDC VMware s'exécutant sur Amazon EC2 (Amazon Elastic Compute Cloud), une infrastructure bare-metal entièrement intégrée dans le cadre d'AWS.",
    "vmc-kubernetes-overview.solution-title" : "Description de la solution",
    "vmc-kubernetes-overview.supported-infrastructure" : "VMware Cloud on AWS",
    "vmc-kubernetes-overview.tanzu-grid-development-desc" : "Le développement d'applications a un cycle évolutif imposant différentes dépendances sur l'infrastructure. Les applications modernes nécessitent de nouvelles plates-formes qui impliquent une utilisation déclarative, mais qui intègrent également des qualités transitoires. L'infrastructure sous-jacente doit s'adapter à ces nouvelles tendances pour gérer les charges de travail modernes.",
    "vmc-kubernetes-overview.tanzu-grid-modernization-desc" : "Conformément à cette initiative de modernisation, les organisations informatiques ont de plus en plus besoin de prendre en charge des applications basées sur des conteneurs. Le taux de modification dans l'espace de conteneur augmente d'un trimestre à l'autre. Les organisations informatiques traditionnelles qui ont besoin de gérer tous les types d'infrastructure et d'applications n'ont tout simplement pas le temps de suivre. La vitesse à laquelle la technologie de conteneur arrive à maturité nécessite une infrastructure extensible de manière élastique en fonction des besoins de l'entreprise, et qui exécute un logiciel récent et optimal accélérant l'innovation.",
    "vmc-kubernetes-overview.tanzu-grid-order-desc" : "Afin d'aider les clients à cet égard, nous proposons VMware Tanzu Kubernetes Grid Plus (TKG), l'environnement d'exécution Kubernetes pris en charge par VMware, sur VMware Cloud on AWS. Les organisations qui souhaitent démarrer l'exécution de conteneurs et de Kubernetes sur VMware Cloud on AWS peuvent commencer dès aujourd'hui avec VMware Tanzu Kubernetes Grid Plus. Conçu pour s'aligner sur la communauté Kubernetes afin d'assurer la cohérence entre les environnements, Tanzu Kubernetes Grid Plus fournit un accès sécurisé aux technologies open source essentielles, notamment Kubernetes, la gestion du cycle de vie du cluster (Cluster API) et un registre d'images de conteneurs (Harbor).",
    "vmc-kubernetes-overview.tanzu-grid-progress-desc" : "Au fur et à mesure que les organisations progressent vers la création et le déploiement d'applications cloud natives, une technologie cohérente et fiable doit être mise en place pour simplifier et supprimer une grande partie des approximations sous-jacentes.",
    "vmc-kubernetes-overview.tanzu-grid-simplified-desc" : "Avec la prise en charge de VMware Tanzu Kubernetes Grid Plus, les clients disposent d'un chemin simplifié pour exécuter Kubernetes sur VMware Cloud on AWS. Cette solution offre la standardisation, la commodité et la fiabilité de l'infrastructure pour relever les défis du déploiement et de la gestion des applications adaptées à Kubernetes. Avec VMware TKG sur VMware Cloud on AWS, il combine les capacités d'entreprise de VMware Software Defined Data Center (SDDC), notamment le calcul, le stockage et la mise en réseau, fournis en tant que service sur AWS, aux capacités de pointe de VMware TKG pour un déploiement de conteneur simple, sécurisé et cohérent.",
    "vmc-kubernetes-overview.tanzu-grid-title" : "VMware Tanzu Kubernetes Grid Plus sur VMware Cloud on AWS",
    "vmc-kubernetes-overview.technical-overview" : "Présentation technique",
    "vmc-kubernetes-overview.technical-overview-apps-desc" : "Cela apporte aux développeurs un chemin rapide leur permettant de déployer des applications modernes, tout en offrant une expérience Kubernetes cohérente pour les opérateurs dans les environnements d'entreprise, notamment vSphere sur site, dans le cloud public et en périphérie. Cela étend les applications basées sur des conteneurs exécutées sur Kubernetes pour qu'elles soient disponibles sur plusieurs domaines de pannes.",
    "vmc-kubernetes-overview.technical-overview-grid-desc" : "VMware Tanzu Kubernetes Grid Plus s'exécute sur le SDDC VMware fonctionnant sur une infrastructure bare metal élastique Amazon EC2 dédiée. VMware Tanzu Kubernetes Grid Plus est un environnement d'exécution Kubernetes adapté aux entreprises qui regroupe des technologies open source et des outils d'automatisation pour vous aider à devenir rapidement opérationnel dans un environnement Kubernetes évolutif à plusieurs clusters. Déployé sur VMware Cloud on AWS, il fournit une infrastructure à extensibilité élastique pour les charges de travail conteneurisées, et permet de créer et de dimensionner des clusters Kubernetes en fonction de vos besoins.",
    "vmc-kubernetes-overview.title" : "Kubernetes",
    "vmc-kubernetes-overview.video-btn" : "Lire la vidéo",
    "vmc-kubernetes-overview.video-poster-img-alt-txt" : "Tanzu Kubernetes Grid Plus sur VMware Cloud on AWS",
    "vmc-kubernetes-resources.browser-title" : "Ressources Kubernetes",
    "vmc-kubernetes-resources.cloud-as-platform" : "VMware Cloud en tant que plate-forme",
    "vmc-kubernetes-resources.faqs" : "FAQ",
    "vmc-kubernetes-resources.videos-and-docs" : "Vidéos et documents",
    "vmc-kubernetes-resources.what-is-kubernetes" : "Qu'est-ce que Kubernetes ?",
    "vmc-kubernetes-videos-and-docs.click-here-1" : "Cliquez pour regarder la série hebdomadaire en direct TGIKubernetes sur YouTube",
    "vmc-kubernetes-videos-and-docs.click-here-2" : "Cliquez ici pour lire ce livre électronique",
    "vmc-kubernetes-videos-and-docs.desc" : "Pour en savoir plus sur Kubernetes, reportez-vous à la section ci-dessous pour obtenir un ensemble organisé de ressources, notamment des livres blancs, des vidéos techniques et plus encore. Des ressources supplémentaires sont disponibles<a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\"> ici <clr-icon shape=\"pop-out\"></clr-icon></a>",
    "vmc-kubernetes-videos-and-docs.docs-title" : "Documents",
    "vmc-kubernetes-videos-and-docs.kube-academy-click-here" : "Cliquez ici pour accéder à VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-btn" : "Accéder à Kube Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-desc" : "Vous avez peu de disponibilité, mais souhaitez en savoir plus sur les conteneurs et Kubernetes ? Profitez des connaissances des principaux experts de Kube Academy. Les cours Kube Academy sont composés d'une série de courtes leçons vidéo développées par des instructeurs experts. Ces cours vous aideront à comprendre gratuitement les nouveaux concepts de Kubernetes.",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-img-alt" : "VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-title" : "VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.managing-book-btn" : "Lire le livre électronique",
    "vmc-kubernetes-videos-and-docs.managing-book-desc" : "Il y a la théorie sur Kubernetes, puis la pratique. Ce livre électronique est le dernier écrit par Brendan Burns (l'un des trois créateurs de Kubernetes) et Craig Tracey (architecte Kubernetes du personnel VMware).",
    "vmc-kubernetes-videos-and-docs.managing-book-img-alt" : "Gestion de Kubernetes",
    "vmc-kubernetes-videos-and-docs.managing-book-title" : "Gestion de Kubernetes",
    "vmc-kubernetes-videos-and-docs.pdf-click-here" : "Cliquez ici pour lire ce livre électronique",
    "vmc-kubernetes-videos-and-docs.title" : "Vidéos et documents : Kubernetes",
    "vmc-kubernetes-videos-and-docs.tutorials-desc" : "Chaque semaine, TGIKubernetes est une retransmission YouTube en direct permettant d'explorer les nouveaux outils et concepts Kubernetes. Rendez-vous chaque semaine à 13 h (Heure du Pacifique) pour suivre et apprendre. En outre, avec VMware Kubernetes Academy, vous pouvez profiter d'une série de courts didacticiels vidéo créés par les meilleurs instructeurs de VMware.",
    "vmc-kubernetes-videos-and-docs.tutorials-title" : "Didacticiels et série hebdomadaires en direct",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-btn" : "Lire le livre électronique",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-desc" : "Découvrez comment la technologie Kubernetes et de conteneur peut vous aider à atteindre de nouveaux niveaux de vélocité, d'agilité, de fiabilité et d'efficacité.",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-title" : "Kubernetes : mise en service",
    "vmc-kubernetes-videos-and-docs.up-and-running-img-alt" : "Mise en service de Kubernetes",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-btn" : "Regarder sur YouTube",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-desc" : "Venez échanger avec Joe Beda, qui propose une découverte pratique de Kubernetes et aborde d'autres sujets connexes. Joe abordera divers sujets qu'il connaît bien et explorera notamment des aspects inconnus du public. Posez des questions, commentez et orientez le débat.",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-img-alt" : "Série TGIKubernetes hebdomadaire en direct sur YouTube",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-title" : "Série YouTube hebdomadaire en direct : TGIKubernetes",
    "vmc-kubernetes-what-is-kubernetes.advantages-title" : "3. Avantages de Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.applications" : "Kubernetes augmente la charge des serveurs Web en fonction de la demande d'applications logicielles, puis dégrade les instances de serveur Web pendant les interruptions de service.",
    "vmc-kubernetes-what-is-kubernetes.architecture-desc" : "Kubernetes a évolué à partir du code utilisé par Google pour gérer ses centres de données à grande échelle avec la plate-forme « Borg ». AWS a introduit des structures de serveur Web élastiques pour le public avec le lancement de la plate-forme EC2. Kubernetes permet aux entreprises d'orchestrer des conteneurs comme EC2, mais en utilisant du code open source. Google, AWS, Azure et les autres grands hébergeurs cloud publics offrent tous la prise en charge de Kubernetes pour l'orchestration de serveurs Web cloud. Les clients peuvent utiliser Kubernetes pour l'externalisation complète des centres de données, les applications Web/mobiles, la prise en charge SaaS, l'hébergement Web cloud ou l'informatique haute performance.",
    "vmc-kubernetes-what-is-kubernetes.architecture-title" : "2. Architecture Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.automate" : "Kubernetes permet d'automatiser le provisionnement de serveur Web en fonction du niveau de trafic Web en production.",
    "vmc-kubernetes-what-is-kubernetes.automated" : "Le principal avantage de Kubernetes est la possibilité d'exploiter une plate-forme de serveur Web élastique et automatisée en production sans verrouillage fournisseur sur AWS avec le service EC2.",
    "vmc-kubernetes-what-is-kubernetes.capabilities" : "Kubernetes dispose également de fonctionnalités d'équilibrage de charge avancées pour le routage du trafic Web vers les serveurs Web opérationnels.",
    "vmc-kubernetes-what-is-kubernetes.desc" : "Kubernetes est une plate-forme open source d'orchestration de conteneur qui permet l'utilisation d'une structure de serveur Web élastique pour les applications cloud. Kubernetes peut prendre en charge l'externalisation de centre de données à des fournisseurs de services de cloud public ou peut être utilisé pour l'hébergement Web à grande échelle. Les applications Web et mobiles utilisant un code personnalisé complexe peuvent être déployées à l'aide de Kubernetes sur du matériel de base afin de réduire les coûts de provisionnement de serveur Web avec des hôtes cloud publics et d'optimiser les processus de développement logiciel.",
    "vmc-kubernetes-what-is-kubernetes.docker-desc" : "Kubernetes est une plate-forme open source d'orchestration de conteneur. Docker est la norme de virtualisation de conteneur principale utilisée avec Kubernetes. Les autres systèmes d'orchestration de serveur Web élastiques sont Docker Swarm, CoreOS Tectonic et Mesosphere. Intel a également une norme de conteneur concurrente avec Kata, et il existe plusieurs versions de conteneur Linux. Docker a la plus grande part de marché de la virtualisation de conteneurs pour les produits logiciels. Docker est une société de développement logiciel spécialisée dans la virtualisation de conteneurs, tandis que Kubernetes est un projet open source soutenu par une communauté de codeurs qui inclut des programmeurs professionnels de toutes les grandes entreprises informatiques.",
    "vmc-kubernetes-what-is-kubernetes.docker-title" : "5. Comparaison de Kubernetes et Docker",
    "vmc-kubernetes-what-is-kubernetes.features-img-alt" : "Document - Kubernetes for Executives",
    "vmc-kubernetes-what-is-kubernetes.features-title" : "1. Fonctionnalités de Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.features-tooltip" : "Cliquez pour lire l'article sur Kubernetes for Executives",
    "vmc-kubernetes-what-is-kubernetes.orchestration-desc" : "L'orchestration de conteneurs consiste en la gestion de serveurs Web individuels fonctionnant dans des conteneurs via des partitions virtuelles sur le matériel du centre de données. L'orchestration de conteneurs permet de maintenir l'infrastructure élastique pour les serveurs Web dans un centre de données, de manière automatisée en production. Les administrateurs peuvent définir des ressources qui peuvent être automatiquement démarrées si le trafic Web augmente au-delà de la capacité d'un seul serveur. Pour les applications SaaS, une évolution est possible pour prendre en charge des millions d'utilisateurs simultanés.",
    "vmc-kubernetes-what-is-kubernetes.orchestration-title" : "4. Orchestration de conteneur Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.scalability" : "Kubernetes permet à toute entreprise d'exploiter son code logiciel avec le même niveau d'évolutivité que les plus grandes entreprises mondiales grâce à une tarification compétitive des centres de données pour les ressources matérielles.",
    "vmc-kubernetes-what-is-kubernetes.server" : "Le matériel du serveur Web peut se trouver dans différents centres de données, sur un matériel différent ou via différents fournisseurs d'hébergement.",
    "vmc-kubernetes-what-is-kubernetes.services" : "Kubernetes fonctionne sur la plupart des services publics d'hébergement cloud et toutes les grandes entreprises offrent des prix compétitifs. Kubernetes permet l'externalisation complète d'un centre de données d'entreprise.",
    "vmc-kubernetes-what-is-kubernetes.title" : "Qu'est-ce que Kubernetes ?",
    "vmc-kubernetes-what-is-kubernetes.video-poster-img-alt-txt" : "Kubernetes en 5 minutes",
    "vmc-kubernetes-what-is-kubernetes.web-traffic" : "Kubernetes peut également être utilisé pour adapter des applications Web et mobiles en production aux plus hauts niveaux de trafic Web."
  }
}