{
  "component" : "docs",
  "locale" : "fr",
  "messages" : {
    "0004be8f6b3629f0e708d1ec68ed0e10" : "<!--\ntitle: Pourquoi mes machines virtuelles ne peuvent-elles pas accéder à Internet ?\ncontext: [networking,firewall]\n-->\n<p>Les règles de pare-feu de passerelle de calcul par défaut empêchent tout le trafic des VM d'atteindre Internet. Pour autoriser vos machines virtuelles à atteindre Internet, vous devez créer une règle de pare-feu de passerelle de calcul pour autoriser le trafic sortant sur le réseau logique auquel votre VM est connectée.</p>\n<ol class=\"list\">\n <li>Accédez à l'onglet <b>Réseau</b> pour le SDDC.</li>\n    <li>Sous <b>Passerelle de calcul</b>, développez la section <b>Règles de pare-feu</b>.</li>\n    <li>Cliquez sur <b>Ajouter une règle</b>.</li>\n    <li>Entrez les paramètres de la règle :        <ul class=\"list\">\n            <li><b>Nom de la règle :</b> entrez un nom pour la règle.</li>\n            <li><b>Action :</b> sélectionnez <b>Autoriser</b>.</li>\n            <li><b>Source :</b> entrez la plage d'adresses IP du bloc CIDR attribuée au réseau logique pour la VM.</li>\n            <li><b>Destination :</b> entrez <b>Any</b> (équivalent à Tous).</li>\n            <li><b>Service :</b> sélectionnez <b>Any (tout le trafic )</b>.</li>\n        </ul>\n    </li>\n\n</ol>",
    "0bedef5eb3bf011102af4dde2ffd30f3" : "<!--\ntitle: Quelles sont les fonctionnalités d'aperçu ?\ncontext: [dashboard]\n-->\n<p>Des fonctionnalités en aperçu ont été publiées pour obtenir des commentaires. Ces fonctionnalités sont désignées par l'icône <b>Aperçu</b> dans l'interface utilisateur. Ces fonctionnalités ne seront pas nécessairement disponibles pour tous les clients ou dans toutes les régions AWS. Nous ne pouvons garantir que les fonctionnalités en « Aperçu » deviendront disponibles à une échéance précise ni même la certitude de cette disponibilité. Prenez vos décisions d'achat uniquement sur la base des fonctionnalités déjà disponibles.</p>",
    "0f673b9345c9b2d37731c1bc20ea21d7" : "<!--\ntitle: Comment supprimer des hôtes ?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Vous pouvez supprimer un hôte à condition de rester au-dessus du seuil minimal de 3 hôtes dans un cluster SDDC :</p>\n<ol class=\"list\">\n    <li>Accédez à l'onglet <b>Résumé</b> pour votre SDDC.</li>\n    <li>Sélectionnez <b>Actions</b> &gt; <b>Supprimer des hôtes</b>.</li>\n    <li>Sélectionnez le nombre d'hôtes à supprimer.</li>\n    <li>Sélectionnez <b>J'ai compris que cette action est irréversible</b>.</li>\n    <li>Cliquez sur <b>Supprimer</b>.</li>\n</ol>\n<p>Le redimensionnement du SDDC peut prendre quelques heures. Pendant la suppression des hôtes, vos charges de travail et vCenter Server continuent à fonctionner normalement, mais vous ne pouvez pas démarrer d'autres actions d'ajout ou de suppression d'hôtes.</p>\n",
    "1041670326db849c3331e1879416f57a" : "<!--\ntitle: Comment définir mon organisation par défaut ?\ncontext: [dashboard]\n-->\n\n<p>Si vous êtes membre de plusieurs organisations, vous pouvez définir une organisation par défaut. Cette organisation sera affichée lorsque vous vous connectez.</p>\n<ol class=\"list\">\n    <li>Depuis le tableau de bord de la console VMC, cliquez sur votre nom d'utilisateur et votre organisation dans la barre d'outils.</li>\n    <li>Cliquez sur <b>Définir l'organisation par défaut</b> et sélectionner l'organisation que vous souhaitez utiliser par défaut.</li>\n</ol>",
    "147a7e2ad24bb56ec548c1540fcb6fe8" : "<!--\ntitle: Que puis-je faire sur la page de tableau de bord ?\ncontext: [dashboard]\n-->\n<p>Depuis le tableau de bord, vous pouvez :</p>\n<ul class=\"list\">\n    <li>Voir tous les SDDC créés dans l'organisation actuelle. Vous pouvez cliquer sur un SDDC individuel pour ouvrir vCenter Server, afficher les détails ou supprimer le SDDC.</li>\n    <li>Surveiller l'avancement des déploiements SDDC en cours.</li>\n    <li>Cliquez sur <b>Créer un SDDC</b> pour créer un SDDC.</li>\n    <li>Cliquez sur <b>Inviter des utilisateurs</b> pour inviter d'autres utilisateurs dans votre organisation.</li>\n    <li>Cliquez sur votre nom d'utilisateur dans le coin supérieur droit pour changer d'organisation (si vous êtes membre de plusieurs organisations), afficher votre profil, générer un jeton OAuth et définir votre organisation par défaut.</li>\n</ul>\n",
    "1611103ba0feffd85e1a9f1d8c264a91" : "<!--\ntitle: Comment configurer le DNS ?\ncontext: [networking,dns]\n-->\n<p>Configurez le DNS pour permettre aux machines de votre SDDC de résoudre des noms de domaine complets en adresses IP. Lors de la configuration du DNS, ne configurez pas un serveur DNS public et un serveur DNS privé (sur site), car cela peut produire des résultats de DNS imprévisibles. </p>\n<ol class=\"list\">\n    <li>Dans l'onglet Réseau pour votre SDDC, développez <b>DNS</b> sous <b>Passerelle de gestion</b> ou <b>Passerelle de calcul</b>. </li>\n    <li>Cliquez sur <b>Modifier</b>.</li>\n    <li>Entrez les adresses IP de <b>Serveur DNS 1</b> et (facultativement) <b>Serveur DNS 2</b>.</li>\n    <li>Si vous configurez le DNS pour la passerelle de gestion, choisissez le mode de résolution du nom de domaine complet de vCenter Server.        <ul class=\"list\">\n            <li>Si vous accédez à vCenter Server depuis Internet, sélectionnez <b>Adresse IP publique</b>.</li>\n            <li>Si vous avez configuré un VPN et utilisé le VPN pour accéder à vCenter Server, sélectionnez <b>Adresse IP privée</b>.</li>\n        </ul>\n    </li>\n    <li>Si vous configurez le DNS pour la passerelle de calcul et si vous avez configuré des serveurs DNS privés, assurez-vous d'avoir configuré votre VPN pour autoriser les demandes DNS sur le VPN de la passerelle de calcul en sélectionnant <b>cgw-dns-network</b> comme l'un des réseaux locaux pour VPN. Pour en savoir plus, consultez « Comment configurer une connexion VPN IPsec à la passerelle de calcul ? ». </li>\n</ol>\n",
    "1e7fa90bb4da44fd3a9411ebf9db3435" : "<!--\ntitle: Quels sont les paramètres de chiffrement recommandés pour les VPN IPsec ?\ncontext: [networking,vpn]\n-->\n<p>Sauf indication contraire, ces paramètres ne peuvent être modifiés dans la console VMC. Si vous choisissez d'autres valeurs pour les paramètres modifiables, assurez-vous que votre passerelle sur site est configurée en accord avec les valeurs que vous avez définies dans la console VMC. </p>\n<h4>Paramètres de la phase 1 Internet Key Exchange (IKE)</h4>\n<ul class=\"list\">\n    <li>Protocole : IKEv1</li>\n    <li>Mode ISAKMP : mode principal (désactiver le mode agressif)</li>\n    <li>Durée de vie d'ISAKMP/IKE SA : 28 800 secondes (8 heures)</li>\n    <li>Chiffrement (modifiable ) : AED-256</li>\n    <li>Hachage : SHA-1</li>\n    <li>Diffie-Hellman (modifiable) : groupe DH 2</li>\n    <li>Mode IPsec : Tunnel</li>\n    <li>Authentification IKE : clé pré-partagée</li>\n</ul>\n<h4>Paramètres de la phase 2</h4>\n<ul class=\"list\">\n    <li>Chiffrement (modifiable) : AES-256</li>\n    <li>Hachage : SHA-1</li>\n    <li>Mode Tunnel : mode Tunnel ESP (Encapsulating Security Payload)</li>\n    <li>Diffie-Hellman (modifiable) : groupe DH 2</li>\n    <li>Durée de vie SA : 3 600 secondes (1 heure)</li>\n    <li>PFS (Perfect Forward Secrecy) : activé</li>\n</ul>\n",
    "2283807a9964ef305873059103b3049b" : "<!--\ntitle: Quelle est la clé prépartagée ?\ncontext: [networking,vpn]\n-->\n<p>La clé pré-partagée est utilisée par les deux extrémités du tunnel VPN de la passerelle de gestion pour s'authentifier mutuellement. La passerelle SDDC et votre passerelle sur site doivent donc utiliser la même clé. La clé a une longueur maximale de 128 caractères. Traitez la clé pré-partagée comme un mot de passe : maintenez-la confidentielle, et n'utilisez pas l'e-mail ou d'autres méthodes non sécurisées pour communiquer la clé à d'autres personnes.</p>\n",
    "2c1ba2f7d865746fd731ed552a7f0b2e" : "<!--\ntitle: Comment accéder à vSphere Client ?\ncontext: [connection-info]\n-->\n<p>Avant de pouvoir accéder à vSphere Client, vous devez configurer une connexion VPN ou une règle de pare-feu pour autoriser l'accès à vCenter Server. Consultez <a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Définir les règles du pare-feu de la passerelle de gestion</a>.</p>\n<p>Cliquez sur le lien hypertexte sous <b>vSphere Client (HTML5)</b> et utilisez le nom d'utilisateur et le mot de passe affichés dans la page Informations de connexion pour vous connecter.</p>\n",
    "30b59ac2bbc24fc5bbec7cbb1e9a495f" : "<!--\ntitle: Comment créer une interface virtuelle publique ?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>Vous pouvez configurer une interface virtuelle publique pour accéder aux services publics AWS, tels que S3 pour utiliser la connexion Direct Connect. Vous pouvez également établir les tunnels VPN de passerelles de gestion et de calcul sur l'interface virtuelle publique Direct Connect.</p>\n<p>Avant de créer une interface virtuelle publique, assurez-vous que vous répondez aux <a href=\"http://docs.aws.amazon.com/fr_fr/directconnect/latest/UserGuide/WorkingWithVirtualInterfaces.html#vif-prerequisites\">Conditions préalables pour les interfaces virtuelles</a>.</p>\n<ol class=\"list\">\n    \n    <li>Connectez-vous à la console AWS.</li>\n    <li>Cliquez sur <b>Direct Connect</b>, puis cliquez sur <b>Interfaces virtuelles</b>.</li>\n    <li>Cliquez sur <b>Créer une interface virtuelle</b>.</li>\n    <li>Sélectionnez <b>Publique</b> pour créer une interface virtuelle publique, puis sélectionnez <b>Mon compte AWS</b> comme propriétaire de l'interface virtuelle.</li>\n</ol>\n<p>Une fois l'interface virtuelle publique créée, configurez vos VPN IPsec de passerelle de gestion et de calcul afin que l'adresse IP de passerelle distante et les réseaux distants correspondent au périphérique qui met fin à votre connexion Direct Connect dans votre centre de données sur site.</p>",
    "368b83feade4e30006d029979ca09467" : "<!--\ntitle: Je vais manquer d'espace de stockage. Que puis-je faire ?\ncontext: [summary]\n-->\n<p>Si vous avez la possibilité d'ajouter des hôtes et si votre SDDC n'a pas atteint son nombre maximal d'hôtes, vous pouvez ajouter un hôte pour augmenter la capacité de stockage disponible. Sinon, arrêtez des charges de travail ou migrez-les hors de votre SDDC.</p>",
    "371bacda2d54ffb6283b3c1ba319749f" : "<!--\ntitle: Quel est le VPC Amazon connecté ?\ncontext: [networking]\n-->\n<p>Pendant la création du SDDC, vous connectez votre SDDC à un compte AWS, puis sélectionnez un VPC et un sous-réseau dans ce compte. À l'aide d'un modèle CloudFormation, VMware Cloud™ on AWS crée une interface ENI (Elastic Network Interface), permettant à votre SDDC et aux services du VPC Amazon et du sous-réseau dans votre compte AWS de communiquer sans devoir router le trafic par la passerelle Internet. Vous ne pouvez connecter un SDDC qu'à un seul VPC Amazon.</p>\n\n<p>Vous pouvez voir les détails de votre VPC Amazon connecté, tels que l'ID du compte, l'ID VPC et le sous-réseau en cliquant sur <b>VPC Amazon connecté</b> dans l'onglet <b>Mise en réseau</b>.</p>\n",
    "399fb082e659bd059c329d47187b2c9b" : "<!--\ntitle: Comment accéder à vSphere Client ?\ncontext: [connection-info]\n-->\n<p>Avant de pouvoir accéder à vSphere Client, vous devez configurer une connexion VPN ou une règle de pare-feu pour autoriser l'accès à vCenter Server. Consultez <a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Définir les règles du pare-feu de la passerelle de gestion</a>.</p>\n<p>Cliquez sur le lien hypertexte sous <b>vSphere Client (HTML5)</b> et utilisez le nom d'utilisateur et le mot de passe affichés dans la page Informations de connexion pour vous connecter.</p>\n",
    "48964c31fdfaa31e73dd1678ae622e6d" : "<!--\ntitle: Comment configurer une connexion VPN IPsec à la passerelle de calcul ?\ncontext: [networking,vpn]\n-->\n<p>Vous pouvez créer une connexion VPN à partir de la passerelle de calcul de votre SDDC à votre réseau de calcul sur site.</p>\n<ol class=\"list\">\n    <li>Dans l'onglet Mise en réseau de votre SDDC, configurez le VPN de la passerelle de calcul.        <ul class=\"list\">\n            <li><b>Nom du VPN :</b> entrez un nom pour le VPN.</li>\n            <li><b>Adresse IP publique de passerelle distante :</b> entrez l'adresse IP de votre passerelle sur site.</li>\n            <li><b>Adresse IP privée de passerelle distante :</b> si votre passerelle sur site est derrière un NAT, entrez l'adresse IP privée de votre passerelle sur site.</li>\n            <li><b>Réseaux distants :</b> entrez l'adresse de vos réseaux de calcul sur site.</li>\n            <li><b>Adresse IP de la passerelle locale :</b> affiche l'adresse IP de la passerelle de calcul SDDC. Ce champ n'est pas modifiable.</li>\n            <li><b>Réseau local :</b> sélectionnez le réseau logique à connecter à l'aide de ce VPN. Si le réseau logique utilise DHCP et si vous avez configuré un serveur DNS sur site, sélectionnez également <b>cgw-dns-network</b> pour autoriser les demandes DNS à transiter sur le VPN. </li>\n            <li><b>Chiffrement :</b> sélectionnez <b>AES-256</b>.</li>\n            <li><b>PFS (Perfect Forward Secrecy) :</b> sélectionnez <b>Activé</b>.</li>\n            <li><b>Diffie Hellman :</b> sélectionnez un groupe Diffie Hellman. Celui-ci doit correspondre à ce que vous avez configuré pour votre passerelle sur site.</li>\n            <li><b>Clé pré-partagée :</b> entrez une chaîne de clé d'une longueur maximale de 128 caractères.</li>\n        </ul>\n    </li>\n    <li>Configurez la partie de votre environnement sur site du tunnel VPN en utilisant les paramètres de chiffrement recommandés. Pour en savoir plus sur la configuration de dispositifs de passerelle spécifiques, consultez le <i>Guide de démarrage de VMware Cloud on AWS</i>. </li>\n  \n</ol>\n<p>Vous pouvez vérifier que le tunnel VPN est connecté en consultant l'état du VPN sous l'onglet Mise en réseau.</p>\n",
    "48a5b54af2520255a60f1aeb8acc32fc" : "<!--\ntitle: Comment configurer une connexion VPN IPsec à la passerelle de calcul ?\ncontext: [networking,vpn]\n-->\n<p>Vous pouvez créer une connexion VPN à partir de la passerelle de calcul de votre SDDC à votre réseau de calcul sur site.</p>\n<ol class=\"list\">\n    <li>Dans l'onglet Mise en réseau de votre SDDC, configurez le VPN de la passerelle de calcul.        <ul class=\"list\">\n            <li><b>Nom du VPN :</b> entrez un nom pour le VPN.</li>\n            <li><b>Adresse IP publique de passerelle distante :</b> entrez l'adresse IP de votre passerelle sur site.</li>\n            <li><b>Adresse IP privée de passerelle distante :</b> si votre passerelle sur site est derrière un NAT, entrez l'adresse IP privée de votre passerelle sur site.</li>\n            <li><b>Réseaux distants :</b> entrez l'adresse de vos réseaux de calcul sur site.</li>\n            <li><b>Adresse IP de la passerelle locale :</b> affiche l'adresse IP de la passerelle de calcul SDDC. Ce champ n'est pas modifiable.</li>\n            <li><b>Réseau local :</b> sélectionnez le réseau logique à connecter à l'aide de ce VPN. Si le réseau logique utilise DHCP et si vous avez configuré un serveur DNS sur site, sélectionnez également <b>cgw-dns-network</b> pour autoriser les demandes DNS à transiter sur le VPN. </li>\n            <li><b>Chiffrement :</b> sélectionnez <b>AES-256</b>.</li>\n            <li><b>PFS (Perfect Forward Secrecy) :</b> sélectionnez <b>Activé</b>.</li>\n            <li><b>Diffie Hellman :</b> sélectionnez un groupe Diffie Hellman. Celui-ci doit correspondre à ce que vous avez configuré pour votre passerelle sur site.</li>\n            <li><b>Clé pré-partagée :</b> entrez une chaîne de clé d'une longueur maximale de 128 caractères.</li>\n        </ul>\n    </li>\n    <li>Configurez la partie de votre environnement sur site du tunnel VPN en utilisant les paramètres de chiffrement recommandés. Pour en savoir plus sur la configuration de dispositifs de passerelle spécifiques, consultez le <i>Guide de démarrage de VMware Cloud on AWS</i>. </li>\n  \n</ol>\n<p>Vous pouvez vous assurer que le tunnel VPN est connecté en vérifiant l'état du VPN sur la page Mise en réseau.</p>\n",
    "4b1343d42dce723ba29e55b781b412ac" : "<!--\ntitle: Comment attacher une interface virtuelle privée à mon SDDC de cloud ?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>Une interface virtuelle privée permet au trafic de gestion ESXi et au trafic vMotion de circuler via la connexion Direct Connect entre votre environnement sur site et votre SDDC.</p>\n<p>Avant de créer une interface virtuelle privée, assurez-vous que vous répondez aux <a href=\"http://docs.aws.amazon.com/fr_fr/directconnect/latest/UserGuide/WorkingWithVirtualInterfaces.html#vif-prerequisites\">Conditions préalables pour les interfaces virtuelles</a>.</p>\n<ol class=\"list\">\n    <li>Déterminez l'ID de votre compte VMC AWS. Celui-ci est affiché sous la section <b>Direct Connect</b> de l'onglet <b>Mise en réseau</b> de votre SDDC.</li>\n    <li>Connectez-vous à la console AWS.</li>\n    <li>Cliquez sur <b>Direct Connect</b>, puis sur <b>Interfaces virtuelles</b>.</li>\n    <li>Cliquez sur <b>Créer une interface virtuelle</b>.</li>\n    <li>Sélectionnez <b>Privé</b> pour créer une interface virtuelle privée. Sélectionnez <b>Autre compte AWS</b> comme propriétaire du compte, puis entrez l'ID de votre compte VMC AWS.</li>\n    <li>Connectez-vous à la console VMC et accédez à l'onglet <b>Mise en réseau</b> de votre SDDC.</li>\n    <li>Sous <b>Direct Connect</b>, développez <b>Interfaces virtuelles</b> et cliquez sur <b>Attacher</b> en regard de l'interface virtuelle que vous avez créée.</li>\n    <li>Sélectionnez <b>Je comprends que je serai responsable des frais de transfert de données encourus pour l'interface</b> et cliquez sur <b>Accepter l'interface virtuelle</b>.</li>\n    <li>Si un VPN IPsec est configuré, mettez à jour vos paramètres VPN.        <ol class=\"list\">\n            <li>Dans la console VMC, actualisez les paramètres VPN IPsec de gestion. Le diagramme de topologie réseau indique l'adresse du sous-réseau de dispositifs de gestion dans le champ <b>Sous-réseau de dispositifs</b>.</li>\n            <li>Mettez à jour le paramètre réseau distant dans votre passerelle sur site pour utiliser l'adresse du sous-réseau de dispositifs de gestion.</li>\n        </ol>\n    </li>\n</ol>\n",
    "4f87a32661f5b7d16a44c3302de7d26f" : "<!--\ntitle: Comment choisir la plage d'adresses IP du réseau de gestion ?\ncontext: [networking]\n-->\n<p>Vous ne pouvez pas modifier les valeurs spécifiées pour le réseau de gestion après la création du SDDC. Tenez compte de ce qui suit lorsque vous choisissez ces valeurs :</p>\n<ul class=\"list\">\n    <li>Les seules tailles prises en charge pour la plage de blocs CIDR sont /23, /20 et /16.</li>\n\t<li>Si vous prévoyez de connecter votre SDDC à un centre de données sur site, pour éviter tout conflit d'adresses, les adresses IP que vous choisissez pour votre SDDC doivent être différentes de celles de votre centre de données sur site.</li>\n\t<li>Le nombre maximal d'hôtes que votre SDDC peut contenir dépend de la taille du bloc CIDR que vous spécifiez. Si le bloc CIDR est spécifié sous la forme XXX.XXX.XXX.XXX/YY, le nombre maximal d'hôtes que le SDDC peut contenir sera (2 ^(27 - YY)) - 3. Par exemple, si vous spécifiez le bloc CIDR 192.0.2.0/23, le nombre maximal d'hôtes est (2 ^(27 - 23)) - 3, ou 13.</li>\n</ul>\n<p><b>Remarque :</b> bien que le nombre d'adresses IP d'hôtes disponibles dans un bloc CIDR /16 soit 2 045, le nombre maximal d'hôtes dans le SDDC est limité par d'autres facteurs à 160.</p>",
    "504c453076570eee108f676037cdb3fd" : "<!--\ntitle: Comment inviter un autre utilisateur ?\ncontext: [dashboard]\n-->\n\n<p>Pour inviter un autre utilisateur, vous devez être un propriétaire d'organisation.</p>\n<ol class=\"list\">\n    <li>Dans le tableau de bord de la console VMC, cliquez sur <b>Inviter des utilisateurs</b>.</li>\n    <li>Entrez les adresses e-mail des utilisateurs que vous souhaitez inviter.</li>\n    <li>Sélectionnez le rôle des utilisateurs que vous invitez. Vous pouvez sélectionner <b>Propriétaire de l'organisation</b> ou <b>Membre de l'organisation</b>.</li>\n    <li>Cliquez sur <b>Ajouter</b>.</li>\n</ol>\n<p>Les utilisateurs que vous invitez recevront un e-mail comportant un lien et des instructions supplémentaires leur permettant de s'inscrire dans VMware Cloud on AWS.</p>",
    "512168942276546150ab4591791d2c97" : "<!--\ntitle: Comment configurer une connexion VPN IPsec à la passerelle de gestion ?\ncontext: [networking,vpn]\n-->\n<p>Vous pouvez créer une connexion VPN de la passerelle de gestion de votre SDDC à votre réseau de gestion sur site.</p>\n<ol class=\"list\">\n    <li>Dans l'onglet Mise en réseau de votre SDDC, configurez le VPN de la passerelle de gestion.        <ul class=\"list\">\n            <li><b>Nom du VPN :</b> entrez un nom pour le VPN.</li>\n            <li><b>Adresse IP publique de passerelle distante :</b> entrez l'adresse IP publique de votre passerelle sur site.</li>\n            <li><b>Adresse IP privée de passerelle distante :</b> si votre passerelle sur site est derrière NAT, entrez l'adresse IP privée de votre passerelle sur site.</li>\n            <li><b>Réseaux distants :</b> entrez l'adresse de vos réseaux de gestion sur site.</li>\n            <li><b>Adresse IP de la passerelle locale :</b> affiche l'adresse IP de la passerelle de gestion du SDDC. Ce champ n'est pas modifiable.</li>\n            <li><b>Réseau local :</b> affiche le bloc CIDR du sous-réseau de gestion pour la passerelle de gestion. Ce champ n'est pas modifiable.</li>\n            <li><b>Chiffrement :</b> sélectionnez <b>AES-256</b>.</li>\n            <li><b>PFS (Perfect Forward Secrecy) :</b> sélectionnez <b>Activé</b>.</li>\n            <li><b>Diffie-Hellman :</b> sélectionnez un groupe Diffie-Hellman. Celui-ci doit correspondre à ce que vous avez configuré pour votre passerelle sur site.</li>\n            <li><b>Clé pré-partagée :</b> entrez une chaîne de clé d'une longueur maximale de 128 caractères.</li>\n        </ul>\n    </li>\n    <li>Configurez la partie de votre environnement sur site du tunnel VPN en utilisant les paramètres de chiffrement recommandés. Pour en savoir plus sur la configuration de dispositifs de passerelle spécifiques, consultez le <i>Guide de démarrage de VMware Cloud on AWS</i>. </li>\n\n</ol>\n<p>Vous pouvez vous assurer que le tunnel VPN est connecté en vérifiant l'état du VPN sur la page Mise en réseau.</p>\n",
    "51e82d2f893994cad4a0435b6704fa8a" : "<!--\ntitle: Quelles règles de pare-feu sont nécessaires pour Site Recovery ?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n\n<p>\n    Vous devez créer plusieurs règles de pare-feu pour activer le trafic de gestion et de réplication, ainsi que le service VMware Site Recovery.\n</p>\n\n<p>\n    Pour activer la gestion et l'accès aux API :\n</p>\n\n<ol>\n    <li>Autorisez le service HTTPS entrant (TCP 433) vers vCenter</li>\n    <li>Autorisez le service SRM Server Management entrant (TCP 9086) vers Site Recovery Manager</li>\n    <li>Autorisez le service VR Server Management entrant (TCP 8043) vers vSphere Replication</li>\n    <li>Autorisez le service « Any » équivalant à Tous (tout le trafic) sortant depuis vCenter, Site Recovery Manager et vSphere Replication</li>\n</ol>\n\n<p>\n    Pour activer le trafic de réplication :\n</p>\n\n<ol>\n    <li>Autorisez le service VM Replication entrant (TCP 31031, 44046) vers vSphere Replication</li>\n    <li>Autorisez le service « Any » équivalant à Tous (tout le trafic) sortant depuis la gestion ESXi uniquement</li>\n</ol>\n\n<p>\n    Pour activer l'accès à la console Site Recovery\n</p>\n\n<ol>\n    <li>Autorisez HTTPS entrant (TCP 443) vers vSphere Replication</li>\n</ol>\n",
    "52939d0bf7f6e015fc43b762e1fe79b0" : "<!--\ntitle: Puis-je ajouter des hôtes à mon SDDC ultérieurement ?\ncontext: [create-sddc]\n-->\n<p>Vous pouvez déployer des hôtes supplémentaires ultérieurement si votre SDDC contient moins d'hôtes que le maximum alloué à votre organisation.</p>\n\n    \n\n",
    "52b8f73acf9935a10aed190f248e5a6c" : "<!--\ntitle: Comment supprimer un autre utilisateur ?\ncontext: [dashboard]\n-->\n\n<p>Pour supprimer un autre utilisateur d'une organisation, vous devez être un propriétaire d'organisation.</p>\n<ol class=\"list\">\n    <li>Dans le tableau de bord de la console VMC, cliquez sur l'icône Services dans le coin supérieur droit de la fenêtre, puis sélectionnez <b>Gestion des identités et des accès</b>.</li>\n    <li>Sélectionnez l'utilisateur ou les utilisateurs que vous souhaitez supprimer.</li>\n    <li>Cliquez sur <b>Supprimer des utilisateurs</b>.</li>\n    <li>Cliquez sur <b>Supprimer</b> pour confirmer la suppression.</li>\n</ol>\n<p>L'utilisateur est supprimé de l'organisation et ne pourra plus accéder aux ressources de l'organisation.</p>",
    "5ba0833e46158bb895f9a8776f02fb99" : "<!--\ntitle: Qu'est-ce que le module complémentaire Site Recovery ?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n\n<p>VMware Site Recovery Manager vous permet d'effectuer une récupération d'urgence automatique de machines virtuelles à partir de votre centre de données sur site vers votre SDDC dans le cloud.</p>\n",
    "5c4cd561f50297e3eb2c5783b9405139" : "<!--\ntitle: Comment créer un SDDC ?\ncontext: [dashboard,create-sddc]\n-->\n<p>Pendant la création du SDDC, vous connectez votre SDDC à un compte AWS, puis sélectionnez un VPC et un sous-réseau dans ce compte. À l'aide d'un modèle CloudFormation, VMware Cloud™ on AWS crée une interface ENI (Elastic Network Interface), permettant à votre SDDC et aux services du VPC Amazon de communiquer sans devoir router le trafic par la passerelle Internet. Vous ne pouvez connecter un SDDC qu'à un seul VPC Amazon.</p>\n<p>Assurez-vous de disposer d'un compte AWS et d'un VPC adéquat avant de créer un SDDC. Créez le VPC dans la région où vous prévoyez d'utiliser votre SDDC, et créez un sous-réseau avec au moins 64 adresses IP (un bloc CIDR /27) dans chaque zone de disponibilité (AZ) de votre VPC.</p>\n<p>Pour créer un SDDC :</p>\n<ol class=\"list\">\n    <li>Dans le tableau de bord, cliquez sur <b>Créer un SDDC</b>.</li>\n    <li>Suivez les étapes pour vous connecter à votre compte AWS, définissez les propriétés du SDDC et sélectionnez le sous-réseau. Pour en savoir plus, consultez <a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-EF198D55-03E3-44D1-AC48-6E2ABA31FF02.html\" target=\"_blank\">Déployer un SDDC à partir de la console VMC</a>.</li>\n</ol>\n<p>L'état du déploiement du SDDC s'affiche dans le tableau de bord.</p>\n",
    "6ced784d9c5e00071eff86b77b849f2e" : "<!--\ntitle: Que puis-je faire sur la page Mise en réseau ?\ncontext: [networking]\n-->\n<p>Sur la page Mise en réseau, vous pouvez :</p>\n<ul class=\"list\">\n    <li>Voir un diagramme de topologie montrant l'état des connexions réseau vers et en provenance de votre SDDC.</li>\n    <li>Créer des règles de pare-feu pour les passerelles de gestion et de calcul.</li>\n    <li>Configurer des paramètres VPN pour les connexions VPN IPsec entre votre SDDC et un centre de données sur site.</li>\n    <li>Configurer les paramètres de DNS pour les passerelles de gestion et de calcul.</li>\n    <li>Afficher les réseaux logiques. (Pour configurer les réseaux logiques, utilisez vSphere Client.)</li>\n    <li>Configurer le NAT entrant pour votre passerelle de calcul.</li>\n    <li>Créer des adresses IP publiques pour votre passerelle de calcul.</li>\n    <li>Afficher des informations sur votre VPC Amazon connecté.</li>\n    <li>Attacher des interfaces virtuelles privées AWS Direct Connect à votre SDDC.</li>\n</ul>\n",
    "7f1e7006f73bb6f25bf233669f10341a" : "<!--\ntitle: Comment configurer les règles de pare-feu de la passerelle de calcul ?\ncontext: [networking,firewall]\n-->\n<p>Par défaut, le pare-feu pour la passerelle de calcul est défini de manière à refuser tout le trafic entrant et sortant. Ajoutez des règles de pare-feu supplémentaires pour autoriser le trafic si nécessaire.</p>\n<ol class=\"list\">\n    <li>Accédez à l'onglet <b>Réseau</b> pour le SDDC.</li>\n    <li>Sous <b>Passerelle de calcul</b>, développez la section <b>Règles de pare-feu</b>.</li>\n    <li>Cliquez sur <b>Ajouter une règle</b>.</li>\n    <li>Entrez les paramètres de la règle :        <ul class=\"list\">\n            <li><b>Nom de la règle :</b> entrez un nom pour la règle.</li>\n            <li><b>Action :</b> sélectionnez <b>Autoriser</b> ou <b>Refuser</b>.</li>\n            <li><b>Source :</b> entrez ou sélectionnez l'un des éléments suivants.                <ul class=\"list\">\n                <li>Sélectionnez <b>Toutes les connexions Internet et VPN</b> pour appliquer la règle à tout le trafic en provenance d'Internet et du VPN.</li>\n                <li>Sélectionnez <b>Toutes les instances connectées de VPC Amazon</b> pour appliquer la règle à tout le trafic en provenance du VPC Amazon connecté.</li>    \n                <li>Entrez <b>Any</b> (équivalent à Tous) pour appliquer la règle au trafic issu de toutes les sources.</li>\n                <li>Entrez une ou plusieurs adresses IP ou plages d'adresses IP, séparées par des virgules pour appliquer la règle au trafic issu de ces adresses IP spécifiques. </li>    \n                </ul>\n            </li>\n            <li><b>Destination :</b> </b> entrez ou sélectionnez l'un des éléments suivants.\n                <ul class=\"list\">\n                <li>Sélectionnez <b>Toutes les connexions Internet et VPN</b> pour appliquer la règle à tout le trafic vers Internet et le VPN.</li>\n                <li>Sélectionnez <b>Toutes les instances connectées de VPC Amazon</b> pour appliquer la règle à tout le trafic vers le VPC Amazon connecté.</li>    \n                <li>Entrez <b>Any</b> (équivalent à Tous) pour appliquer la règle au trafic vers toutes les sources.</li>\n                <li>Entrez une ou plusieurs adresses IP ou plages d'adresses IP, séparées par des virgules pour appliquer la règle au trafic vers ces adresses IP spécifiques. </li>    \n                </ul></li>\n            <li><b>Service :</b> sélectionnez l'un des choix suivants :                <ul class=\"list\">\n                    <li><b>Any (tout le trafic) :</b> la règle s'applique à tout le trafic.</li>\n                    <li>Un service spécifique : la règle s'applique au trafic en provenance du service et du port sélectionnés.</li>\n                    <li><b>ICMP (tout ICMP)</b> : la règle s'applique à tout le trafic ICMP</li>\n                    <li><b>TCP personnalisé</b> ou <b>UDP personnalisé</b> : pour définir un service et un port personnalisés auxquels appliquer la règle.</li>\n                </ul>\n            </li>\n            <li><b>Ports :</b> si vous sélectionnez un service TCP ou UDP personnalisé, entrez le numéro de port.</li>\n        </ul>\n    </li>\n</ol>\n<p>Les règles de pare-feu sont appliquées dans l'ordre de haut en bas. Utilisez les icônes flèches haut et bas pour déplacer les règles de pare-feu</p>\n",
    "815b9b868cca3fed897e848acddbf460" : "<!--\ntitle: Qu'est-ce que le module complémentaire Hybrid Cloud Extension ?\ncontext: [hcx,addons]\n-->\n\n<p>VMware Hybrid Cloud Extension (HCX) abstrait les ressources sur site et cloud, puis les présente aux charges de travail comme un cloud hybride. Cela permet la mobilité des charges de travail entre votre centre de données sur site et le SDDC de cloud.</p>\n<p>HCX est inclus dans le cadre de votre service VMC on AWS. Pour en savoir plus sur l'installation et la configuration de HCX, consultez <a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws\n.getting-started/GUID-DAE9B318-294A-4422-BBF4-82AE9DDFF043.html\">Migration hybride avec une liste de contrôle HCX</a>.</p>",
    "8779212284284274601fb331ab4033a1" : "<!--\ntitle: Comment créer un réseau logique ?\ncontext: [networking,logical-network]\n-->\n<p>Les réseaux logiques sont affichés dans la console VMC, mais vous utilisez vSphere Client pour les créer. </p>\n<ol class=\"list\">\n    <li>Dans l'onglet <b>Informations de connexion</b> pour votre SDDC, cliquez sur le lien sous <b>vSphere Client (HTML5)</b> et connectez-vous avec vos informations d'identification vCenter Server.</li>\n    <li>Sélectionnez <b>Menu</b> &gt; <b>Listes d'inventaires globaux</b>, puis sélectionnez <b>Réseaux logiques</b></li>\n    <li>Cliquez sur le bouton Ajouter.</li>\n    <li>Dans le champ de texte <b>Nom</b>, entrez un nom pour le réseau logique.</li>\n    <li>Dans le champ de texte <b>Bloc CIDR</b>, entrez un bloc CIDR au format xxx.xxx.xxx.0/YY. <p>La longueur du préfixe doit être comprise entre 22 et 30, car votre réseau logique doit disposer de 1 000 ports au maximum.</p></li>\n    <li>(Facultatif) Sélectionnez <b>Activé</b> pour activer DHCP. <p>Si vous activez DHCP sur un réseau logique et si vous avez configuré un serveur DNS sur site, vous devez modifier votre VPN de passerelle de calcul pour permettre de transférer correctement les requêtes DNS sur le VPN en sélectionnant <b>cgw-dns-network</b> comme l'un des réseaux locaux pour VPN.</p></li>\n    <li>Cliquez sur <b>OK</b>.</li>\n</ol>\n",
    "8c9c25e613fcceef9f17aab074171d86" : "<!--\ntitle: Que puis-je faire sur la page Résumé ?\ncontext: [summary]\n-->\n<p>La page Résumé affiche l'utilisation actuelle du CPU, de la mémoire et du stockage de votre SDDC. Vous pouvez également ajouter des hôtes à votre SDDC et en supprimer depuis cette page.</p>",
    "8e142af13e14fd0858db11652a4f6a91" : "<!--\ntitle: Comment gérer les accès à vCenter Server ?\ncontext: [networking,firewall,vpn]\n-->\n<p>Par défaut, il n'y a pas d'accès externe au système vCenter Server dans votre SDDC. Pour ouvrir l'accès à votre système vCenter Server, procédez comme suit :</p>\n<ul class=\"list\">\n    <li>Configurez une règle de pare-feu pour autoriser l'accès au système vCenter Server.</li>\n    <li>Configurez un VPN IPsec entre votre centre de données sur site et votre SDDC.</li>\n</ul>\n<p>Une fois que vous avez configuré l'une de ces options, cliquez sur l'onglet <b>Informations de connexion</b> pour voir comment vous connecter à vCenter Server en utilisant vSphere Client et PowerCLI.</p>\n",
    "907e29f426a0e6cfe310ca3065113696" : "<!--\ntitle: Que se passe-t-il lorsque je supprime un SDDC ?\ncontext: [dashboard]\n-->\n<p>Lorsque vous supprimez un SDDC, vos VM et vos données sont supprimées, et les hôtes ainsi que les autres ressources allouées au SDDC sont libérés pour utilisation dans d'autres SDDC. Sauvegardez ou migrez d'éventuelles données essentielles et VM avant de supprimer un SDDC.</p>\n",
    "9473fdd0d880a43c21b7778d34872157" : "tester le contenu",
    "99a1f78f70ee152574b1f192a311da43" : "<!--\ntitle: Comment supprimer un SDDC ?\ncontext: [dashboard]\n-->\n<p>Dans le tableau de bord, localisez la fiche pour le SDDC et cliquez sur <b>Actions</b> &gt; <b>Supprimer le SDDC</b>.</p>\n",
    "9a5c79ad338ec95353d9a47570c368bc" : "<!--\ntitle: Puis-je inviter un utilisateur qui ne dispose d'aucun compte MyVMware ?\ncontext: [dashboard, invite]\n-->\n\n<p>Oui. L'utilisateur sera invité à créer un compte MyVMware pendant le processus d'inscription.</p>",
    "9a876507c260d5e28f7888e94b34c30b" : "<!--\ntitle: Comment configurer les règles de pare-feu de passerelle de gestion ?\ncontext: [networking,firewall]\n-->\n<p>Par défaut, le pare-feu de la passerelle de gestion est défini pour interdire tout trafic entrant et sortant. Ajoutez des règles de pare-feu supplémentaires pour vous permettre d'atteindre vCenter Server et d'autoriser d'autre trafic si nécessaire.</p>\n<ol class=\"list\">\n    <li>Accédez à l'onglet <b>Réseau</b> pour le SDDC.</li>\n    <li>Sous <b>Passerelle de gestion</b>, développez la section <b>Règles de pare-feu</b>.</li>\n    <li>Cliquez sur <b>Ajouter une règle</b>.</li>\n    <li>Entrez les paramètres de la règle :        <ul class=\"list\">\n            <li><b>Nom de la règle :</b> entrez un nom descriptif pour la règle.</li>\n              <li><b>Action :</b> seule l'action <b>Autoriser</b> est disponible pour les règles de pare-feu de la passerelle de gestion.</li>\n            <li><b>Source :</b> entrez l'un des éléments suivants :                <ul class=\"list\">\n                    <li>une adresse IP, une plage d'adresses IP ou <b>Any</b> (équivalent à Tous) pour autoriser le trafic depuis cette adresse ou cette plage d'adresses.</li>\n                    <li><b>vCenter</b> pour autoriser le trafic en provenance de l'instance de vCenter Server de votre SDDC.</li>\n                    <li><b>Gestion ESXi uniquement</b> pour autoriser le trafic en provenance de la gestion ESXi de votre SDDC.</li>\n                </ul>\n            </li>\n            <li><b>Destination :</b>entrez l'un des éléments suivants :                <ul class=\"list\">\n                    <li>une adresse IP, une plage d'adresses IP ou <b>Any</b> (équivalent à Tous) pour autoriser le trafic vers cette adresse ou cette plage d'adresses.</li>\n                    <li><b>vCenter</b> pour autoriser le trafic vers l'instance de vCenter Server de votre SDDC.</li>\n                    <li><b>Gestion ESXi uniquement</b> pour autoriser le trafic vers la gestion ESXi de votre SDDC.</li>\n                </ul>\n            </li>\n            <li><b>Service</b> : sélectionnez l'un des choix suivants :                <ul class=\"list\">\n                    <li><b>Any (tout le trafic)</b></li>\n                    <li><b>HTTPS (TCP 443)</b> : s'applique uniquement à vCenter Server comme destination.</li>\n                    <li><b>Provisionnement (TCP 902)</b> : s'applique uniquement à la gestion ESXi en tant que destination.</li>\n                    <li><b>Console distante (TCP 903)</b> : s'applique uniquement à la gestion ESXi en tant que destination.</li>\n                    <li><b>ICMP (tout ICMP)</b></li>\n                </ul>\n            </li>  \n            <li><b>Port</b> : ce paramètre non modifiable indique le port du service sélectionné.</li>\n        </ul>\n    </li>\n</ol>\n<p>Les règles de pare-feu sont appliquées dans l'ordre de haut en bas. Utilisez les icônes flèches haut et bas pour déplacer les règles de pare-feu</p>\n",
    "9fee73eeba958dca24974ae6e88a6c55" : "<!--\ntitle: Qu'est-ce qu'Amazon Direct Connect ?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>AWS Direct Connect est un service fourni par AWS qui vous permet de créer une connexion à haut débit et à faible latence entre votre centre de données sur site et les services AWS.</p>\n\n<p>Direct Connect est accessible par le biais d'une interface virtuelle privée ou publique. Vous pouvez utiliser une interface virtuelle privée pour la gestion ESXi et le trafic vMotion entre votre centre de données sur site et votre SDDC de cloud. Vous pouvez utiliser une interface virtuelle publique pour accéder aux services AWS publics et router le trafic VPN IPsec de la passerelle de gestion sur Direct Connect.</p>\n",
    "a82311223952969b5c0c177b512d9a90" : "<!--\ntitle: À propos de VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>Copyright © 2017-2018 VMware, Inc. Tous droits réservés. Ce produit est protégé par les lois relatives aux droits d'auteur et à la propriété intellectuelle aux États-Unis et dans d'autres pays, ainsi que par des traités internationaux. Les produits VMware sont couverts par un ou plusieurs brevets dont la liste figure à l'adresse <a href=\"http://www.vmware.com/go/patents-fr\" target=\"_blank\">http://www.vmware.com/go/patents-fr</a>.</p>\n<p>VMware est une marque déposée ou une marque commerciale de VMware, Inc. aux États-Unis et dans d'autres juridictions. Tous les autres noms et marques mentionnés aux présentes peuvent être des marques de leurs sociétés respectives.</p>\n",
    "about-vmc-on-aws" : "<!--\ntitle: À propos de VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>\n    Copyright © 2017-2020 VMware, Inc. Tous droits réservés. Ce produit est protégé par les lois relatives aux droits d'auteur et à la propriété\n    intellectuelle aux États-Unis et dans d'autres pays, ainsi que par des traités internationaux. Les produits VMware sont\n    couverts par un ou plusieurs brevets dont la liste figure à l'adresse <a\n        href=\"http://www.vmware.com/go/patents-fr\"\n        target=\"_blank\"\n    >http://www.vmware.com/go/patents-fr</a>.\n</p>\n<p>\n    VMware est une marque déposée ou une marque commerciale de VMware, Inc. aux États-Unis et dans d'autres juridictions.\n    Tous les autres noms et marques mentionnés aux présentes peuvent être des marques de leurs sociétés respectives.</p>\n",
    "ad24817552198eb1a923aebd467e0274" : "<!--\ntitle: Comment dépanner les erreurs de connexion VPN IPsec ?\ncontext: [networking,vpn]\n-->\n<p>Après avoir créé une connexion VPN entre la passerelle de calcul de\n    votre SDDC et un réseau de calcul sur site, vous pouvez vérifier que le tunnel VPN est\n    connecté en consultant l'état du VPN sous l'onglet Mise en réseau.\n    La création de VPN peut échouer en raison d'une configuration incorrecte\n    de l'extrémité SDDC ou sur site du réseau. Pour plus d'informations sur\n    l'état du VPN, y compris les messages d'erreur de canal et de tunnel, cliquez sur\n    Détails de l'état du VPN. Cette liste de messages d'erreur du VPN inclut\n    des correctifs suggérés en fonction de la cause principale de l'erreur.</p>\n\n<p>\n    Message de canal :\n    <kbd>Policy does not allow OAKLEY_RSA_SIG authentication...</kbd>\n    <br>Message de tunnel :\n    <kbd> No acceptable Oakley Transform, sending notification...</kbd>\n    <br> <strong>Correctif suggéré :</strong> définissez le mode d'authentification\n    du VPN sur site sur PSK.\n</p>\n<p>\n    Message de canal :\n    <kbd>peer is NATed...</kbd>\n    <br>Message de tunnel :\n    <kbd>peer is NATed...</kbd>\n    <br> <strong>Correctif suggéré :</strong> vérifiez que le pare-feu\n    sur site ouvre le port 4500 pour le trafic UDP entre le VPN sur site\n    et l'adresse IP publique du VPN du SDDC.\n<p>\n    Message de canal :\n    <kbd> sending notification NO_PROPOSAL_CHOSEN ...</kbd>\n    <br>Message de tunnel :\n    <kbd> NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> téléchargez la configuration du VPN\n    du SDDC et vérifiez que le VPN sur site a la même IPsec_configuration\n    de phase 1.\n</p>\n<p>\n    Message de canal : aucun<br> Message de tunnel :\n    <kbd> NO_PROPOSAL_CHOSEN msgid=00000000 ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> téléchargez la configuration du VPN\n    du SDDC et vérifiez que le VPN sur site a la même IPsec_configuration\n    de phase 2.\n</p>\n<p>\n    Message de canal : aucun<br> Message de tunnel :\n    <kbd> cannot respond to IPsec SA request because no connection is\n        known for ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> téléchargez la configuration du VPN\n    du SDDC, vérifiez que le VPN sur site est accessible par l'adresse locale affichée\n    sous les adresses de configuration locales et que l'interface utilisateur du VPN du\n    SDDC affiche cette adresse dans le champ <b>Adresse IP de la passerelle distante</b>.\n</p>\n<p>\n    Message de canal :\n    <kbd>initiating Main Mode, STATE_MAIN_I1: initiate, deleting\n        state (STATE_MAIN_I1) ...</kbd>\n    <br>Message de tunnel :\n    <kbd>deleting state (STATE_MAIN_I1), STATE_MAIN_I1: initiate,\n        initiating Main Mode ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> vérifiez que les règles de pare-feu\n    de passerelle de gestion sur site autorisent le trafic ping ICMP sur le VPN\n    du SDDC.\n</p>\n<p>\n    Message de canal :\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., we require peer to have ID '208.91.1.25', but peer declares\n        '10.146.97.30'...</kbd>\n    <br>Message de tunnel :\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., deleting state (STATE_MAIN_R2), deleting state (STATE_QUICK_R2),\n        Main mode peer ID is ID_IPV4_ADDR: '10.146.97.30' ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> la valeur configurée dans l'interface utilisateur\n    du VPN IPsec du SDDC dans le champ <b>Adresse IP publique de la passerelle\n    distante</b> (208.91.1.25 dans cet exemple) ne correspond pas à la valeur fournie par\n    le VPN sur site pour son identité (10.146.97.30 dans cet exemple). Modifiez la valeur\n    du champ <b>Adresse IP publique de la passerelle distante</b> dans l'interface utilisateur\n    du VPN IPsec du SDDC ou mettez à jour le réseau sur site afin qu'il utilise un ID local\n    qui correspond à la valeur d'<b>Adresse IP publique de la passerelle distante</b> dans\n    l'interface utilisateur du VPN IPsec du SDDC.\n\n</p>\n<p>\n    Message de canal :\n    <kbd>received 1 malformed payload notifies, ...</kbd>\n    <br>Message de tunnel :\n    <kbd>sending notification PAYLOAD_MALFORMED to ..., probable\n        authentication failure (mismatch of preshared secrets?)...</kbd>\n    <br> <strong>Correctif suggéré :</strong> vérifiez que la clé prépartagée configurée pour l'extrémité sur site du VPN correspond à la clé prépartagée configurée dans l'interface utilisateur du VPN IPsec du SDDC. </p>\n\n<p>\n    Pour plus d'informations sur la résolution des problèmes de connexion VPN, reportez-vous à la section <a\n    href=\"https://docs.vmware.com/fr/VMware-NSX-for-vSphere/6.4/com.vmware.nsx.troubleshooting.doc/GUID-3E4D0B69-B7E7-4C8B-BC78-A3FB3EE5E8BA.html\">Dépannage\n    des réseaux privés virtuels</a> dans la documentation NSX for vSphere.\n</p>\n",
    "add-custom-service" : "<!--\ntitle: Comment ajouter un service personnalisé ?\ncontext: [networking, inventory]\nfeature: enableNsxtDeployment\n-->\n<P>Lorsque vous créez une règle de pare-feu, vous pouvez spécifier qu'elle s'applique au trafic réseau d'au moins\n   un des services définis dans l'inventaire Services de votre SDDC. La liste par défaut inclut les services VMware,\n   tels que la console distante et le provisionnement, les services standard (IKE, ICMP et TCP, par exemple) et \n   de nombreux services tiers réputés. Vous pouvez ajouter des services à cette liste en sélectionnant des valeurs,\n   généralement des ports et des protocoles, à partir d'une liste de types de services et de propriétés de service supplémentaires.</p>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>Services &gt; AJOUTER UN NOUVEAU SERVICE</strong> et attribuez un nom au nouveau service.\n   </li>\n   <li>Cliquez sur <strong>Définir les entrées du service</strong> pour ouvrir la page correspondante.\n   </li>\n   <li>Sur la page Définir les entrées du service, cliquez sur <strong>AJOUTER UNE NOUVELLE ENTRÉE DE SERVICE</strong>. <br>Pour afficher\n      la liste des services connus, utilisez les commandes déroulantes pour faire défiler les listes\n      <strong>Type de service</strong> et <strong>Propriétés supplémentaires</strong>. Pour ajouter un service, sélectionnez un \n      <strong>type de service</strong> dans le menu déroulant et indiquez des <strong>propriétés supplémentaires</strong>, comme les ports\n      source ou de destination du service, puis cliquez sur <strong>APPLIQUER</strong>.\n   </li>\n   <li>(Facultatif) Indiquez une <strong>description</strong> pour le service et marquez-le.\n   </li>\n   <li>Cliquez sur <strong>ENREGISTRER</strong> pour créer la définition du service.\n   </li>\n</ol>",
    "add-host" : "<!--\ntitle: Comment ajouter des hôtes supplémentaires ?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>\n    <b></b>Vous pouvez ajouter un hôte si votre SDDC contient moins d'hôtes que la valeur maximale autorisée. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_010\"\n        target=\"_blank\"\n    >Ajouter des hôtes</a>.",
    "add-management-group" : "<!--\ntitle: Comment ajouter des groupes de gestion ?\ncontext: [networking, inventory]\nfeature: enableNsxtDeployment\n-->\n<p>Des groupes d'inventaire de gestion prédéfinis sont créés automatiquement pour les composants d'infrastructure\n   de SDDC comme vCenter et NSX Manager. Vous ne pouvez pas modifier un groupe de gestion prédéfini,\n   mais vous pouvez créer des groupes d'inventaire de gestion supplémentaires en spécifiant les blocs CIDR auxquels les membres du groupe sont connectés.</p>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>Inventaire &gt; Groupes</strong>.\n   </li>\n   <li>Sur la page Groupes, cliquez sur <strong>GROUPES DE GESTION</strong>, puis cliquez sur <strong>AJOUTER UN GROUPE</strong>,\n         et attribuez au groupe un <strong>nom</strong> et éventuellement une <strong>description</strong>.\n   </li>\n   <li>Cliquez sur <strong>Définir les membres</strong> pour ouvrir la page <strong>Sélectionner les membres</strong>.\n     Entrez au moins une adresse IP de machines virtuelles de gestion au format CIDR.\n   </li>\n   <li>(Facultatif) Marquez le groupe.</li>\n   <li>Cliquez sur <strong>ENREGISTRER</strong> pour créer le groupe.\n   </li>\n</ol>",
    "add-workload-groups" : "<!--\ntitle: Comment ajouter des groupes de charge de travail ou de calcul ?\ncontext: [networking,inventory]\n-->\n<p>Les groupes d'inventaire de calcul étant constitués de VM de calcul, vous procédez au déploiement sur vos\n   segments de réseau de calcul. VMware Cloud on AWS ne peut pas les créer pour vous. Vous devrez les créer \n   vous-même avant de développer des règles de pare-feu de passerelle de calcul.</p>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>Inventaire &gt; Groupes</strong>.\n   </li>\n   <li>Sur la page Groupes, cliquez sur <strong>GROUPES DE CALCUL</strong>, puis cliquez sur <strong>AJOUTER UN GROUPE</strong>,\n         et attribuez au groupe un <strong>nom</strong> et éventuellement une <strong>description</strong>.\n   </li>\n   <li>Cliquez sur <strong>Définir les membres</strong> pour ouvrir la page <strong>Sélectionner les membres</strong>. Pour plus d'informations sur la manière de désigner une appartenance à un groupe de calcul, reportez-vous à la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_023\" target=\"_blank\"\n   >Ajouter ou modifier un groupe de calcul</a>.\n   </li>\n   <li>(Facultatif) Marquez le groupe.</li>\n   <li>Cliquez sur <strong>ENREGISTRER</strong> pour créer le groupe. \n   </li>\n</ol>",
    "advanced-security" : "<!--\ntitle: Qu'est-ce que le module complémentaire de sécurité avancée NSX ?\ncontext: [networking,addons]\nfeature: uiEnableNsxtAddon\n-->\n<p>\nLa sécurité avancée NSX pour VMware Cloud on AWS permet au SDDC d'accéder aux fonctionnalités de sécurité des applications NSX, notamment aux <a\n        href=\"https://docs.vmware.com/fr/VMware-NSX-T-Data-Center/3.0/administration/GUID-967EA04D-EA5A-4E0C-ACC3-D05B282C7FAF.html\"\n        target=\"_blank\"\n    >profils de contexte</a>.\n</p>\n",
    "ae317d4d23c887da92794b8baed1d765" : "<!--\ntitle: À propos de VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>Copyright © 2017 VMware, Inc. Tous droits réservés. Ce produit est protégé par les lois relatives aux droits d'auteur et à la propriété intellectuelle aux États-Unis et dans d'autres pays, ainsi que par des traités internationaux. Les produits VMware sont couverts par un ou plusieurs brevets dont la liste figure à l'adresse <a href=\"http://www.vmware.com/go/patents-fr\" target=\"_blank\">http://www.vmware.com/go/patents-fr</a>.</p>\n<p>VMware est une marque déposée ou une marque commerciale de VMware, Inc. aux États-Unis et dans d'autres juridictions. Tous les autres noms et marques mentionnés aux présentes peuvent être des marques de leurs sociétés respectives.</p>",
    "attach-private-vif" : "<!--\ntitle: Comment attacher une interface virtuelle privée à mon SDDC de cloud ?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n····Une interface virtuelle privée AWS (VIF) utilise un espace d'adresses IP privé et fournit une connexion privée dédiée\n    au segment principal du réseau AWS, qui se termine dans votre VPC. Connectez-vous à la console\n····AWS pour créer la VIF privée, puis connectez-vous à votre console SDDC pour attacher la VIF.·Consultez·<a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_014\"\n        target=\"_blank\"\n    >Créer une Interface virtuelle privée pour vMotion·et·le·trafic·de·gestion·ESXi</a>.·Notez que votre organisation doit\n····accepter la responsabilité des frais de transfert de données engagés pour cette interface avant de pouvoir commencer à l'utiliser pour connecter \n    un centre de données sur site à votre SDDC.\n</p>\n",
    "available-roles" : "<!--\ntitle: Quels rôles puis-je attribuer à un nouvel utilisateur ?\ncontext: [dashboard, invite]\n-->\n<p>Un propriétaire d'organisation doit attribuer à chaque membre de l'organisation l'un des rôles suivants :</p>\n<ul class=\"list\">\n    <li>Propriétaire de l'organisation : seuls les propriétaires de l'organisation peuvent inviter d'autres utilisateurs à rejoindre l'organisation.</li>\n    <li>Membres de l'organisation : les membres de l'organisation peuvent créer et gérer des centres de données cloud appartenant à l'organisation ou y accéder, mais ils ne peuvent pas inviter de nouveaux utilisateurs.</li>\n</ul>\n<p>\n    Pour plus d'informations, consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_021\"\n        target=\"_blank\"\n    >Attribuer un rôle de service VMC à un membre de l'organisation</a>.\n</p>",
    "bb4bd2b0bac3cadb60ded3460a132c6c" : "<!--\ntitle: Que puis-je faire sur la page Mise en réseau ?\ncontext: [networking]\n-->\n<p>Sur la page de mise en réseau, vous pouvez :</p>\n<ul class=\"list\">\n    <li>Voir un diagramme de topologie montrant l'état des connexions réseau vers et en provenance de votre SDDC.</li>\n    <li>Créer des règles de pare-feu pour les passerelles de gestion et de calcul.</li>\n    <li>Configurer des paramètres VPN pour les connexions VPN IPsec entre votre SDDC et un centre de données sur site.</li>\n    <li>Configurer les paramètres de DNS pour les passerelles de gestion et de calcul.</li>\n    <li>Afficher les réseaux logiques. (Pour configurer les réseaux logiques, utilisez vSphere Client.)</li>\n    <li>Configurer le NAT entrant pour votre passerelle de calcul.</li>\n    <li>Créer des adresses IP publiques pour votre passerelle de calcul.</li>\n    <li>Afficher des informations sur votre VPC Amazon connecté.</li>\n    <li>Attacher des interfaces virtuelles privées AWS Direct Connect à votre SDDC.</li>\n</ul>\n",
    "bb6d9d33a0a0560a5eaa7ba985b8fceb" : "<!--\ntitle: Comment se connecter à mon SDDC à l'aide de PowerCLI ?\ncontext: [connection-info]\n-->\n\n<p>Avant de pouvoir vous connecter à l'aide de PowerCLI, vous devez créer une règle de pare-feu pour autoriser l'accès à vCenter Server. Consultez <a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Définir les règles du pare-feu de la passerelle de gestion</a>.</p>\n<ol class=\"list\">\n    <li>Lancez PowerCLI sur votre machine cliente.</li>\n    <li>Sur la page Informations de connexion dans la console VMC, copiez la commande sous <b>Connexion PowerCLI</b> en cliquant sur le bouton Copier.</li>\n    <li>Collez la commande dans la fenêtre PowerCLI.</li>\n    <li>Remplacez le <tt>&lt;mot de passe&gt;</tt> par celui indiqué sous <b>Authentification</b>. Si le mot de passe contient des caractères spéciaux, placez-le entre guillemets simples (apostrophes).</li>\n</ol>\n",
    "c0ecc7ac8dc10d134d859bd7c95f90e0" : "<!--\ntitle: Comment ajouter des hôtes supplémentaires ?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Vous pouvez ajouter un hôte si votre SDDC contient moins d'hôtes que son nombre maximal. Si vous ne voyez pas l'option <b>Ajouter des hôtes</b> dans le menu <b>Actions</b>, contactez VMware.</p>\n    \n<p>Pour ajouter un hôte :</p>\n<ol class=\"list\">\n    <li>Accédez à l'onglet <b>Résumé</b> pour votre SDDC.</li>\n    <li>Sélectionnez <b>Actions</b> &gt; <b>Ajouter des hôtes</b>.</li>\n    <li>Sélectionnez le nombre d'hôtes à ajouter.</li>\n    <li>Cliquez sur <b>Ajouter des hôtes</b>.</li>\n</ol>\n<p>Le redimensionnement du SDDC peut prendre quelques minutes. Pendant l'ajout des hôtes, vos charges de travail et vCenter Server continuent à fonctionner normalement, mais vous ne pouvez pas démarrer d'autres actions d'ajout ou de suppression d'hôtes.</p>\n",
    "c1dcdcbe735c6e47a057611d5c3ed1f9" : "<!--\ntitle: Comment configurer une connexion VPN L2 à la passerelle de calcul ?\ncontext: [networking,l2vpn]\n-->\n<p>\n\tConfigurer un VPN L2 fait partie de la configuration d'un réseau étendu. Un réseau étendu dispose d'un espace d'adresses IP unique qui s'étend sur vos environnements sur site et SDDC.\tCela simplifie la migration des machines virtuelles de charge de travail vers et depuis votre SDDC de cloud.\n</p>\n<ol class=\"list\">\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-B447CF8B-8A5F-4189-8E12-078E0FD62320.html\">Configurer un serveur\t\t\tVPN L2 dans votre SDDC.</a>\t\tLa passerelle de calcul dans votre SDDC de cloud est utilisée en tant que serveur VPN L2 et fournit le côté SDDC du VPN L2 qui supporte le réseau étendu. Utilisez la console VMC pour\t\tconfigurer le serveur.\t</li>\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-027ECB6F-78D7-4089-8E71-3FEE6F327D72.html\">Configurer et\t\t\t activer votre client VPN L2 sur site.</a>\t\tUne fois le côté SDDC du VPN L2 configuré, le système vous invite à configurer le côté distant (sur site) de la connexion VPN L2. Pour cela, vous pouvez utiliser votre instance de NSX sur\t\tsite existante ou vous pouvez télécharger un dispositif NSX autonome.\t</li>\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-AFC96BF4-DBE4-4AFC-85E3-749C09289758.html\">Créer un réseau\t\t\tétendu dans votre SDDC.</a>\t\tSpécifiez les ID des tunnels que vous avez créés à l'étape 1 et 2. Lorsque le réseau étendu est configuré, vous pouvez activer le tunnel VPN L2.\t</li>\n</ol>\n<p>\n\tPour vérifier que le tunnel VPN L2 est correctement connecté, ouvrez la ligne <b>VPN L2</b> sous <b>Passerelle de calcul</b> et actualisez l'état.\n</p>\n",
    "c4a6fedc7bfcfeb8f152266f21e8d145" : "<!--\ntitle: Comment dois-je configurer le nom de domaine complet de l'instance de vCenter Server ?\ncontext: [networking,dns]\n-->\n<p>Dans le cadre des paramètres DNS de la passerelle de gestion, vous devez configurer comment résoudre le nom de domaine complet de vCenter Server.</p>\n<ul class=\"list\">\n    <li>Si vous accédez à vCenter Server depuis Internet, sélectionnez <b>Adresse IP publique</b>.</li>\n    <li>Si vous avez configuré un VPN et utilisé le VPN pour accéder à vCenter Server, sélectionnez <b>Adresse IP privée</b>.</li>\n</ul>\n",
    "ccbad6ce65d351ae7236e3fd1697c46d" : "<!--\ntitle: Comment gérer les adresses IP publiques ?\ncontext: [networking,public-ip]\n-->\n<p>Vous pouvez demander des adresses IP publiques à attribuer à des VM de charge de travail afin d'autoriser l'accès à ces VM depuis Internet. VMware Cloud on AWS provisionnera l'adresse IP à partir d'AWS. Avant de créer une adresse IP publique, vous devez attribuer à votre VM une adresse IP statique à partir du réseau logique auquel elle est connectée. </p>\n<ol class=\"list\">\n    <li>Dans l'onglet Réseau de votre SDDC, cliquez sur <b>Adresses IP publiques</b> sous <b>Passerelle de calcul</b>.</li>\n    <li>Cliquez sur <b>Demander une adresse IP publique</b>.</li>\n    <li>Entrez des remarques sur cette adresse IP et cliquez sur <b>Enregistrer</b>.</li>\n</ol>\n<p>Pour utiliser cette adresse IP publique, procédez comme suit :</p>\n<ul class=\"list\">\n    <li>Configurez une règle NAT pour connecter l'adresse IP publique à l'adresse IP interne d'une VM.</li>\n    <li>Ajoutez une règle de pare-feu de passerelle de calcul pour autoriser le trafic entre l'adresse IP publique et le réseau logique auquel la VM est attachée.</li>\n</ul>\n",
    "choose-management-ip" : "<!--\ntitle: Comment choisir la plage d'adresses IP du réseau de gestion ?\ncontext: [networking]\n-->\n<p>\n    Vous ne pouvez pas modifier les valeurs spécifiées pour le réseau de gestion après la création du SDDC. Tenez compte de\n    ce qui suit lorsque vous choisissez ces valeurs :\n</p>\n<ul class=\"list\">\n    <li>Choisissez une plage d'adresses IP qui ne chevauche pas le sous-réseau AWS auquel vous vous connectez. Si vous prévoyez de\n        connecter votre SDDC à un centre de données sur site, les adresses IP que vous choisissez pour le réseau de gestion doivent être\n        différentes de celles de votre centre de données sur site afin d'éviter les conflits d'adresses IP.</li>\n    <li>\n        Les blocs CIDR de taille 16, 20 ou 23 sont pris en charge. Pour les blocs CIDR de taille 20 ou 23, le nombre maximal d'hôtes\n        que votre SDDC peut contenir dépend de la taille de bloc CIDR que vous spécifiez et de l'occupation d'une zone de\n        disponibilité (AZ) unique ou de plusieurs zones AZ par le SDDC.\n        <dl class=\"list\">\n            <dt>Bloc CIDR de taille 23</dt>\n            <dd>Jusqu'à 27 hôtes (zone AZ unique). Jusqu'à 22 hôtes (plusieurs zones AZ).</dd>\n            <dt>Taille de bloc CIDR 20 ou 16</dt>\n            <dd>Jusqu'à 160 hôtes, quel que soit le nombre de zones de disponibilité.</dd>\n        </dl>\n    </li>\n</ul>",
    "compute-firewall-rules" : "<!--\ntitle: Comment configurer les règles de pare-feu de la passerelle de calcul ?\ncontext: [networking,firewall]\n-->\n<p>\n    Les règles de pare-feu de passerelle de calcul par défaut bloquent tout le trafic entrant et sortant. Avant de pouvoir utiliser une nouvelle passerelle de\n    calcul, vous devez créer des règles de pare-feu qui autorisent le trafic selon les besoins. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0E66C9C8-C260-4056-8511-44818431110C.html\"\n        target=\"_blank\"\n    >Définir les règles du pare-feu de la passerelle de calcul</a>.\n</p>\n",
    "compute-ipsec-vpn-connection" : "<!--\ntitle: Comment configurer une connexion VPN IPsec à la passerelle de calcul ?\ncontext: [networking,vpn]\n-->\n<p>\n    La passerelle de calcul permet d'accéder à vos VM de charge de travail. Un VPN IPsec assure la connectivité entre la passerelle de\n    calcul et le réseau de calcul dans votre SDDC. Pour créer une connexion VPN IPsec à la passerelle de calcul, suivez les\n    étapes décrites dans <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-93C55532-5734-4B70-8745-C3E779512869.html\"\n        target=\"_blank\"\n    >Créer un VPN de calcul</a>.\n</p>\n",
    "compute-ipsec-vpn-connection-err" : "<!--\ntitle: Comment dépanner les erreurs de connexion VPN IPsec ?\ncontext: [networking,vpn]\n-->\n<p>Après avoir créé une connexion VPN entre la passerelle de calcul de\n    votre SDDC et un réseau de calcul sur site, vous pouvez vérifier que le tunnel VPN est\n    connecté en consultant l'état du VPN sous l'onglet Mise en réseau.\n    La création de VPN peut échouer en raison d'une configuration incorrecte\n    de l'extrémité SDDC ou sur site du réseau. Pour plus d'informations sur\n    l'état du VPN, y compris les messages d'erreur de canal et de tunnel, cliquez sur\n    Détails de l'état du VPN. Cette liste de messages d'erreur du VPN inclut\n    des correctifs suggérés en fonction de la cause principale de l'erreur.</p>\n\n<p>\n    Message de canal :\n    <kbd>Policy does not allow OAKLEY_RSA_SIG authentication...</kbd>\n    <br>Message de tunnel :\n    <kbd> No acceptable Oakley Transform, sending notification...</kbd>\n    <br> <strong>Correctif suggéré :</strong> définissez le mode d'authentification\n    du VPN sur site sur PSK.\n</p>\n<p>\n    Message de canal :\n    <kbd>peer is NATed...</kbd>\n    <br>Message de tunnel :\n    <kbd>peer is NATed...</kbd>\n    <br> <strong>Correctif suggéré :</strong> vérifiez que le pare-feu\n    sur site ouvre le port 4500 pour le trafic UDP entre le VPN sur site\n    et l'adresse IP publique du VPN du SDDC.\n<p>\n    Message de canal :\n    <kbd> sending notification NO_PROPOSAL_CHOSEN ...</kbd>\n    <br>Message de tunnel :\n    <kbd> NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> téléchargez la configuration du VPN\n    du SDDC et vérifiez que le VPN sur site a la même IPsec_configuration\n    de phase 1.\n</p>\n<p>\n    Message de canal : aucun<br> Message de tunnel :\n    <kbd> NO_PROPOSAL_CHOSEN msgid=00000000 ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> téléchargez la configuration du VPN\n    du SDDC et vérifiez que le VPN sur site a la même IPsec_configuration\n    de phase 2.\n</p>\n<p>\n    Message de canal : aucun<br> Message de tunnel :\n    <kbd> cannot respond to IPsec SA request because no connection is\n        known for ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> téléchargez la configuration du VPN\n    du SDDC, vérifiez que le VPN sur site est accessible par l'adresse locale affichée\n    sous les adresses de configuration locales et que l'interface utilisateur du VPN du\n    SDDC affiche cette adresse dans le champ <b>Adresse IP de la passerelle distante</b>.\n</p>\n<p>\n    Message de canal :\n    <kbd>initiating Main Mode, STATE_MAIN_I1: initiate, deleting\n        state (STATE_MAIN_I1) ...</kbd>\n    <br>Message de tunnel :\n    <kbd>deleting state (STATE_MAIN_I1), STATE_MAIN_I1: initiate,\n        initiating Main Mode ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> vérifiez que les règles de pare-feu\n    de passerelle de gestion sur site autorisent le trafic ping ICMP sur le VPN\n    du SDDC.\n</p>\n<p>\n    Message de canal :\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., we require peer to have ID '208.91.1.25', but peer declares\n        '10.146.97.30'...</kbd>\n    <br>Message de tunnel :\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., deleting state (STATE_MAIN_R2), deleting state (STATE_QUICK_R2),\n        Main mode peer ID is ID_IPV4_ADDR: '10.146.97.30' ...</kbd>\n    <br> <strong>Correctif suggéré :</strong> la valeur configurée dans l'interface utilisateur\n    du VPN IPsec du SDDC dans le champ <b>Adresse IP publique de la passerelle\n    distante</b> (208.91.1.25 dans cet exemple) ne correspond pas à la valeur fournie par\n    le VPN sur site pour son identité (10.146.97.30 dans cet exemple). Modifiez la valeur\n    du champ <b>Adresse IP publique de la passerelle distante</b> dans l'interface utilisateur\n    du VPN IPsec du SDDC ou mettez à jour le réseau sur site afin qu'il utilise un ID local\n    qui correspond à la valeur d'<b>Adresse IP publique de la passerelle distante</b> dans\n    l'interface utilisateur du VPN IPsec du SDDC.\n\n</p>\n<p>\n    Message de canal :\n    <kbd>received 1 malformed payload notifies, ...</kbd>\n    <br>Message de tunnel :\n    <kbd>sending notification PAYLOAD_MALFORMED to ..., probable\n        authentication failure (mismatch of preshared secrets?)...</kbd>\n    <br> <strong>Correctif suggéré :</strong> vérifiez que la clé prépartagée configurée pour l'extrémité sur site du VPN correspond à la clé prépartagée configurée dans l'interface utilisateur du VPN IPsec du SDDC. </p>\n\n<p>\n    Pour plus d'informations sur la résolution des problèmes de connexion VPN, reportez-vous à la section <a\n    href=\"https://docs.vmware.com/fr/VMware-NSX-for-vSphere/6.4/com.vmware.nsx.troubleshooting.doc/GUID-3E4D0B69-B7E7-4C8B-BC78-A3FB3EE5E8BA.html\">Dépannage\n    des réseaux privés virtuels</a> dans la documentation NSX for vSphere.\n</p>\n",
    "compute-l2-vpn-connection" : "<!--\ntitle: Comment configurer une connexion VPN L2 à la passerelle de calcul ?\ncontext: [networking,l2vpn]\n-->\n<p>\n    La passerelle de calcul utilise un VPN L2 pour fournir un accès aux VM de charge de travail en cours d'exécution dans votre SDDC. La configuration d'un VPN L2 fait partie de celle d'un réseau étendu. Un réseau étendu dispose d'un espace d'adresses IP unique qui s'étend sur vos environnements sur site et SDDC. Cela simplifie la migration des VM de charge de travail vers et depuis votre SDDC de cloud. Pour créer un VPN L2 dans un SDDC avec mise en réseau supportée par VMware NSX for vSphere, procédez comme suit :\n<ol class=\"list\">\n    <li>\n        <a\n            href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-B447CF8B-8A5F-4189-8E12-078E0FD62320.html\"\n            target=\"_blank\"\n        >Configurez le serveur VPN L2 dans votre SDDC.</a> La passerelle de calcul de votre SDDC de cloud est utilisée en tant que serveur VPN L2 et fournit le côté SDDC du VPN L2 qui supporte le réseau étendu. Utilisez la console VMC pour configurer le serveur.\n    </li>\n    <li>\n        <a\n            href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-027ECB6F-78D7-4089-8E71-3FEE6F327D72.html\"\n            target=\"_blank\"\n        >Configurez et activez votre client VPN L2 sur site.</a> Une fois le côté SDDC du VPN L2 configuré, le système vous invite à\n        configurer le côté distant (NSX sur site) du VPN L2. Pour cela, vous pouvez utiliser votre instance de NSX\n        sur site existante ou télécharger un dispositif NSX autonome.\n    </li>\n    <li>\n        <a\n            href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-AFC96BF4-DBE4-4AFC-85E3-749C09289758.html\"\n            target=\"_blank\"\n        >Créez un réseau étendu dans votre SDDC.</a> Spécifiez les ID des tunnels que vous avez créés aux étapes 1 et 2.\n        Lorsque le réseau étendu est configuré, vous pouvez activer le tunnel VPN L2. Pour vérifier que le tunnel\n        VPN L2 est correctement connecté, ouvrez la ligne <b>VPN L2</b> sous <b>Passerelle de calcul</b> et actualisez\n        l'état.\n    </li>\n</ol>\n</p>\n",
    "configure-IPFIX" : "<!--\ntitle: Comment configurer le collecteur et la session IPFIX ?\ncontext: [networking, tools, toolsipfix]\nfeature: enableNsxtDeployment\n-->\n<p>IPFIX (Internet Protocol Flow Information Export) est une norme pour le format et l'exportation\n   des informations de flux de réseau pour le dépannage, l'audit ou la collecte d'informations d'analyse. \n   Vous pouvez configurer la surveillance d'un flux sur un segment logique. Tous les flux des VM connectées à ce\n   segment logique sont capturés et envoyés au collecteur IPFIX. Le collecteur IPFIX peut se trouver dans le\n   centre de données sur site de l'un des segments logiques.</p>\n<p>\n   <strong>Conditions préalables</strong>\n</p>\n<p>\n   Vérifiez qu'un segment logique est configuré. Reportez-vous à la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-267DEADB-BD01-46B7-82D5-B9AA210CA9EE.html\"\n   >Créer ou modifier un segment de réseau</a>.\n</p>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>IPFIX &gt; COLLECTEURS &gt; AJOUTER UN NOUVEAU COLLECTEUR</strong> et attribuez un <strong>nom</strong> au collecteur.\n   </li>\n   <li>Entrez l'adresse IP et le port du collecteur. <br>Le port UDP par défaut est 4739. Vous pouvez\n      ajouter jusqu'à quatre collecteurs IPFIX.\n   </li>\n   <li>Cliquez sur <strong>ENREGISTRER</strong>.\n   </li>\n   <li>Cliquez sur <strong>PROFILS IPFIX DE COMMUTATEUR</strong> pour créer ou modifier un profil IPFIX de commutateur. <br>\n      Reportez-vous à la section <a\n      href=\"https://docs.vmware.com/fr/VMware-NSX-T-Data-Center/2.5/administration/GUID-3458F2B3-089E-4BFC-8348-705172F2B802.html\"\n   >Configurer les profils IPFIX de commutateur</a> pour plus d'informations sur les paramètres de profil IPFIX du commutateur NSX-T.\n   </li>\n   <li>(Facultatif) Marquez le profil.</li>\n   <li>Cliquez sur <strong>ENREGISTRER</strong> pour créer le profil.\n   </li>\n</ol>",
    "configure-nat" : "<!--\ntitle: Comment créer ou modifier des règles NAT ?\ncontext: [networking, nat, nat_nsx]\nfeature: enableNsxtDeployment\n-->\n<p>La traduction d'adresse réseau (Network Address Translation, NAT) mappe des adresses IP internes sur votre réseau de calcul à des adresses exposées sur l'Internet public. Pour créer une règle NAT, vous fournissez l'adresse interne et le numéro de port d'une machine virtuelle de charge de travail ou d'un service, et une adresse IP publique et un numéro de port que vous avez obtenus du système.</p>\n<p>Les règles NAT doivent s'exécuter sur l'interface Internet du SDDC, car c'est là que les adresses publiques des machines virtuelles de charge de travail sont exposées. Les règles de pare-feu, qui examinent les sources et les destinations de paquets, s'exécutent sur la passerelle de calcul et traitent le trafic une fois qu'il a été transformé par une règle NAT applicable. Lorsque vous créez une règle NAT, vous pouvez spécifier si l'adresse IP interne ou externe d'une machine virtuelle et son numéro de port sont soumis à des règles de pare-feu qui affectent le trafic réseau vers cette machine virtuelle et à partir de cette dernière.</p>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>NAT &gt; AJOUTER UNE RÈGLE NAT</strong> et attribuez un <strong>nom</strong> à la règle.\n   </li>\n   <li>Entrez les paramètres de règle NAT. <br>Reportez-vous à la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_024\" target=\"_blank\"\n   >Créer ou modifier des règles NAT</a> pour plus d'informations sur les paramètres et le fonctionnement de la règle NAT.\n   </li>\n   <li>(Facultatif) Cliquez sur le bouton bascule <strong>Journalisation</strong> pour enregistrer les actions de la règle.\n   </li>\n   <li>La nouvelle règle est activée par défaut. Cliquez sur le bouton bascule <strong>Activer</strong> pour le désactiver.\n   </li>\n   <li>Cliquez sur <strong>ENREGISTRER</strong> pour créer la règle.\n   </li>\n</ol>",
    "configure-portmirroring" : "<!--\ntitle: Comment configurer une session de mise en miroir de ports ?\ncontext: [networking, tools, toolsportmirroring]\nfeature: enableNsxtDeployment\n-->\n<p>La mise en miroir de ports vous permet de répliquer et de rediriger tout le trafic provenant d'une source. Le trafic mis en miroir est envoyé encapsulé dans un tunnel GRE (Generic Routing Encapsulation) à un collecteur, de sorte que toutes les informations sur le paquet d'origine sont conservées lors de la traversée du réseau vers une destination distante.</p>\n<p>La mise en miroir de port est utilisée dans les scénarios suivants :</p>\n<ul>\n   <li>Dépannage : analyser le trafic pour détecter les intrusions, et pour déboguer et diagnostiquer les erreurs sur un réseau.</li>\n   <li>Conformité et surveillance : transférer tout le trafic surveillé à un dispositif réseau pour analyse et correction.</li>\n</ul>\n<p>La mise en miroir de ports comporte un groupe source dans lequel les données sont surveillées et un groupe de destination dans lequel les données collectées sont copiées. Les critères d'appartenance au groupe source nécessitent que les machines virtuelles soient regroupées en fonction de la charge de travail (groupe Web ou groupe d'applications, par exemple). Les critères d'appartenance au groupe de destination nécessitent le regroupement des machines virtuelles en fonction des adresses IP.</p>\n<P>La mise en miroir de ports dispose d'un point d'application, où vous pouvez appliquer des règles de stratégie à votre environnement SDDC.</p>\n<P>\n   <strong>Conditions préalables</strong>\n</p>\n<p>Vérifiez que des groupes de charge de travail avec adresse IP et critères d'appartenance de machines virtuelles sont disponibles.\n</li>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>Mise en miroir de ports &gt; AJOUTER UN PROFIL</strong>, et attribuez un <strong>nom</strong> et éventuellement une <strong>description</strong> à ce profil.\n   </li>\n   <li>Spécifiez les paramètres de profil. <br>Reportez-vous à la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_028\" target=\"_blank\"\n   >Configurer la mise en miroir de ports</a> pour plus d'informations sur les paramètres de mise en miroir de ports.\n   </li>\n   <li>Cliquez sur <strong>ENREGISTRER</strong> pour créer la session.\n   </li>\n   <li>(Facultatif) Cliquez sur le bouton de sélection en regard d'un session de mise en miroir de ports et sélectionnez <strong>Modifier</strong> pour apporter des modifications à la configuration.\n   </li>\n</ol>",
    "configure-vcenter-fqdn" : "<!--\ntitle: Comment dois-je configurer le nom de domaine complet de l'instance de vCenter Server ?\ncontext: [networking,dns]\n-->\n<p>\nVous pouvez vous connecter au SDDC vCenter Server à une adresse IP publique ou privée. \n    Une adresse IP privée peut être résolue à partir d'un VPN SDDC. Une adresse IP publique peut être \n    résolue à partir d'Internet.\n</p>\n<p>Pour plus d'informations, \n    consultez <a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_015\">Définir l'adresse de résolution de nom de domaine complet vCenter Server</a>.</p>\n",
    "connect-powercli" : "<!--\ntitle: Comment se connecter à mon SDDC à l'aide de PowerCLI ?\ncontext: [connection-info]\n-->\n<p>\n    Avant de pouvoir vous connecter à l'aide de PowerCLI, vous devez créer une règle de pare-feu pour autoriser l'accès à vCenter Server. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_013\"\n        target=\"_blank\"\n    >Ajoutez ou modifiez les règles du pare-feu de la passerelle de gestion</a>.\n</p>\n<ol class=\"list\">\n    <li>Lancez PowerCLI sur votre machine cliente.</li>\n    <li>\n        Dans l'onglet <strong>Paramètres</strong> de la Console VMC, copiez la commande sous <strong>Connexion PowerCLI\n            </strong> en cliquant sur le bouton Copier.\n    </li>\n    <li>Collez la commande dans la fenêtre PowerCLI.</li>\n    <li>\n        Remplacez le <tt>&lt;mot de passe&gt;</tt> par celui indiqué sous <strong>Compte d'utilisateur vCenter par \n            défaut</strong>. Si le mot de passe contient des caractères spéciaux, placez-le entre guillemets simples (apostrophes).\n    </li>\n</ol>\n",
    "connect-vsphere-client" : "<!--\ntitle: Comment accéder à vSphere Client ?\ncontext: [connection-info]\n-->\n<p>\n    Avant de pouvoir accéder à vSphere Client, vous devez configurer une connexion VPN ou une règle de pare-feu pour autoriser l'accès à\n    vCenter Server. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_013\"\n        target=\"_blank\"\n    >Ajouter ou modifier des règles de pare-feu de passerelle de gestion</a>.\n</p>\n<p>\nSur la carte des détails du SDDC, cliquez sur <strong>OUVRIR VCENTER</strong> et utilisez les informations d'identification vCenter par défaut pour vous connecter.\n    Pour voir ces informations d'identification, cliquez sur <strong>AFFICHER LES INFORMATIONS D'IDENTIFICATION</strong> dans la boîte de dialogue <strong>OUVRIR VCENTER </strong>. Vous pouvez\n    également les trouver sous <strong>Compte d'utilisateur vCenter par défaut</strong> dans l'onglet <strong>Paramètres</strong> du SDDC.\n</p>\n",
    "cpu-running-out" : "<!--\ntitle: Je vais manquer de capacité de CPU. Que puis-je faire ?\ncontext: [summary]\n-->\n<p>\n    Si vous avez la possibilité d'ajouter des hôtes et si votre SDDC n'a pas atteint son nombre maximal d'hôtes, vous pouvez ajouter\n    un hôte pour augmenter la capacité de CPU disponible. Sinon, arrêtez les charges de travail ou migrez-les hors de votre SDDC.\n</p>",
    "create-distributed-firewall-rule" : "<!--\ntitle: Comment définir des règles de pare-feu distribué ?\ncontext: [networking, distributedfirewall]\nfeature: enableNsxtDeployment\n-->\n<p>\n   Les règles de pare-feu distribué s'appliquent au niveau de la machine virtuelle et contrôlent le trafic est-ouest dans le SDDC. Tout le trafic tentant de passer par le pare-feu distribué est soumis aux règles dans l'ordre indiqué dans le tableau de règles, en commençant par le haut. Un paquet autorisé par la première règle est transmis à la deuxième règle, etc., jusqu'à ce que le paquet soit annulé ou rejeté, ou qu'il atteigne la règle par défaut, qui autorise tout le trafic. Les règles de pare-feu distribué sont regroupées en stratégies. Les stratégies sont organisées par catégorie. Les catégories regroupent simplement des avantages et ne disposent d'aucune propriété opérationnelle. Consultez la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_017\" target=\"_blank\"\n   >Ajouter ou modifier des règles de pare-feu distribué</a> pour plus d'informations sur les catégories de règles de pare-feu distribué.\n</p>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>Mise en réseau et sécurité &gt; Pare-feu distribué</strong>. <br>Cliquez sur <strong>RÈGLES SPÉCIFIQUES À LA CATÉGORIE</strong> et sélectionnez une catégorie pour afficher et modifier les stratégies et les règles de cette catégorie, ou cliquez sur <strong>TOUTES LES RÈGLES</strong> pour afficher (mais pas modifier) les règles de toutes les stratégies et catégories.\n   </li>\n   <li>(Facultatif) Modifiez la stratégie de connectivité par défaut. <br>Par défaut, le pare-feu distribué\n comporte une règle d'autorisation implicite pour tout le trafic. Cette règle, qui ne figure pas dans une liste de règles, est évaluée après toutes les autres règles et autorise le trafic qui ne correspond pas à la règle précédente à passer par le pare-feu. Cliquez sur l'icône de stratégie de connectivité pour afficher la liste des stratégies disponibles. Pour modifier la stratégie actuelle, sélectionnez-en une autre et cliquez sur <strong>ENREGISTRER</strong>.\n   </li>\n   <li>Pour ajouter une stratégie en haut de la liste, cliquez sur <strong>AJOUTER UNE STRATÉGIE</strong> et donnez un <strong>nom</strong> à la nouvelle stratégie. <br>Pour ajouter une stratégie avant ou après une stratégie existante, cliquez sur le bouton de sélection vertical au début de la ligne de la stratégie pour ouvrir le menu des paramètres de la stratégie, puis cliquez sur <strong>Ajouter une stratégie au-dessus</strong> ou <strong>Ajouter une stratégie en-dessous</strong>. Par défaut, une nouvelle stratégie s'applique au pare-feu distribué, mais vous pouvez spécifier un ou plusieurs groupes d'inventaire alternatifs auxquels l'appliquer. La valeur <strong>APPLIQUÉ À</strong> de la stratégie est propagée à toutes les règles de la stratégie.\n   </li>\n   <li>Pour ajouter une règle, sélectionnez une stratégie, cliquez sur <strong>AJOUTER UNE NOUVELLE RÈGLE</strong> et attribuez un <strong>nom</strong> à la règle.\n   </li>\n   <li>Entrez les paramètres de la nouvelle règle. <br>Les paramètres sont initialisés à leurs valeurs par défaut (par exemple, <strong>Tout</strong> pour <strong>Sources</strong> et <strong>Destinations </strong>). Pour modifier un paramètre, déplacez le curseur de la souris sur la valeur du paramètre et cliquez sur l'icône en forme de crayon pour ouvrir un éditeur spécifique au paramètre. Pour plus d'informations sur les paramètres de la règle de pare-feu de la passerelle de calcul, consultez la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_017\" target=\"_blank\"\n   >Ajouter ou modifier des règles de pare-feu pour la passerelle de calcul</a>.\n   </li>\n   <li>Cliquez sur PUBLIER pour créer la règle.</li> \n</ol>",
    "create-edge-compute-firewall" : "<!--\ntitle: Comment créer une règle de pare-feu pour la passerelle de calcul NSX Edge ?\ncontext: [networking, security]\nfeature: enableNsxtDeployment\n-->\n<p>Par défaut, la passerelle de calcul bloque le trafic vers toutes les liaisons montantes. Ajoutez des règles \n   de pare-feu pour la passerelle de calcul pour autoriser le trafic si nécessaire.</p>\n<p>\n   Les règles de pare-feu de la passerelle de calcul spécifient les mesures à prendre sur le trafic réseau\n   d'une source donnée à une destination donnée. Ces mesures peuvent consister à autoriser (autoriser le trafic) ou\n   annuler (annuler tous les paquets correspondant à la source et à la destination spécifiées). Les sources\n   et les destinations peuvent être choisies dans une liste d'interfaces réseau physiques ou une spécification générique\n   de <strong>toutes les liaisons montantes</strong> qui fait référence à tout le trafic quittant la passerelle \n   en direction de l'interface VPC, de l'interface Internet ou de l'interface Direct Connect. Une règle de pare-feu\n   appliquée à <strong>toutes les liaisons montantes</strong> ne s'applique pas à l'<strong>interface\n   d'un tunnel VPN</strong>, qui est une interface virtuelle et non une liaison montante physique.\n   L'<strong>interface du tunnel VPN</strong> (VPN Tunnel Interface, VTI) doit être spécifiée explicitement dans le\n   paramètre <strong>Appliqué à</strong> de toute règle de pare-feu qui gère les communications des \n   VM de charge de travail sur un VPN basé sur les routes. La passerelle de calcul inclut une <strong>règle de VTI par défaut</strong>\n   qui annule tout le trafic vers la VTI. Pour autoriser les VM de charge de travail à communiquer sur la VTI,\n   modifiez cette règle ou déplacez-la vers un rang inférieur dans la hiérarchie des règles, après des règles plus permissives.\n</p>\n<p>L'ensemble du trafic tentant de passer à travers le pare-feu est soumis aux règles dans l'ordre indiqué\n   dans le tableau des règles, en commençant par le haut. Un paquet autorisé par la première règle est transmis\n   à la deuxième règle, etc. par le biais des règles suivantes, jusqu'à ce que le paquet soit annulé ou rejeté,\n   ou qu'il atteigne la règle par défaut, qui autorise l'ensemble du trafic.</p>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>Pare-feu de la passerelle</strong> pour ouvrir la page <strong>PARE-FEU DE LA PASSERELLE</strong>.\n   </li>\n   <li>Sur la page <strong>PARE-FEU DE PASSERELLE</strong>, cliquez sur <strong>Passerelle de calcul</strong>.\n   </li>\n   <li>Pour ajouter une règle, cliquez sur <strong>AJOUTER UNE RÈGLE</strong> et attribuez un <strong>nom</strong> à la nouvelle règle.\n   </li>\n   <li>Entrez les paramètres de la nouvelle règle. <br>Les paramètres sont initialisés à leurs valeurs\n      par défaut (par exemple, <strong>Tout</strong> pour <strong>Sources</strong> et <strong>Destinations </strong>). Pour \n      modifier un paramètre, déplacez le curseur de la souris sur la valeur du paramètre et cliquez sur l'icône en forme de crayon\n      pour ouvrir un éditeur spécifique au paramètre. Pour plus d'informations sur les paramètres de la règle de pare-feu de la passerelle de calcul, consultez la section \n      <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_020\" target=\"_blank\"\n   >Ajouter ou modifier des règles de pare-feu pour la passerelle de calcul</a>.\n   </li>\n   <li>Cliquez sur <strong>PUBLIER</strong> pour créer la règle.\n   </li>\n</ol>\n<p>\n   Reportez-vous à la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_020\" target=\"_blank\"\n   >Ajouter ou modifier des règles de pare-feu pour la passerelle de calcul</a> pour plus d'informations \n   sur la modification des paramètres de journalisation des règles et l'affichage des statistiques de règles.\n</p>",
    "create-edge-management-firewall" : "<!--\ntitle: Comment créer des règles de pare-feu pour la passerelle de gestion NSX Edge ?\ncontext: [networking, security]\nfeature: enableNsxtDeployment\n-->\n<p>Par défaut, la passerelle de gestion bloque le trafic vers toutes les destinations à partir de toutes les sources.\n   Ajoutez des règles de pare-feu pour la passerelle de gestion pour autoriser le trafic si nécessaire.</p>\n<ol class=\"list\">\n   <li>Cliquez sur <strong>Pare-feu de passerelle</strong> pour ouvrir la page <strong>PARE-FEU DE PASSERELLE</strong>.\n   </li>\n   <li>Sur la page <strong>PARE-FEU DE PASSERELLE</strong>, cliquez sur <strong>Passerelle de gestion</strong>.\n   </li>\n   <li>Pour ajouter une règle, cliquez sur <strong>AJOUTER UNE RÈGLE</strong> et attribuez un <strong>nom</strong> à la nouvelle règle.\n   </li>\n   <li>Entrez les paramètres de la nouvelle règle. <br>Les paramètres sont initialisés à leurs valeurs par défaut\n      (par exemple, <strong>Tout</strong> pour <strong>Sources</strong> et <strong>Destinations </strong>). Pour\n      modifier un paramètre, déplacez le curseur de la souris sur la valeur du paramètre et cliquez sur l'icône en forme\n      de crayon pour ouvrir un éditeur spécifique au paramètre. Pour plus d'informations sur les paramètres de la règle de pare-feu de la passerelle de calcul,\n      consultez la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_013\" target=\"_blank\"\n   >Ajouter ou modifier des règles de pare-feu pour la passerelle de calcul</a>.\n   </li>\n   <li>Cliquez sur <strong>PUBLIER</strong> pour créer la règle. <br>Les règles de pare-feu sont      appliquées de haut en bas. L'ordre des règles de pare-feu de la passerelle de gestion n'a aucune incidence sur le flux de trafic, car une règle d'annulation par défaut figure en bas de la liste et les règles situées au-dessus sont toujours des règles d'autorisation.\n   </li>\n</ol>\n<p>\n   Pour obtenir un exemple et plus d'informations sur la modification des paramètres de journalisation des règles et \n   l'affichage des statistiques de règle, consultez <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_013\" target=\"_blank\"\n   >Ajouter ou modifier des règles de pare-feu pour la passerelle de gestion</a>.\n</p>",
    "create-l2vpn" : "<!--\ntitle: Comment puis-je créer un VPN de couche 2 ?\ncontext: [networking, vpn, layer2]\nfeature: enableNsxtDeployment\n-->\n<p>Un réseau étendu VMware Cloud on AWS utilise un réseau privé virtuel de couche 2 (L2VPN) pour étendre un réseau sur site vers plusieurs réseaux basés sur VLAN pouvant être étendus avec différents ID de tunnel sur le même tunnel L2VPN. Ce réseau étendu est un sous-réseau unique avec un seul domaine de diffusion. Vous pouvez donc migrer les machines virtuelles vers votre SDDC de cloud et à partir de celui-ci sans avoir à modifier leurs adresses IP.</p>\n<ol class=\"list\">\n   <li>\n      Cliquez sur <strong>VPN &gt; Couche 2</strong>.\n   </li>\n   <li>\n      Cliquez sur <strong>AJOUTER UN TUNNEL VPN</strong>.\n   </li>\n   <li>\n      Configurez les paramètres de tunnel VPN.\n      <br>\n      Reportez-vous à la section <a\n         href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_027\" target=\"_blank\"\n      >Configurer un tunnel VPN de couche 2 dans le SDDC</a> pour plus d'informations sur les paramètres de tunnel.\n   </li>\n   <li>(Facultatif) Marquez le tunnel.</li>\n   <li>\n      Cliquez sur <strong>ENREGISTRER</strong> pour créer le tunnel.\n      <br>\n      La création d'un tunnel peut prendre quelques minutes. Lorsque le tunnel devient disponible, son état indique Actif.\n   </li>\n</ol>\n<p>\n   Une fois le tunnel actif, vous devez créer un segment de réseau lié à l'ID de tunnel du nouveau tunnel.\n   Reportez-vous à la section <a\n      href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_006\" target=\"_blank\"\n   >Configurer un segment étendu du VPN de couche 2</a> pour plus d'informations sur la création du segment et la configuration du côté sur site du VPN.\n</p>",
    "create-logical-segment" : "<!--\ntitle: Comment créer un segment de réseau logique ?\ncontext: [networking, network, segment]\nfeature: enableNsxtDeployment\n-->\n<p>VMware Cloud on AWS prend en charge trois types de segments de réseau logiques :</p>\n<li>Un segment de réseau routé (type par défaut) dispose d'une connectivité à d'autres réseaux logiques\n   dans le SDDC et, via le pare-feu SDDC, à des réseaux externes. Une configuration de démarrage d'un SDDC \n  à hôte unique est créée avec un seul segment de réseau routé nommé sddc-cgw-network-1.</li>\n<li>Un segment de réseau étendu étend un tunnel L2VPN existant, en fournissant un espace d'adresse IP unique qui couvre le SDDC et un réseau sur site.</li>\n<li>Un segment de réseau déconnecté n'a pas de liaison montante et fournit un réseau isolé accessible uniquement aux machines virtuelles qui y sont connectées.</li>\n<ol class=\"list\">\n   <li>\n      Pour créer un segment, cliquez sur <strong>Segments &gt; AJOUTER UN SEGMENT</strong> et attribuez un <strong>nom</strong> au nouveau segment.\n      <br>\n      Pour modifier la configuration d'un segment existant, cliquez sur le bouton de sélection et sélectionnez <strong>Modifier</strong>.\n   </li>\n   <li>\n      Spécifiez un <strong>type</strong> de segment et indiquez les paramètres de configuration requis.\n      <br>\n      La configuration requise dépend du type de segment. Pour plus d'informations sur les paramètres de configuration de segment, reportez-vous à la section <a\n         href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_001\" target=\"_blank\"\n      >Créer ou modifier un segment de réseau</a>.\n   <li>\n      Cliquez sur <strong>ENREGISTRER</strong> pour créer ou mettre à jour le segment.\n      <br>\n      Cette opération peut prendre jusqu'à 15 secondes. Lorsque le segment <strong>État</strong> indique <strong>Actif</strong>,\n      il est prêt à être utilisé. Si le segment <strong>État</strong> indique <strong>Inactif</strong>, vous pouvez \n      cliquer sur l'icône d'information pour afficher les détails de l'état.\n   </li> \n</ol>",
    "create-policy-based-vpn" : "<!--\ntitle: Comment créer un VPN basé sur des stratégies ?\ncontext: [networking, vpn, policy-based]\nfeature: enableNsxtDeployment\n-->\n<p>Un VPN basé sur des stratégies crée un tunnel IPsec et une stratégie qui spécifie comment le trafic l'utilise.\n   Lorsque vous utilisez un VPN basé sur des stratégies, vous devez mettre à jour les tables de routage sur\n   les deux extrémités du réseau lorsque de nouvelles routes sont ajoutées.</p>\n<p>Les VPN basés sur des stratégies de votre SDDC VMware Cloud on AWS utilisent un protocole IPSec pour \n   sécuriser le trafic. Pour créer un·VPN basé sur les stratégies, vous configurez le point de terminaison local\n   (SDDC), puis vous configurez un point de terminaison distant (sur site) correspondant. Étant donné que chaque VPN\n   basé sur des stratégies doit créer une association de sécurité IPsec pour chaque réseau, un administrateur doit mettre\n   à jour les informations de routage sur site et dans le SDDC chaque fois qu'un nouveau VPN basé sur des stratégies \n   est créé. Un VPN basé sur des stratégies peut être un choix judicieux lorsque vous ne disposez que d'un petit\n   nombre de réseaux sur l'une des extrémités du VPN, ou si votre matériel réseau sur site ne prend pas en charge le BGP (qui est requis pour les VPN basé sur les routes).</p>\n<ol class=\"list\">\n   <li>\n      Cliquez sur <strong>VPN &gt; Basé sur des stratégies</strong>.\n   </li>\n   <li>Cliquez sur AJOUTER UN VPN et donnez un nom au nouveau VPN.</li>\n   <li>\n      Sélectionnez une <strong>adresse IP locale</strong> dans le menu déroulant.\n      <br>\n      Si vous avez configuré AWS Direct Connect pour ce SDDC et que vous souhaitez que le VPN l'utilise, sélectionnez l'adresse IP privée. Notez que le trafic VPN sur Direct Connect est limité à la MTU par défaut de 1 500 octets, même si le lien prend en charge une MTU supérieure. Indiquez une adresse IP publique si vous souhaitez que le VPN se connecte via Internet.\n   </li>\n   <li>\nPour <strong>Adresse IP publique distante</strong>, entrez l'adresse de votre point de terminaison VPN sur site.\n      <br>\n      Reportez-vous à la section <a\n         href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_029\" target=\"_blank\"\n      >Créer un VPN basé sur des stratégies</a> pour les contraintes importantes sur les valeurs d'adresses IP locales et distantes.\n   </li>\n   <li>\n      (Facultatif) Si votre passerelle sur site se trouve derrière un périphérique NAT, entrez l'adresse de la passerelle comme <strong>Adresse IP privée distante</strong>.\n      <br>\n      Cette adresse IP doit correspondre à l'identité locale (ID IKE) envoyée par la passerelle VPN sur site. Si ce champ est vide, le champ <strong>Adresse IP publique distante</strong> est utilisé pour correspondre à l'identité locale de la passerelle VPN sur site.\n   </li>\n   <li>\n      Spécifiez les <strong>réseaux distants</strong> auxquels ce VPN peut se connecter.\n      <br>\n      Cette liste doit inclure tous les réseaux définis comme locaux par la passerelle VPN sur site. Entrez chaque réseau au format CIDR. Séparez les blocs CIDR multiples par des virgules.\n   </li>\n   <li>\n      Spécifiez les <strong>réseaux locaux</strong> auxquels ce VPN peut se connecter.\n      <br>\n      Cette liste comporte tous les réseaux de calcul routés dans le SDDC, ainsi que l'ensemble du réseau de gestion et le sous-réseau du dispositif (un sous-ensemble du réseau de gestion incluant vCenter et d'autres dispositifs de gestion, mais pas les hôtes ESXi). Elle contient également le réseau DNS CGW, une adresse IP unique utilisée pour approvisionner les demandes transmises par le service DNS CGW.\n   </li>\n   <li>\n      Configurez <strong>Paramètres de tunnel avancés</strong>.\n      <br>\n      Reportez-vous à la section <a\n         href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_029\" target=\"_blank\"\n      >Créer un VPN basé sur des stratégies</a> pour découvrir les valeurs de paramètre suggérées.\n   </li>\n   <li>(Facultatif) Marquez le VPN.</li>\n   <li>\n      Cliquez sur <strong>ENREGISTRER</strong>.\n   </li>\n</ol>\n<p>Le processus de création de VPN peut prendre quelques minutes. Lorsque le VPN basé sur des stratégies devient disponible, l'état du tunnel et l'état de la session BGP sont affichés. Les actions suivantes sont disponibles pour vous aider dans le cadre du dépannage et de la configuration de l'extrémité sur site du VPN :</p>\n<ul>\n   <li>\n      Cliquez sur <strong>TÉLÉCHARGER LA CONFIGURATION</strong> pour télécharger un fichier contenant les détails de la configuration du VPN. Vous pouvez utiliser ces détails pour configurer l'extrémité sur site de ce VPN.\n   </li>\n   <li>\n      Cliquez sur <strong>AFFICHER LES STATISTIQUES</strong> pour afficher les statistiques du trafic de paquets pour ce VPN. Reportez-vous à <a\n         href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_026\" target=\"_blank\"\n      >Afficher l'état et les statistiques du tunnel VPN</a>.\n   </li>\n</ul>",
    "create-public-vif" : "<!--\ntitle: Comment créer une interface virtuelle publique ?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\nUne interface virtuelle publique (VIF) permet à votre SDDC d'accéder à des services AWS externes à votre VPC, tels que S3,\n    sur AWS Direct Connect. Un VIF public utilise un espace d'adresses IP public et fournit une connexion dédiée privée au\n    segment principal du réseau AWS, se terminant dans une région AWS spécifique. Pour créer une interface virtuelle publique dans un SDDC, consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_016\"\n        target=\"_blank\"\n    >Créer une interface virtuelle publique pour accéder aux services AWS</a>.\n</p>\n",
    "create-route-based-vpn" : "<!--\ntitle: Comment créer un VPN basé sur les routes ?\ncontext: [networking, vpn, route-based]\nfeature: enableNsxtDeployment\n-->\n<p>Un VPN basé sur les routes crée une interface de tunnel IPSec et achemine le trafic à travers celui-ci\n   conformément aux instructions de la table de routage SDDC. VMware Cloud on AWS utilise la même adresse IP publique\n   pour toutes les connexions VPN. Une seule connexion VPN (basé sur les routes, sur les stratégies ou L2VPN) peut être créée\n   pour une adresse IP publique distante donnée. Les VPN basés sur les routes de votre SDDC VMware Cloud on AWS\n   utilisent un protocole IPSec pour sécuriser le trafic et le protocole BGP pour découvrir et propager des routes\n   au fur et à mesure que de nouveaux réseaux sont créés. Pour créer un VPN basé sur les routes, configurez\n   les informations BGP pour les points de terminaison locaux (SDDC) et distants (sur site), puis indiquez les paramètres\n   de sécurité du tunnel pour l'extrémité SDDC du tunnel.</p>\n<ol class=\"list\">\n   <li>\n      Cliquez sur <strong>VPN &gt; Basé sur les routes</strong>.\n   </li>\n   <li>\n      (Facultatif) Modifiez le numéro de système autonome (ASN) local par défaut.\n      <br>\n      Tous les VPN basés sur les routes dans le SDDC sont par défaut sur l'ASN 65000. Si l'ASN distant\n      pour toutes les connexions VPN configurées a également cette valeur, cliquez sur <strong>MODIFIER L'ASN LOCAL</strong>,\n      entrez une nouvelle valeur dans la plage comprise entre 64521 et 65535, et cliquez sur <strong>APPLIQUER</strong>.\n   </li>\n   <li>\n      Sélectionnez une <strong>adresse IP locale</strong> dans le menu déroulant.\n      <br>\n      Si vous avez configuré AWS Direct Connect pour ce SDDC et que vous souhaitez que le VPN l'utilise, sélectionnez\n      l'adresse IP privée. Notez que le trafic VPN sur Direct Connect est limité à la MTU par défaut de 1 500 octets,\n      même si le lien prend en charge une MTU supérieure. Sélectionnez l'adresse IP publique si vous souhaitez que le VPN se connecte via Internet.\n   </li>\n   <li>\nPour <strong>Adresse IP publique distante</strong>, entrez l'adresse de votre point de terminaison VPN sur site.\n      <br>\n      Reportez-vous à la section <a\n         href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_030\" target=\"_blank\"\n      >Créer un VPN basé sur les routes</a> pour les contraintes importantes sur les valeurs d'adresses IP locales et distantes.\n   </li>\n   <li>\n      Pour <strong>Longueur de préfixe/adresse IP locale BGP </strong>, entrez l'adresse IP, au format CIDR, du tunnel VPN local.\n   </li>\n   <li>\n      Pour <strong>Adresse IP publique BGP</strong>, entrez l'adresse de l'interface BGP de votre passerelle VPN sur site.\n   </li>\n   <li>\n      Pour <strong>ASN distant BGP</strong>, entrez le numéro ASN de votre passerelle VPN sur site.\n   </li>\n   <li>\n      Configurez <strong>Paramètres de tunnel avancés</strong>.\n      <br>\n      Reportez-vous à la section <a\n         href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_030\" target=\"_blank\"\n      >Créer un VPN basé sur les routes</a> pour découvrir les valeurs de paramètre suggérées.\n   </li>\n   <li>\n      Sous <strong>Paramètres BGP avancés </strong>, entrez un <strong>code secret</strong> BGP qui correspond à celui utilisé par la passerelle sur site.\n   </li>\n   <li>(Facultatif) Marquez le VPN.</li>\n   <li>\n      Cliquez sur <strong>ENREGISTRER</strong>.\n   </li>\n</ol>\n<p>Le processus de création de VPN peut prendre quelques minutes. Lorsque le VPN basé sur les routes devient disponible, l'état du tunnel et l'état de la session BGP sont affichés. Les actions suivantes sont disponibles pour vous aider dans le cadre du dépannage et de la configuration de l'extrémité sur site du VPN :</p>\n<ul>\n   <li>\n      Cliquez sur <strong>TÉLÉCHARGER LA CONFIGURATION</strong> pour télécharger un fichier contenant les détails de la configuration du VPN. Vous pouvez utiliser ces détails pour configurer l'extrémité sur site de ce VPN.\n   </li>\n   <li>\n      Cliquez sur <strong>AFFICHER LES STATISTIQUES</strong> pour afficher les statistiques du trafic de paquets pour ce VPN. Reportez-vous à <a\n         href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_026\" target=\"_blank\"\n      >Afficher l'état et les statistiques du tunnel VPN</a>.\n   </li>\n   <li>\n      Cliquez sur <strong>AFFICHER LES ROUTES</strong> pour ouvrir un affichage des routes annoncées et apprises par ce VPN.\n   </li>\n   <li>\n      Cliquez sur <strong>TÉLÉCHARGER LES ROUTES</strong> pour télécharger une liste de <strong>Routes annoncées</strong> ou de <strong>Routes apprises</strong> au format CSV.\n   </li>\n</ul>",
    "create-sddc" : "<!--\ntitle: Comment créer un SDDC ?\ncontext: [dashboard,create-sddc]\n-->\n<p>\n    Pour créer un SDDC, choisissez une région AWS pour l'héberger, nommez le SDDC et spécifiez le nombre d'hôtes ESXi\n    qu'il doit contenir. Si vous ne disposez pas déjà d'un compte AWS, vous pouvez toujours créer un SDDC avec configuration\n    de démarrage qui contient un seul hôte ESXi. Il existe une relation un-à-un entre les SDDC et les comptes AWS client.\n    Vous pouvez connecter un SDDC à un seul compte client AWS et au VPC Amazon.</p>\n<p>\n    Depuis le tableau de bord, cliquez sur <b>Créer un SDDC</b> pour lancer l'assistant <strong>Créer un centre de données défini par logiciel\n        (SDDC)</strong>. Pour plus d'informations sur ce processus, consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_008\"\n        target=\"_blank\"\n    >Déployer un SDDC à partir de la console VMC</a>. L'état du déploiement du SDDC est\n    affiché sur le tableau de bord.\n</p>\n",
    "delete-sddc" : "<!--\ntitle: Comment supprimer un SDDC ?\ncontext: [dashboard]\n-->\n<p>\n    Sur le tableau de bord, localisez la carte pour le SDDC et cliquez sur <strong>ACTIONS</strong> &gt; <strong>Supprimer le SDDC</strong>.\n    Confirmez que vous comprenez les conséquences de cette action, qui ne peut pas être annulée, puis cliquez sur <strong>SUPPRIMER LE\n        SDDC</strong>.\n</p>\n",
    "e1cba85551988a87c1139e690d5997ad" : "<!--\ntitle: Comment configurer le NAT ?\ncontext: [networking,nat]\n-->\n<p>Le NAT (Network Address Translation) sortant est configuré par défaut pour la passerelle de calcul. Vous pouvez configurer le NAT entrant. </p>\n<ol class=\"list\">\n    <li>Dans l'onglet Réseau de votre SDDC, cliquez sur <b>NAT</b>.</li>\n    <li>Entrez les paramètres NAT :        <ul class=\"list\">\n            <li><b>Description :</b> entrez une description pour la règle NAT.</li>\n            <li><b>Adresse IP publique :</b> sélectionnez l'adresse IP publique. Pour en savoir plus sur le provisionnement d'une adresse IP publique, consultez l'aide.</li>\n            <li><b>Service :</b> sélectionnez l'un des choix suivants :                <ul class=\"list\">\n                    <li><b>Any :</b> (équivalent à Tous) la règle s'applique à tout le trafic.</li>\n                    <li>Un service spécifique : la règle s'applique au trafic en provenance du service et du port sélectionnés.</li>\n                    <li><b>ICMP (Tous)</b> : la règle s'applique au trafic ICMP, par exemple les paquets ping.</li>\n                    <li><b>TCP personnalisé</b> ou <b>UDP personnalisé</b> : pour définir un service et un port personnalisés auxquels appliquer la règle.</li>\n                </ul>\n            </li>\n            \n            <li><b>Ports publics :</b> si vous sélectionnez un service TCP ou UDP personnalisé, entrez le port ou la plage de ports de départ de la route.</li>\n            <li><b>Adresse IP interne :</b> entrez l'adresse IP interne ou le bloc d'adresses IP internes vers lesquelles l'adresse IP publique doit être routée. </li>\n             <li><b>Ports internes :</b> si vous sélectionnez un service TCP ou UDP personnalisé, entrez le port ou la plage de ports de destination de la route.</li>\n        </ul>\n    </li>\n</ol>\n",
    "e87aff2a3ca94aca6476294af0962f5a" : "<!--\ntitle: Que puis-je faire sur la page Informations de connexion ?\ncontext: [connection-info]\n-->\n<p>Sur la page Informations de connexion, vous pouvez trouver des liens hypertexte pour accéder à vSphere Client et à vCenter Server pour votre SDDC. Vous pouvez également voir le mot de passe initial généré pour le compte cloudadmin@vmc.local, que vous pouvez utiliser pour l'authentification auprès de vCenter Server. </p>\n<p>Si vous modifiez le mot de passe du compte cloudadmin@vmc.local, le mot de passe n'est pas mis à jour sur cette page. </p>",
    "ef1277c930de7bd02f7937fb7b49d446" : "<!--\ntitle: Je vais manquer de mémoire. Que puis-je faire ?\ncontext: [summary]\n-->\n<p>Si vous avez la possibilité d'ajouter des hôtes et si votre SDDC n'a pas atteint son nombre maximal d'hôtes, vous pouvez ajouter un hôte pour augmenter la capacité de mémoire disponible. Sinon, arrêtez des charges de travail ou migrez-les hors de votre SDDC.</p>",
    "ef936d7192ea7455d6def600da0c3062" : "<!--\ntitle: Quels rôles puis-je attribuer à un nouvel utilisateur ?\ncontext: [dashboard, invite]\n-->\n\n<p>Lorsque vous invitez de nouveaux utilisateurs, vous pouvez leur attribuer les rôles suivants :</p>\n<ul class=\"list\">\n    <li>Propriétaire de l'organisation : seuls les propriétaires de l'organisation peuvent inviter d'autres utilisateurs au compte.</li>\n    <li>Membres de l'organisation : les membres de l'organisation peuvent créer et gérer des centres de données cloud appartenant à l'organisation ou y accéder, mais ils ne peuvent pas inviter de nouveaux utilisateurs.</li>\n</ul>\n",
    "f162582a2057d3497784dd2a7579ba69" : "<!--\ntitle: Combien d'hôtes peut comprendre mon SDDC ?\ncontext: [create-sddc]\n-->\n<p>Actuellement, vous pouvez déployer un SDDC avec un minimum de 4 hôtes et un maximum de 16.</p>\n",
    "f1744e41db8ba4a4ec281f5c63a3df29" : "<!--\ntitle: Comment configurer les règles de pare-feu de la passerelle de calcul ?\ncontext: [networking,firewall]\n-->\n<p>Les règles de pare-feu par défaut pour la passerelle de gestion et la passerelle de calcul bloquent tout le trafic entrant et sortant. Avant de pouvoir utiliser ces passerelles, vous devez ajouter des règles de pare-feu qui autorisent le trafic selon les besoins.</p>\n<ol class=\"list\">\n    <li>Accédez à l'onglet <b>Réseau</b> pour le SDDC.</li>\n    <li>Pour créer un ensemble prédéfini de règles de pare-feu pour la passerelle de gestion, développez <b>Accélérateur de règles de pare-feu</b> sous <b>Passerelle de gestion</b>, puis cliquez sur \n    <b>CRÉER DES RÈGLES DE PARE-FEU</b> pour créer des règles dans le <b>groupe de règles</b> et le <b>VPN</b> sélectionnés.\n    </li>\n    <li>Pour créer manuellement des règles de pare-feu ou modifier des règles créées par l'accélérateur de règles de pare-feu, développez <b>Règles de pare-feu</b> sous <b>Passerelle de gestion</b> ou <b>Passerelle de calcul</b>.</li>\n    <li>Cliquez sur <b>Ajouter une règle</b>.</li>\n    <li>Entrez les paramètres de la règle :        <ul class=\"list\">\n            <li><b>Nom de la règle :</b> entrez un nom pour la règle.</li>\n            <li><b>Action :</b> sélectionnez <b>Autoriser</b> ou <b>Refuser</b>.</li>\n            <li><b>Source :</b> entrez ou sélectionnez l'un des éléments suivants.                <ul class=\"list\">\n                <li>Sélectionnez <b>Toutes les connexions Internet et VPN</b> pour appliquer la règle à tout le trafic en provenance d'Internet et du VPN.</li>\n                <li>Sélectionnez <b>Toutes les instances connectées de VPC Amazon</b> pour appliquer la règle à tout le trafic en provenance du VPC Amazon connecté.</li>    \n                <li>Entrez <b>Any</b> (équivalent à Tous) pour appliquer la règle au trafic issu de toutes les sources.</li>\n                <li>Entrez une ou plusieurs adresses IP ou plages d'adresses IP séparées par des virgules pour appliquer la règle au trafic provenant de ces adresses IP spécifiques. </li>    \n                </ul>\n            </li>\n            <li><b>Destination :</b> </b> entrez ou sélectionnez l'un des éléments suivants.\n                <ul class=\"list\">\n                <li>Sélectionnez <b>Toutes les connexions Internet et VPN</b> pour appliquer la règle à tout le trafic vers Internet et le VPN.</li>\n                <li>Sélectionnez <b>Toutes les instances connectées de VPC Amazon</b> pour appliquer la règle à tout le trafic vers le VPC Amazon connecté.</li>    \n                <li>Entrez <b>Any</b> (équivalent à Tous) pour appliquer la règle au trafic vers toutes les sources.</li>\n                <li>Entrez une ou plusieurs adresses IP ou plages d'adresses IP séparées par des virgules pour appliquer la règle au trafic vers ces adresses IP spécifiques. </li>    \n                </ul></li>\n            <li><b>Service :</b> sélectionnez l'un des choix suivants :                <ul class=\"list\">\n                    <li><b>Any (tout le trafic) :</b> la règle s'applique à tout le trafic.</li>\n                    <li>Un service spécifique : la règle s'applique au trafic en provenance du service et du port sélectionnés.</li>\n                    <li><b>ICMP (tout ICMP)</b> : la règle s'applique à tout le trafic ICMP</li>\n                    <li><b>TCP personnalisé</b> ou <b>UDP personnalisé</b> : pour définir un service et un port personnalisés auxquels appliquer la règle.</li>\n                </ul>\n            </li>\n            <li><b>Ports :</b> si vous sélectionnez un service TCP ou UDP personnalisé, entrez le numéro de port.</li>\n        </ul>\n    </li>\n</ol>\n<p>Les règles de pare-feu sont appliquées dans l'ordre de haut en bas. Utilisez les icônes flèches haut et bas pour déplacer les règles de pare-feu</p>\n",
    "f44b2dc3154413e99b0427e8f9cd4d72" : "<!--\ntitle: Je vais manquer de capacité de CPU. Que puis-je faire ?\ncontext: [summary]\n-->\n<p>Si vous avez la possibilité d'ajouter des hôtes et si votre SDDC n'a pas atteint son nombre maximal d'hôtes, vous pouvez ajouter un hôte pour augmenter la capacité de CPU disponible. Sinon, arrêtez des charges de travail ou migrez-les hors de votre SDDC.</p>",
    "fe666a0d29b8c867ff39f4b94392a748" : "<!--\ntitle: Quelles sont les passerelles de gestion et de calcul ?\ncontext: [networking]\n-->\n<p>Lorsque vous déployez un SDDC à l'aide de VMware Cloud on AWS, il est configuré avec deux réseaux : un réseau de gestion et un réseau de calcul. </p>\n<p>Le réseau de gestion traite le trafic réseau pour les hôtes SDDC, vCenter Server, NSX Manager et les autres fonctions de gestion.</p>\n<p>Le réseau de calcul gère le trafic réseau de vos machines virtuelles de charge de travail.</p>\n",
    "firewall-rules" : "<!--\ntitle: Quelles règles de pare-feu sont nécessaires pour Site Recovery ?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n<p>Vous devez créer les règles de pare-feu de passerelle de gestion suivantes pour autoriser le trafic de gestion et de réplication\n    requis par le service VMware Site Recovery.</p>\n<p>Pour activer la gestion et l'accès aux API :</p>\n<ol class=\"list\">\n    <li>Autoriser le service HTTPS entrant (TCP 443) vers vCenter</li>\n    <li>Autorisez le service SRM Server Management entrant (TCP 9086) vers Site Recovery Manager</li>\n    <li>Autorisez le service VR Server Management entrant (TCP 8043) vers vSphere Replication</li>\n    <li>Autorisez le service « Any » équivalant à Tous (tout le trafic) sortant depuis vCenter, Site Recovery Manager et vSphere Replication</li>\n</ol>\n<p>Pour activer le trafic de réplication :</p>\n<ol class=\"list\">\n    <li>Autorisez le service VM Replication entrant (TCP 31031, 44046) vers vSphere Replication</li>\n    <li>Autorisez le service « Any » équivalant à Tous (tout le trafic) sortant depuis la gestion ESXi uniquement</li>\n</ol>\n<p>Pour activer l'accès à la console Site Recovery</p>\n<ol class=\"list\">\n    <li>Autorisez HTTPS entrant (TCP 443) vers vSphere Replication</li>\n</ol>\n",
    "hcx" : "<!--\ntitle: Qu'est-ce que le module complémentaire HCX ?\ncontext: [hcx,addons]\n-->\n<p>\n    VMware HCX abstrait les ressources sur site et cloud, puis les présente aux charges de travail comme un cloud hybride. Cela permet la mobilité des charges de travail entre votre centre de données sur site et le SDDC de cloud. HCX est inclus dans le cadre de votre service VMC on AWS. Pour en savoir plus sur l'installation et la configuration de HCX, consultez la <a\n        href=\"https://docs.vmware.com/fr/VMware-HCX/index.html\" target=\"_blank\"\n    >Documentation de VMware HCX</a> et <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_011\"\n        target=\"_blank\"\n    >Migration hybride avec la liste de contrôle HCX</a>.\n</p>\n",
    "how-dns" : "<!--\ntitle: Comment configurer le DNS ?\ncontext: [networking,dns]\n-->\n<p>\n    Vous devez spécifier un serveur DNS sur les passerelles de gestion et de calcul pour autoriser les hôtes et les VM à résoudre\n····les noms de domaine complet (FQDN) des adresses IP sur les réseaux de gestion et de calcul. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-12DA448A-9CFC-49CD-B765-3CB8A0B91BAB.html\"\n        target=\"_blank\"\n    >Définir le DNS de la passerelle de gestion</a> et <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-09E0A733-E621-4A53-9061-A409860F5011.html\"\n        target=\"_blank\"\n    >Définir le DNS de la passerelle de calcul</a>.\n</p>\n<p>\n    Le DNS doit être configuré séparément des passerelles de gestion et de calcul.\n</p>\n",
    "how-invite-user" : "<!--\ntitle: Comment inviter un autre utilisateur ?\ncontext: [dashboard]\n-->\n<p>\n    Le propriétaire de l'organisation peut inviter des utilisateurs à rejoindre l'organisation. Suivez les étapes décrites dans <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_009\"\n        target=\"_blank\"\n    >Inviter un nouvel utilisateur</a>.",
    "how-remove-user" : "<!--\ntitle: Comment supprimer un autre utilisateur ?\ncontext: [dashboard]\n-->\n<p>\n    Pour supprimer un utilisateur d'une organisation, vous devez être propriétaire de celle-ci.</p>\n<ol class=\"list\">\n    <li>\n        Dans le tableau de bord de la console VMC, cliquez sur l'icône Services dans le coin supérieur droit de la fenêtre, puis sélectionnez <strong>Gestion\n            des identités et des accès</strong>.\n    </li>\n    <li>Sélectionnez l'utilisateur ou les utilisateurs que vous souhaitez supprimer.</li>\n    <li>\n        Cliquez sur <strong>Supprimer des utilisateurs</strong>.\n    </li>\n    <li>\n        Cliquez sur <strong>Supprimer</strong> pour confirmer la suppression.\n    </li>\n</ol>\n<p>L'utilisateur est supprimé de l'organisation et ne pourra plus accéder aux ressources de l'organisation.</p>",
    "how-set-default-org" : "<!--\ntitle: Comment définir mon organisation par défaut ?\ncontext: [dashboard]\n-->\n<p>\n    Si vous êtes membre de plusieurs organisations, vous pouvez définir une organisation par défaut. Cette organisation sera\n    affichée lorsque vous vous connectez.</p>\n<ol class=\"list\">\n    <li>Depuis le tableau de bord de la console VMC, cliquez sur votre nom d'utilisateur et votre organisation dans la barre d'outils.</li>\n    <li>\n        Cliquez sur <strong>Définir l'organisation par défaut</strong> et sélectionnez l'organisation que vous souhaitez utiliser par défaut.\n    </li>\n</ol>",
    "how-switch-language" : "<!--\ntitle: Comment changer la langue utilisée par la console VMC ?\ncontext: [dashboard]\nfeature: uiEnableLocalization\n-->\n<p>Pour modifier la langue affichée par VMware Cloud sur AWS ou tout autre service VMware Cloud, définissez la \n    préférence de langue pour votre compte.</p>\n<ol class=\"list\">\n    <li>\n        Dans la console VMware Cloud Services, cliquez sur votre nom d'utilisateur et votre organisation dans la barre d'outils, puis sélectionnez <strong>Mon\n            compte</strong>.\n    </li>\n    <li>\n        Cliquez sur <strong>Préférences</strong>.\n    </li>\n    <li>\n        Modifiez les paramètres <strong>Langue</strong> et <strong>Format régional</strong>.\n    </li>\n</ol>",
    "invite-no-myvmware" : "<!--\ntitle: Puis-je inviter un utilisateur qui ne dispose d'aucun compte MyVMware ?\ncontext: [dashboard, invite]\n-->\n\n<p>Oui. L'utilisateur sera invité à créer un compte MyVMware pendant le processus d'inscription.</p>",
    "ipsec-vpn-connection" : "<!--\ntitle: Comment configurer une connexion VPN IPsec à la passerelle de gestion ?\ncontext: [networking,vpn]\n-->\n<p>\n    La passerelle de gestion permet d'accéder à l'infrastructure de gestion SDDC, y compris aux hôtes vCenter Server, NSX et\n    ESXi. Un VPN IPsec assure la connectivité du réseau de gestion entre la passerelle de gestion et un réseau dans votre\n    SDDC. Pour créer une connexion VPN IPsec, suivez les étapes décrites dans <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-3A7090C5-836C-4DBA-9E69-A4A1D9B6F139.html\"\n        target=\"_blank\"\n    >Utiliser l'assistant de configuration de VPN MGW pour configurer un VPN et une passerelle de gestion</a>.\n</li>\n",
    "log-intelligence" : "<!--\ntitle: Qu'est-ce que le module complémentaire VMware vRealize Log Insight ?\ncontext: [log-intelligence,addons]\nfeature: uiEnableLintAddon\n-->\n<p>\n    VMware vRealize Log Insight Cloud vous permet de collecter et d'analyser les journaux générés dans votre SDDC. Une version d'évaluation du\n    service est activé par défaut dans un nouveau SDDC. Une période d'essai de trente jours commence lorsqu'un utilisateur de votre organisation\n    accède au service. Après la période d'essai, vous pouvez choisir de vous abonner à ce service ou de continuer à utiliser un\n    sous-ensemble de fonctionnalités de service sans frais supplémentaire. Pour plus d'informations sur l'utilisation de VMware vRealize Log Insight\n    Cloud, consultez la <a\n        href=\"https://docs.vmware.com/fr/VMware-Log-Intelligence/index.html\"\n        target=\"_blank\"\n    >Documentation de vRealize Log Insight Cloud</a>.\n</p>\n",
    "logical-network" : "<!--\ntitle: Comment créer un réseau logique ?\ncontext: [networking,logical-network]\n-->\n<p>\n        Les réseaux logiques fournissent un accès réseau aux VM de charge de travail. Votre SDDC commence par un réseau logique unique par défaut,\n    sddc-cgw-network-1. Vous pouvez utiliser vSphere Client HTML5 pour créer des réseaux logiques supplémentaires. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_017\"\n        target=\"_blank\"\n    >Créer ou modifier un réseau logique</a>.",
    "manage-vcenter-access" : "<!--\ntitle: Comment gérer les accès à vCenter Server ?\ncontext: [networking,firewall,vpn]\n-->\n<p>\n    Par défaut, il n'y a pas d'accès externe au système vCenter Server dans votre SDDC. Pour ouvrir l'accès à votre système vCenter Server,\n    procédez comme suit :\n</p>\n<ul class=\"list\">\n    <li>Configurez une règle de pare-feu pour autoriser l'accès au système vCenter Server.</li>\n    <li>Configurez un VPN IPsec entre votre centre de données sur site et votre SDDC.</li>\n</ul>\n<p>\n    Une fois que vous avez configuré l'une de ces options, cliquez sur l'onglet <b>Paramètres</b> pour voir comment vous connecter au système vCenter\n    Server à l'aide de vSphere Client et PowerCLI.\n</p>\n",
    "management-compute-gateways" : "<!--\r\ntitle: Quelles sont les passerelles de gestion et de calcul ?\r\ncontext: [networking]\r\n-->\r\n<p>\n    Lorsque vous déployez un SDDC à l'aide de VMware Cloud on AWS, il est configuré avec deux réseaux : un réseau de gestion\n    et un réseau de calcul. Le réseau de gestion traite le trafic réseau des hôtes SDDC, vCenter Server, NSX Manager\n    et les autres fonctions de gestion. Le réseau de calcul gère le trafic réseau de vos VM de charge de travail.\n</p>\r\n",
    "memory-running-out" : "<!--\ntitle: Je vais manquer de mémoire. Que puis-je faire ?\ncontext: [summary]\n-->\n<p>\n    Si vous avez la possibilité d'ajouter des hôtes et si votre SDDC n'a pas atteint son nombre maximal d'hôtes, vous pouvez ajouter un hôte\n    pour augmenter la capacité de mémoire disponible. Sinon, arrêtez les charges de travail ou migrez-les hors de votre SDDC.\n</p>",
    "nat" : "<!--\ntitle: Comment configurer le NAT ?\ncontext: [networking,nat]\n-->\n<p>\n    Le NAT (Network Address Translation) sortant est configuré par défaut pour la passerelle de calcul. Le NAT entrant vous permet\n    de mapper le trafic Internet d'une adresse IP et un port publics vers une adresse IP et un port privés à l'intérieur du réseau de calcul de\n    votre SDDC. Pour configurer le NAT entrant, consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0C04B8A4-A880-4A8E-85A5-4720D3A30235.html\"\n        target=\"_blank\"\n    >Configurer les paramètres NAT</a>.\n</p>\n",
    "preshared-key" : "<!--\r\ntitle: Quelle est la clé prépartagée ?\r\ncontext: [networking,vpn]\r\n-->\r\n<p>\n    La clé prépartagée est utilisée par les deux extrémités du tunnel VPN de la passerelle de gestion pour s'authentifier\n    mutuellement. La passerelle SDDC et votre passerelle sur site doivent donc utiliser la même clé. La clé a une longueur maximale de\n    128 caractères. Traitez-la comme un mot de passe : maintenez-la confidentielle et n'utilisez pas un e-mail ou d'autres\n    méthodes non sécurisées pour la communiquer à d'autres personnes.\n</p>\r\n",
    "public-ip" : "<!--\ntitle: Comment gérer les adresses IP publiques ?\ncontext: [networking,public-ip]\n-->\n<p>\n    Si vous disposez d'une VM de charge de travail à laquelle vous devez accéder depuis l'Internet public, demandez une adresse IP publique. Consultez\n    <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_018\"\n        target=\"_blank\"\n    >Demander ou libérer une adresse IP publique</a>.\n</p>",
    "recommended-cryptography" : "<!--\ntitle: Quels sont les paramètres de chiffrement recommandés pour les VPN IPsec ?\ncontext: [networking,vpn]\n-->\n<p>\nL'extrémité sur site de n'importe quel VPN IPsec doit être configurée pour faire correspondre les paramètres que vous avez spécifiés pour l'extrémité SDDC de ce VPN. Consultez la <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_019\"\n        target=\"_blank\"\n    >Référence des paramètres de VPN IPsec</a> pour plus d'informations sur les paramètres disponibles et les valeurs recommandées.\n</p>",
    "remove-host" : "<!--\ntitle: Comment supprimer des hôtes ?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>\n    Vous pouvez supprimer un hôte de votre SDDC tant que vous respectez le nombre minimal d'hôtes requis. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_012\"\n        target=\"_blank\"\n    >Supprimer des hôtes</a>.\n</p>\n",
    "sddc-can-i-add-hosts" : "<!--\ntitle: Puis-je ajouter des hôtes à mon SDDC ultérieurement ?\ncontext: [create-sddc]\n-->\n<p>\n    Vous pouvez déployer des hôtes supplémentaires ultérieurement si votre SDDC contient moins d'hôtes que la valeur maximale allouée à votre\n    organisation.\n</p>\n",
    "sddc-groups" : "<!--\ntitle: Qu'est-ce qu'un groupe de SDDC ?\ncontext: [create-sddc]\nfeature: uiEnableSddcGroups\n-->\n<p>Un groupe de déploiement de SDDC connecte vos SDDC et VPC à l'aide de VMware Transit Connect pour fournir des connexions à haut débit et \nà faible latence entre les SDDC du groupe et d'autres VPC dans la même région. Vous pouvez également ajouter un dispositif Direct\nConnect Gateway (DXGW) pour fournir une connectivité centralisée à vos SDDC sur site. Un SDDC doit répondre à plusieurs\ncritères pour pouvoir appartenir au groupe :</p>\n<ul class=\"list\">\n    <li>Il doit appartenir à l'organisation qui possède le groupe.</li>\n    <li>Il doit se trouver dans la même région AWS que les autres membres du groupe.</li>\n    <li>Son bloc CIDR de réseau de gestion ne peut pas chevaucher le bloc CIDR de gestion d'un autre membre du groupe.</li>\n    <li>Il ne peut pas être membre d'un autre groupe de déploiement de SDDC.</li>\n    <li>Le dispositif SDDC doit être dans la version 1.11 ou ultérieure.</li>\n</ul>\n<p>La connectivité des homologues entre les membres du groupe de SDDC nécessite une passerelle de transit VMware gérée (VTGW). Il s'agit d'une ressource AWS créée par VMware Transit Connect, appartenant et gérée par VMware. L'ajout du premier membre à un groupe de SDDC\ncréé l'une de ces ressources et l'attribue au groupe. La création et le fonctionnement d'une passerelle VTGW sont induits par d'autres\nfrais sur votre facture VMware Cloud on AWS.</p>\n<p>Pour créer un groupe de SDDC :\n<ol class=\"list\">\n    <li>\n        Dans l'onglet groupes de SDDC, cliquez sur <strong>ACTIONS</strong> et sélectionnez <strong>Créer un groupe de SDDC</strong>.\n    </li>\n    <li>\n        Donnez au groupe un <strong>Nom</strong> et éventuellement une <strong>Description</strong>, puis cliquez sur <strong>SUIVANT</strong>.\n    </li>\n    <li>\n        Dans la grille <strong>Appartenance</strong>, sélectionnez les SDDC à inclure en tant que membres du groupe. Lorsque vous avez terminé la\n        sélection des membres, cliquez sur <strong>SUIVANT</strong>.\n    </li>\n    <li>\n        Déclarez que vous comprenez et assumez les coûts que vous encourez lorsque vous créez un groupe de SDDC,\n        puis cliquez sur <strong>CRÉER UN GROUPE</strong> pour créer le groupe de SDDC et sa passerelle de transit VMware gérée.\n    </li>\n</ol>\n<p>\n    Les frais commencent lorsque vous cliquez sur <strong>CRÉER UN GROUPE</strong>. Vous ne pouvez pas suspendre ou annuler le processus après son démarrage.\nLes membres du groupe ne pourront pas utiliser VMware Transit Connect ou son VTGW tant que le déploiement ne sera pas terminé. Le déploiement\ndure généralement environ quinze minutes.\n</p>",
    "sddc-how-many-hosts" : "<!--\ntitle: Combien d'hôtes peut comprendre mon SDDC ?\ncontext: [create-sddc]\n-->\n<p>Un SDDC de démarrage à hôte unique est limité à un seul hôte jusqu'à ce que votre besoin augmente. Les autres SDDC commencent avec un minimum de deux hôtes et peuvent évoluer jusqu'à un maximum de 16 hôtes.</p>\n",
    "set-compute-dns" : "<!--\ntitle: Comment configurer DNS pour mes réseaux de gestion et de calcul ?\ncontext: [networking, dns, system]\nfeature: enableNsxtDeployment\n-->\n<p>\n    Votre SDDC inclut des zones DNS par défaut pour la passerelle de gestion et la passerelle de calcul. Chaque zone inclut un\n    service de transfert DNS préconfiguré. Utilisez l'onglet <strong>Services DNS</strong> de la page Services DNS pour désactiver,\n    activer ou mettre à jour certaines propriétés des services de transfert DNS pour les zones par défaut. Pour créer des zones DNS\n    supplémentaires ou configurer les propriétés supplémentaires des redirecteurs DNS dans n'importe quelle zone, utilisez l'onglet\n    <strong>Zones DNS</strong>. Pour plus d'informations, consultez la section <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_002\" target=\"_blank\"\n    >Ajouter une zone DNS</a>.\n</p>\n<ol class=\"list\">\n    <li>\n        Cliquez sur <strong>DNS</strong>.\n    </li>\n    <li>\n        Cliquez sur Services DNS pour ouvrir l'onglet correspondant.\n        <br>\n        Pour plus d'informations sur les paramètres des services DNS, reportez-vous à <a\n            href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_025\" target=\"_blank\"\n        >Configurer les services DNS</a>.\n    </li>\n    <li>\n        Cliquez sur <b>ENREGISTRER</b>.\n    </li>\n</ol>",
    "srm" : "<!--\ntitle: Qu'est-ce que le module complémentaire Site Recovery ?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n<p>\n    VMware Site Recovery vous permet d'effectuer une récupération d'urgence automatique de machines virtuelles à partir de votre centre de données\n    sur site vers votre SDDC. Pour plus d'informations, consultez la <a\n        href=\"https://docs.vmware.com/fr/VMware-Site-Recovery/index.html\"\n        target=\"_blank\"\n    >Documentation de VMware Site Recovery</a>.\n</p>\n",
    "storage-running-out" : "<!--\ntitle: Je vais manquer d'espace de stockage. Que puis-je faire ?\ncontext: [summary]\n-->\n<p>\n    Si vous avez la possibilité d'ajouter des hôtes et si votre SDDC n'a pas atteint son nombre maximal d'hôtes, vous pouvez ajouter un hôte pour\n    augmenter la capacité de stockage disponible. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_010\"\n        target=\"_blank\"\n    >Ajouter des hôtes</a>. Sinon, arrêtez les charges de travail ou migrez-les hors de votre SDDC.\n</p>",
    "undefined" : "<!--\ntitle: Comment ajouter des hôtes supplémentaires ?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Vous pouvez ajouter un hôte si votre SDDC contient moins d'hôtes que son nombre maximal. Si vous ne voyez pas l'option <b>Ajouter des hôtes</b> dans le menu <b>Actions</b>, contactez VMware.</p>\n    \n<p>Pour ajouter un hôte :</p>\n<ol class=\"list\">\n    <li>Accédez à l'onglet <b>Résumé</b> pour votre SDDC.</li>\n    <li>Sélectionnez <b>Actions</b> &gt; <b>Ajouter des hôtes</b>.</li>\n    <li>Sélectionnez le nombre d'hôtes à ajouter.</li>\n    <li>Cliquez sur <b>Ajouter des hôtes</b>.</li>\n</ol>\n<p>Le redimensionnement du SDDC peut prendre quelques minutes. Pendant l'ajout des hôtes, vos charges de travail et vCenter Server continuent à fonctionner normalement, mais vous ne pouvez pas démarrer d'autres actions d'ajout ou de suppression d'hôtes.</p>\n",
    "vms-cant-reach-internet" : "<!--\ntitle: Pourquoi mes machines virtuelles ne peuvent-elles pas accéder à Internet ?\ncontext: [networking,firewall]\n-->\n<p>\n    Les règles de pare-feu de passerelle de calcul par défaut empêchent tout le trafic des VM d'atteindre Internet. Pour autoriser vos\n    machines virtuelles à atteindre Internet, vous devez créer une règle de pare-feu de passerelle de calcul pour autoriser le trafic sortant\n    sur le réseau logique auquel votre VM est connectée. Consultez <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_020\"\n        target=\"_blank\"\n    >Ajouter ou modifier des règles de pare-feu de passerelle de calcul</a>.\n</p>",
    "what-can-i-do" : "<!--\ntitle: Que puis-je faire sur la zone de lancement ?\ncontext: [launchpad]\n-->\n<p>La zone de lancement de VMware Cloud est un point de départ consolidé pour toutes les infrastructures de cloud hybride VMware et les solutions associées. Vous pouvez utiliser les liens sur cette page pour commencer à utiliser les solutions de migration, à explorer VMware Tanzu\nKubernetes Grid ou à créer l'infrastructure dont vous avez besoin pour les étapes suivantes de votre migration vers le cloud.</p>\n<p>\nVous trouverez plus d'informations sur la zone de lancement dans <a\n        href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_036\" target=\"_blank\"\n    >VMware Docs</a>.\n</p>",
    "what-happens-when-i-delete" : "<!--\ntitle: Que se passe-t-il lorsque je supprime un SDDC ?\ncontext: [dashboard]\n-->\n<p>Lorsque vous supprimez un SDDC :</p>\n<ul class=\"list\">\n    <li>Toutes les charges de travail dans le SDDC sont arrêtées.</li>\n    <li>Toutes les données et tous les paramètres de configuration dans le SDDC sont supprimés.</li>\n    <li>L'accès à l'interface utilisateur et à l'API sur le SDDC est arrêté.</li>\n    <li>Toutes les adresses IP publiques du SDDC sont libérées.</li>\n    <li>Toutes les interfaces virtuelles Direct Connect dans le SDDC sont supprimées.</li>\n</ul>\n<p>Sauvegardez ou migrez les machines virtuelles de charge de travail et de données essentielles avant de supprimer un SDDC.</p>\n",
    "what-is-connected-amazon-vpc" : "<!--\ntitle: Quel est le VPC Amazon connecté ?\ncontext: [networking]\n-->\n<p>\n    Pendant la création du SDDC, vous pouvez connecter votre SDDC à un compte AWS, puis sélectionner un VPC et un sous-réseau dans ce\n    compte. À l'aide d'un modèle CloudFormation, VMware Cloud on AWS crée une interface ENI (Elastic Network Interface)\n    permettant à votre SDDC et aux services du VPC Amazon et du sous-réseau de votre compte AWS de communiquer sans devoir\n    acheminer le trafic par la passerelle Internet. Vous ne pouvez connecter un SDDC qu'à un seul VPC Amazon.\n</p>\n<p>\n    Vous pouvez voir les détails de votre VPC Amazon connecté tels que l'ID du compte, l'ID du VPC et le sous-réseau en cliquant sur <b>VPC\n     connecté</b> dans la catégorie <b>Système</b> de l'onglet <b>Mise en réseau et sécurité</b>.\n</p>\n",
    "what-is-direct-connect" : "<!--\ntitle: Qu'est-ce qu'Amazon Direct Connect ?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    <a href=\"https://aws.amazon.com/directconnect/\">AWS Direct Connect</a> est un service fourni par AWS qui vous permet\n    de créer une connexion réseau à haute vitesse et à faible latence dédiée entre votre centre de données sur site et un emplacement AWS\n    Direct Connect. Vous pouvez accéder à Direct Connect via une interface virtuelle privée que vous créez\n    dans la console AWS. Dans un SDDC avec mise en réseau reposant sur NSX-T, tout le trafic Direct Connect, y compris vMotion,\n    le trafic de gestion et le trafic de passerelle de calcul utilisent une interface virtuelle privée.\n</p>\n",
    "what-is-preview" : "<!--\ntitle: Quelles sont les fonctionnalités d'aperçu ?\ncontext: [dashboard]\n-->\n<p>\n    Des fonctionnalités en aperçu ont été publiées pour obtenir des commentaires. Ces fonctionnalités sont désignées par l'icône <b>Aperçu</b>\n    dans l'interface utilisateur. Ces fonctionnalités ne seront pas nécessairement disponibles pour tous les clients ou dans toutes les régions AWS. Nous ne pouvons garantir\n    que les fonctionnalités en « Aperçu » deviendront disponibles à une échéance précise ni même la certitude de cette disponibilité. Prenez vos\n    décisions d'achat uniquement sur la base des fonctionnalités déjà disponibles.\n</p>",
    "what-is-traffic-group" : "<!--\ntitle: Qu'est-ce qu'un groupe de trafic ?\ncontext: [networking, virtual-interfaces]\nfeature: uiEnableSddcGroups\n-->\n<p>\n    Dans la configuration par défaut, votre réseau SDDC dispose d'un seul routeur Edge via lequel tout le trafic Nord-Sud\n    transite. Pour fournir de la bande passante supplémentaire pour un sous-ensemble de ce trafic, vous pouvez créer un ou plusieurs groupes de trafic, chacun\n    créant un routeur Edge supplémentaire, puis créer une liste de blocs CIDR que vous voulez router\n    via le nouveau routeur Edge. Reportez-vous à <a href=\"https://docs.vmware.com/fr/VMware-Cloud-on-AWS/services/context?id=vmc_037\"\n        target=\"_blank\"\n    >Ajouter des groupes de trafic pour augmenter la bande passante Edge</a> pour plus d'informations sur la création et la gestion de groupes de trafic.\n</p>\n",
    "what-languages" : "<!--\ntitle: Quelles langues sont prises en charge dans l'interface utilisateur de la console VMC ?\ncontext: [dashboard]\nfeature: uiEnableLocalization\n-->\n<p>La console VMware Cloud on AWS prend en charge l'anglais, le français, l'allemand, le japonais, le coréen, l'espagnol, le chinois simplifié\n    et le chinois traditionnel.</p>\n<p>Pour modifier la langue affichée par VMware Cloud sur AWS ou tout autre service VMware Cloud, définissez la \n    préférence de langue pour votre compte.</p>\n<ol class=\"list\">\n    <li>\n        Dans la console VMware Cloud Services, cliquez sur votre nom d'utilisateur et votre organisation dans la barre d'outils, puis sélectionnez <strong>Mon\n            Compte</strong>.\n    </li>\n    <li>\n        Cliquez sur <strong>Préférences</strong>.\n    </li>\n    <li>\n        Modifiez les paramètres <strong>Langue</strong> et <strong>Format régional</strong>.\n    </li>\n</ol>\n"
  }
}