{
  "component" : "vmw-k8s",
  "locale" : "en",
  "messages" : {
    "vmc-kubernetes-cloud-as-platform.architecture-img-1-alt" : "Tanzu overview",
    "vmc-kubernetes-cloud-as-platform.architecture-img-2-alt" : "Tanzu end to end flow",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-acquisition-desc" : "The acquisition of Bitnami and Pivotal super-charge the products and services we can bring to market through VMware Tanzu. VMware now has a far deeper connection to the developer community and can offer developers a complete modern application supply chain.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-packages-desc" : "Bitnami packages and delivers applications for Kubernetesâ??with incredible reach. Today, the Bitnami Community Catalog offers 180 applications and components that are installed more than 1 million times every month. We announced Project Galleon to bring Bitnami capabilities to the enterprise to offer customized application stacks to their end developers.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-pivotal-desc-3" : "Pivotal is a strong steward of one of the most popular application frameworks in the world (Spring) and offers customers a leading commercial application platform (Pivotal Application Service). Pivotal has fully embraced Kubernetesâ??they've been building Kubernetes native technologies for years and recently announced that PAS and its components â?? including Pivotal Build Service and Pivotal Function Serviceâ??are being evolved to run on Kubernetes. Collectively, Bitnami and Pivotal reach nearly 5 million developers. This is amplified by VMware's ISV ecosystem; VMware's partners are building applications and offering value-add services on Kubernetes and integrating with the VMware SDDC stack.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-title" : "1. Building Modern Applications",
    "vmc-kubernetes-cloud-as-platform.kubernetes-implementation-title" : "2. Run a Consistent Implementation of Kubernetes",
    "vmc-kubernetes-cloud-as-platform.kubernetes-title" : "Kubernetes",
    "vmc-kubernetes-cloud-as-platform.manage-environments-desc" : "As we make Kubernetes more available across environments and development teams begin to leverage the service to support their modern application development, your footprint will become more complicated to manage. We want to give our customers a way to operate Kubernetes consistently across clouds, clusters and teams to provide maximum operational efficiency matched with an enterprise toolkit. That's why we also introduced VMware Tanzu Mission Control as part of the VMware Tanzu portfolio.",
    "vmc-kubernetes-cloud-as-platform.manage-kubernetes-title" : "3. Manage your entire Kubernetes infra from a single point of control",
    "vmc-kubernetes-cloud-as-platform.manage-mission-desc" : "With VMware Tanzu Mission Control, customers will manage ALL their Kubernetes clustersâ??across vSphere, VMware PKS, public clouds, managed services, packaged distributions or even DIYâ??from a single point of control. They will provision new Kubernetes clusters in these environments from VMware Tanzu Mission Control and leverage a policy engine to establish guardrails. Specifically, operators will apply policies for access, quotas, back-up, security and more to individual clusters or groups of clusters. Meanwhile, developer teams will have access to workspaces in which they can freely consume resources and collaborate.",
    "vmc-kubernetes-cloud-as-platform.pacific-implementation-desc" : "Project Pacific is an effort to embed Kubernetes in vSphere. The integration of Kubernetes and vSphere is happening at the API and UI layers, but also the core virtualization layer as ESXi will run Kubernetes natively. Project Pacific will put Kubernetes capabilities at the fingertips of hundreds of thousands of vSphere customers and potentially millions of administrators. But importantly, it will also make our flagship vSphere product betterâ??uniting VMs and containers to offer a single application platform for the future. Operators will gain access to Kubernetes capabilities through a familiar set of tools and scripts, while developers will be able to access cloud resources using Kubernetes APIs.",
    "vmc-kubernetes-cloud-as-platform.pacific-link" : "Learn more about project pacific",
    "vmc-kubernetes-cloud-as-platform.pacific-video-link" : "Video: Introducing project pacific",
    "vmc-kubernetes-cloud-as-platform.project-pacific-img-alt-1" : "Tanzu modern applications framework",
    "vmc-kubernetes-cloud-as-platform.project-pacific-img-alt-2" : "Integration of Kubernetes and vSphere",
    "vmc-kubernetes-cloud-as-platform.tanzu" : "VMware Tanzu",
    "vmc-kubernetes-cloud-as-platform.tanzu-mission-control-img-alt" : "Tanzu Mission Control: operate Kubernetes consistently",
    "vmc-kubernetes-cloud-as-platform.tanzu-portfolio-desc" : "VMware Tanzu is our portfolio of products and services to transform the way the world builds software on Kubernetes.",
    "vmc-kubernetes-cloud-as-platform.tanzu-strategy-desc" : "As part of our strategy to help customers build modern applications, run Kubernetes consistently across environments and manage it all from a single point of control, we offer VMware Tanzu.",
    "vmc-kubernetes-cloud-as-platform.tanzu-title" : "{0} + {1} = {2}",
    "vmc-kubernetes-cloud-as-platform.tanzu-velocity-desc" : "Build applications with velocity, run open source Kubernetes with consistency, and manage your entire footprint with confidence.",
    "vmc-kubernetes-cloud-as-platform.title" : "VMware Cloud as a Platform for Kubernetes",
    "vmc-kubernetes-cloud-as-platform.vision-implementation-desc" : "Customers that are excited about this vision don't need to wait. Our current Kubernetes offering, VMware PKS is entirely aligned with VMware Tanzu, including Project Pacific. All of VMware's offerings build from a common core of open source Kubernetes with integrated lifecycle and cluster management. And, customers that want to run Kubernetes with consistency across clouds will choose VMware PKS. In short, customers starting down the Kubernetes path with VMware will want to take the first step now by buying and deploying VMware PKS.",
    "vmc-kubernetes-cloud-as-platform.vmware" : "VMware",
    "vmc-kubernetes-faqs.answer-1" : "Now, VMware Tanzu Kubernetes Grid Plus supports VMware Cloud on AWS. This enables customers to deploy their SDDC in the cloud, with the required components needed to architect and scale Kubernetes to fit their needs. VMware Tanzu Kubernetes Grid Plus is a certified Kubernetes runtime with secure access to open source technologies, including Kubernetes, cluster lifecycle management (Cluster API), and container image management (Harbor). With Tanzu Kubernetes Grid Plus running on VMware Cloud on AWS, customers can deploy, scale and manage Kubernetes clusters in the cloud. This establishes a reliable foundation for cloud-native application management and application modernization. Read the blog <a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\">here<clr-icon shape=\"pop-out\"></clr-icon>.</a>",
    "vmc-kubernetes-faqs.answer-10" : "Please contact your VMware representative to get more information about the pricing of TKG+ on VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-11" : "vSphere 7 with Kubernetes is available through VMware Cloud Foundation. It delivers the essential services that power Hybrid Infrastructure Services. The Hybrid Infrastructure services and Tanzu Kubernetes Grid Service are part of the VMware Cloud Foundation Services, available through VMware Cloud Foundation 4. Read more about it in this blog. vSphere 7 with Kubernetes will be available on VMware Cloud on AWS in the future. Customers who want to get started with Kubernetes and containers on VMware Cloud on AWS can get started with Tanzu Kubernetes Grid Plus. Customers are responsible for deploying and managing TKG+ clusters on VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-12" : "Customer can get support for Tanzu Kubernetes Grid Plus on VMware Cloud on AWS through the existing VMC support channels including chat support.",
    "vmc-kubernetes-faqs.answer-2" : "TKG+ includes the core binaries to install a TKG cluster on VMware Cloud on AWS plus Customer Reliability Engineering support & services to assist customers in successfully planning, deploying and maintaining their Kubernetes environment. You can find a detailed list of technologies & services supported in TKG+ in <a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\">KB 78173<clr-icon shape=\"pop-out\"></clr-icon></a>. Some relevant callouts are: <ul class=\"list\"><li>Patching of critical issues prior to upstream releases</li><li>vSAN Container Storage Interface (CSI)</li><li>Calico 2.6 and above</li><li>Contour for ingress</li><li>Harbor Container Registry</li><li>Velero for Cluster Backup</li><li>Prometheus, Grafana and Fluentbit for Observability</li></ul>",
    "vmc-kubernetes-faqs.answer-3" : "Customers are responsible for deploying and managing TKG+ clusters on VMware Cloud on AWS. The workflows for deploying and managing TKG+ infrastructure are the same as those for on-premises. VMware is responsible for the management of SDDC software components and the IaaS infrastructure.",
    "vmc-kubernetes-faqs.answer-4" : "No. Tanzu Kubernetes Grid Plus is a software that can be deployed by customers on the IaaS (Infrastructure-as-a-Service) provided by VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-5" : "Tanzu Kuberenets Grid Plus (TKG+) is just like any other workload on VMware Cloud on AWS that gets installed on VMs. The management cluster can be a single VM, the workload Kubernetes cluster will need at least a minimum 1 VM for master and 1 VM for worker node (i.e. in total 2 VMs).",
    "vmc-kubernetes-faqs.answer-6" : "TKG+ on VMware Cloud on AWS is supported across all regions where VMware Cloud on AWS is available today.",
    "vmc-kubernetes-faqs.answer-7" : "TKG+ is infrastructure agnostic and there is no dependency to have NSX-T on-premises if you want to deploy TKG+ clusters on VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-8" : "With TKG+ subscription, the supported operating systems for Kubernetes node include Photon OS and Amazon Linux OS. Support for additional operating systems is currently on the roadmap.",
    "vmc-kubernetes-faqs.answer-9" : "Existing Enterprise PKS or PKS Essentials do not entitle customers to run TKG+ on VMware Cloud on AWS. Customers will be required to purchase a TKG+ subscription license.",
    "vmc-kubernetes-faqs.question-1" : "What was announced with respect to VMware Cloud on AWS and VMware Tanzu Kubernetes Grid Plus?",
    "vmc-kubernetes-faqs.question-10" : "Where can I find more information about Pricing for TKG+ on VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-11" : "How does Tanzu Kubernetes Grid Pus support for VMware Cloud on AWS relate to vSphere with Kubernetes?",
    "vmc-kubernetes-faqs.question-12" : "How can customers get support for TKG+ on VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-2" : "What is included in TKG+?",
    "vmc-kubernetes-faqs.question-3" : "Who is responsible for deploying and managing TKG+ clusters on VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-4" : "Is Tanzu Kubernetes Grid Plus a part of VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-5" : "What is the minimum number of VMware Cloud on AWS hosts required for a TKG+ cluster?",
    "vmc-kubernetes-faqs.question-6" : "Which regions support TKG+ on VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-7" : "Do I need to have NSX-T deployed on premises to use TKG+ on VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-8" : "What are the supported Operating Systems for Kubernetes nodes?",
    "vmc-kubernetes-faqs.question-9" : "Can customers use existing Enterprise PKS or PKS Essentials licenses for TKG+ on VMware Cloud on AWS deployment?",
    "vmc-kubernetes-faqs.title" : "FAQs: Kubernetes",
    "vmc-kubernetes-journey.browser-title" : "Kubernetes Journey",
    "vmc-kubernetes-journey.deploy-and-validate" : "Deploy and Validate",
    "vmc-kubernetes-journey.deploy-and-validate-TKG" : "Deploy & Validate Tanzu Kubernetes Grid",
    "vmc-kubernetes-journey.deploy-and-validate-demo-app" : "Create Demo App.",
    "vmc-kubernetes-journey.deploy-and-validate-ssh-demo" : "SSH to TKG Demo Appliance.",
    "vmc-kubernetes-journey.deploy-and-validate-stage-desc" : "After setting up the prerequisites, follow the guide to deploy Tanzu Kubernetes Grid. The guide will show you how to create your demo app.",
    "vmc-kubernetes-journey.deploy-and-validate-tkg-demo" : "Deploy VMC TKG Demo OVA.",
    "vmc-kubernetes-journey.deploy-and-validate-workload-clusters" : "Deploy TKG Management & Workload Clusters.",
    "vmc-kubernetes-journey.learn" : "Learn",
    "vmc-kubernetes-journey.learn-kubernetes" : "Learn About Kubernetes",
    "vmc-kubernetes-journey.learn-stage-desc" : "With our learning resources, you'll learn more than you ever wanted to know about kubernetes \n                  and get the information you need to sell this to your application teams.\n            ",
    "vmc-kubernetes-journey.learn.kubernetes-academy" : "Learn from video tutorials at the VMware Kubernetes Academy.",
    "vmc-kubernetes-journey.learn.kubernetes-view-faq" : "View FAQs.",
    "vmc-kubernetes-journey.learn.what-kubernetes" : "What is Kubernetes?",
    "vmc-kubernetes-journey.learn.why-kubernetes" : "Why is VMware Cloud a good platform for Kubernetes?",
    "vmc-kubernetes-journey.pre-requisites" : "Setup Prerequisites",
    "vmc-kubernetes-journey.prerequisites-1-node" : "Existing SDDC or deploy new 1-Node SDDC.",
    "vmc-kubernetes-journey.prerequisites-configure" : "Configure Networking & vCenter.",
    "vmc-kubernetes-journey.prerequisites-demo-appliance" : "Desktop to access the SDDC and VMC TKG Demo Appliance with specific ports open.",
    "vmc-kubernetes-journey.prerequisites-dhcp" : "DHCP Enabled Network to run TKG Workloads.",
    "vmc-kubernetes-journey.prerequisites-review" : "Review Prerequisites.",
    "vmc-kubernetes-journey.prerequisites-stage-desc" : "To deploy Tanzu Kubernetes Grid (TKG), here are some prerequisites:",
    "vmc-kubernetes-journey.prerequisites-tkg-demo" : "Configure TKG Demo OVA.",
    "vmc-kubernetes-journey.prerequisites-view" : "View Guide.",
    "vmc-kubernetes-journey.stage" : "Stage ",
    "vmc-kubernetes-journey.title" : "Your Kubernetes Journey Starts Here!",
    "vmc-kubernetes-journey.view-guide-btn" : "View Guide",
    "vmc-kubernetes-journey.view-guide-top-btn" : "View Guide",
    "vmc-kubernetes-journey.view-resources-btn" : "View Resources",
    "vmc-kubernetes-overview.browser-title" : "Kubernetes Overview",
    "vmc-kubernetes-overview.capabilities-automated-desc" : "<strong>Automated multi-cluster operations:</strong> With declarative, multi-cluster lifecycle management, streamlined upgrades and patching and API and CLI tool for automated operations, Tanzu Kubernetes Grid Plus helps you more easily manage large-scale, multi-cluster Kubernetes deployments and automate manual tasks to reduce business risk and focus on more strategic work.",
    "vmc-kubernetes-overview.capabilities-installation-desc" : "<strong>Simplified Installation:</strong> Tanzu Kubernetes Grid Plus is engineered to include the tools and open source technologies needed to deploy and consistently operate a scalable Kubernetes environment wherever you need it to run- on vSphere, in your VMware Managed Cloud in the public cloud, or at the edge",
    "vmc-kubernetes-overview.capabilities-title" : "Key Capabilities",
    "vmc-kubernetes-overview.challenges-growth-desc" : "<strong>Customers want to reduce operational burden</strong> Customers want to reduce operational burden while deploying and managing a growing number of Kubernetes clusters.",
    "vmc-kubernetes-overview.challenges-lifecycle-desc" : "<strong>Customers want to focus on applications and innovation</strong>, vs. low value infrastructure lifecycle management.",
    "vmc-kubernetes-overview.challenges-operations-desc" : "<strong>Customers need consistent infrastructure</strong> and operations in order to deploy, run and manage Kubernetes clusters across on-premises and cloud environments.",
    "vmc-kubernetes-overview.challenges-order-desc" : "In order to develop modern applications <strong>customer needs scalable infrastructure</strong> in the cloud that caters to changing business needs and optimizes infrastructure cost.",
    "vmc-kubernetes-overview.challenges-title" : "Challenges",
    "vmc-kubernetes-overview.description" : "With Tanzu Kubernetes Grid Plus, you can enable your developers to build, run and manage the next generation of apps using containers orchestrated by Kubernetes.",
    "vmc-kubernetes-overview.enterprise-support-desc" : "<strong>Enterprise Grade Support:</strong> Customers deploying Tanzu Kubernetes Grid Plus on VMware Cloud on AWS can benefit from 24x7 break-fix support for Kubernetes and key open source ecosystem technologies. Additionally, customers that intend to transform the way they build applications can engage VMware Pivotal Labs to drive agile development methods into their organization and shorten the path to production.",
    "vmc-kubernetes-overview.get-started-btn" : "Get Started",
    "vmc-kubernetes-overview.infrastructure-label" : "Supported Infrastructure:",
    "vmc-kubernetes-overview.integrated-services-desc" : "<strong>Integrated platform services:</strong> Tanzu Kubernetes Grid Plus streamlines the deployment of local and in-cluster services to simplify the configuration of container image registry policies, monitoring, logging, ingress, networking and storage, and ready your Kubernetes environment for production workloads.",
    "vmc-kubernetes-overview.open-source-desc" : "<strong>Open source alignment:</strong> Tanzu Kubernetes Grid Plus helps you run your containerized applications on an upstream-aligned Kubernetes distribution and key open source technologies like Cluster API, Fluentbit, and Contour, so that you can enable portability and benefit from the support and innovation of the global Kubernetes community. Also it provides you a break-fix and proactive support for your open source ecosystem with Customer Reliability Engineering.",
    "vmc-kubernetes-overview.solution-containerized-desc" : "With Tanzu Kubernetes Grid Plus deployed on VMware Cloud on AWS, you can take advantage of elastically scalable infrastructure in the cloud for containerized workloads and quickly create and scale Kubernetes clusters as per your needs.",
    "vmc-kubernetes-overview.solution-establishes-desc" : "This establishes a flexible and reliable foundation for application modernization. Built on Kubernetes, you get true application portability, so applications are never locked into a vendor-specific distribution.",
    "vmc-kubernetes-overview.solution-overview-img-alt" : "Solution Architecture Diagram",
    "vmc-kubernetes-overview.solution-release-desc" : "With the release of a new Kubernetes version, VMware work with the open-source community to test and harden it upstream. Once the stable upstream binaries are published, VMware will sign the binaries for security purposes and make it available for download. Building and managing VMware TKG has never been easier knowing it has been developed by Kubernetes professionals.",
    "vmc-kubernetes-overview.solution-tanzu-grid-desc" : "VMware Tanzu Kubernetes Grid Plus on VMware Cloud on AWS enables you to deploy your SDDC in the cloud, with all the required components needed to architect and scale Kubernetes to fit your needs. VMware Cloud on AWS delivers a seamlessly integrated hybrid cloud solution that extends on-premises vSphere environments to a VMware SDDC running on Amazon Elastic Compute Cloud (Amazon EC2), a bare-metal infrastructure that is fully integrated as part of AWS.",
    "vmc-kubernetes-overview.solution-title" : "Solution Description",
    "vmc-kubernetes-overview.supported-infrastructure" : "VMware Cloud on AWS",
    "vmc-kubernetes-overview.tanzu-grid-development-desc" : "Application development has an evolutionary cycle of requiring different dependencies on the infrastructure. Modern applications require new platforms that embrace declarative use but also embody transient qualities. The underlying infrastructure must adapt to these new trends to accommodate modern workloads.",
    "vmc-kubernetes-overview.tanzu-grid-modernization-desc" : "In line with this modernization initiative, IT organizations have seen increasing need to support container-based applications. The rate of change in the container space leapfrogs itself over every calendar quarter. Traditional IT organizations that need to manage all types of infrastructure and applications simply don't have the time to keep up. The pace at which container technology matures requires an infrastructure that is elastically scalable as per the business needs and that runs on latest and greatest software that helps accelerate innovation.",
    "vmc-kubernetes-overview.tanzu-grid-order-desc" : "In order to help customers in this regard, we are bringing VMware Tanzu Kubernetes Grid Plus (TKG), VMware's supported Kubernetes runtime, on VMware Cloud on AWS. Organizations that want to start running containers and Kubernetes on VMware Cloud on AWS can get started today with VMware Tanzu Kubernetes Grid Plus. Designed to align with the Kubernetes community to ensure consistency across environments, Tanzu Kubernetes Grid Plus provides secure access to the critical open source technologies including Kubernetes, cluster lifecycle management (Cluster API) and a container image registry (Harbor).",
    "vmc-kubernetes-overview.tanzu-grid-progress-desc" : "As organizations progress toward building and deploying cloud native applications, there needs to be consistent and reliable technology that simplifies and removes a lot of the underlying guess work.",
    "vmc-kubernetes-overview.tanzu-grid-simplified-desc" : "With VMware Tanzu Kubernetes Grid Plus support, customers have a simplified path to running Kubernetes on VMware Cloud on AWS. This solution offers infrastructure standardization, convenience, and reliability to address the challenges of deploying and managing applications tailored for Kubernetes. With VMware TKG on VMware Cloud on AWS, it combines the enterprise capabilities of the VMware Software Defined Data Center (SDDC), including compute, storage, and networking, delivered as a service on AWS, with the market-leading capabilities of VMware TKG for a simple, secure and consistent container deployment.",
    "vmc-kubernetes-overview.tanzu-grid-title" : "VMware Tanzu Kubernetes Grid Plus on VMware Cloud on AWS",
    "vmc-kubernetes-overview.technical-overview" : "Technical Overview",
    "vmc-kubernetes-overview.technical-overview-apps-desc" : "It provides a fast path for developers to deploy modern apps, while offering a consistent Kubernetes experience for operators across enterprise environments, including vSphere on-premises, in the public cloud, and at the edge. It expands container-based applications running on Kubernetes to be available across failure domains.",
    "vmc-kubernetes-overview.technical-overview-grid-desc" : "VMware Tanzu Kubernetes Grid Plus runs on VMware SDDC that runs on dedicated Amazon EC2 elastic, baremetal infrastructure. VMware Tanzu Kubernetes Grid Plus is an enterprise ready Kubernetes runtime that packages open source technologies and automation tooling to help you get up and running quickly with a scalable, multi-cluster Kubernetes environment. When deployed on VMware Cloud on AWS, it provides elastically scalable infrastructure for containerized workloads and helps create and scale Kubernetes clusters as per your needs.",
    "vmc-kubernetes-overview.title" : "Kubernetes",
    "vmc-kubernetes-overview.video-btn" : "Play Video",
    "vmc-kubernetes-overview.video-poster-img-alt-txt" : "Tanzu Kubernetes Grid Plus on VMware Cloud on AWS",
    "vmc-kubernetes-resources.browser-title" : "Kubernetes Resources",
    "vmc-kubernetes-resources.cloud-as-platform" : "VMware Cloud as a Platform",
    "vmc-kubernetes-resources.faqs" : "FAQs",
    "vmc-kubernetes-resources.videos-and-docs" : "Videos & Documents",
    "vmc-kubernetes-resources.what-is-kubernetes" : "What is Kubernetes?",
    "vmc-kubernetes-videos-and-docs.click-here-1" : "Click to watch TGIKubernetes weekly live series on YouTube",
    "vmc-kubernetes-videos-and-docs.click-here-2" : "Click here to read this ebook",
    "vmc-kubernetes-videos-and-docs.desc" : "To learn more about Kubernetes, see below for a set of curated assets including white papers, technical videos and more. Additional resources are available<a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\"> here <clr-icon shape=\"pop-out\"></clr-icon></a>",
    "vmc-kubernetes-videos-and-docs.docs-title" : "Documents",
    "vmc-kubernetes-videos-and-docs.kube-academy-click-here" : "Click to go to VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-btn" : "Go to kube academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-desc" : "Short on time but eager to learn about containers and Kubernetes? Learn from leading experts on Kube Academy. Kube Academy courses are composed of a series of bite-size video lessons developed by expert instructors. These courses will help you understand new Kubernetes concepts for free no strings attached.",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-img-alt" : "VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-title" : "VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.managing-book-btn" : "Read the ebook",
    "vmc-kubernetes-videos-and-docs.managing-book-desc" : "There's Kubernetes theory and then there's Kubernetes practice. This e-book is the latter â?? written by Brendan Burns (one of three original Kubernetes creators) and Craig Tracey (VMware Staff Kubernetes Architect).",
    "vmc-kubernetes-videos-and-docs.managing-book-img-alt" : "Managing Kubernetes",
    "vmc-kubernetes-videos-and-docs.managing-book-title" : "Managing Kubernetes",
    "vmc-kubernetes-videos-and-docs.pdf-click-here" : "Click here to read this ebook",
    "vmc-kubernetes-videos-and-docs.title" : "Videos & Documents: Kubernetes",
    "vmc-kubernetes-videos-and-docs.tutorials-desc" : "Every week, TGIKubernetes is a YouTube live-streamed dive into new Kubernetes tools and concepts. Join every week at 1pm PST to follow along and learn. In addition, with VMware Kubernetes Academy, you can learn from from a series of bit-size video tutorials created by leading instructors at VMware.",
    "vmc-kubernetes-videos-and-docs.tutorials-title" : "Tutorials & Weekly Live Series",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-btn" : "Read the ebook",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-desc" : "Get a practical look at how Kubernetes and container technology can help you achieve new levels of velocity, agility, reliability, and efficiency.",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-title" : "Kubernetes: Up and Running",
    "vmc-kubernetes-videos-and-docs.up-and-running-img-alt" : "Kubernetes Up & Running",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-btn" : "Watch on youtube",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-desc" : "Come hang out with Joe Beda as he does a bit of hands on exploration of Kubernetes and related topics.  Some of this will be Joe talking about the things he knows well.  Some of this will be Joe exploring something new with the audience. Ask questions, comment and help decide where things go.",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-img-alt" : "TGIKubernetes Weekly Live Series on YouTube",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-title" : "YouTube Weekly Live Series: TGIKubernetes",
    "vmc-kubernetes-what-is-kubernetes.advantages-title" : "3. Kubernetes Advantages",
    "vmc-kubernetes-what-is-kubernetes.applications" : "Kubernetes scales up web servers according to the demand for the software applications, then degrades web server instances during down-times.",
    "vmc-kubernetes-what-is-kubernetes.architecture-desc" : "Kubernetes evolved from the code that Google used to manage its data centers at scale with the â??Borgâ?? platform. AWS introduced elastic web server frameworks to the public with the launch of the EC2 platform. Kubernetes allows companies to orchestrate containers like EC2 but using open source code. Google, AWS, Azure, and the other major public cloud hosts all offer Kubernetes support for cloud web server orchestration. Customers can use Kubernetes for complete data center outsourcing, web/mobile applications, SaaS support, cloud web hosting, or high-performance computing.",
    "vmc-kubernetes-what-is-kubernetes.architecture-title" : "2. Kubernetes Architecture",
    "vmc-kubernetes-what-is-kubernetes.automate" : "Kubernetes features the ability to automate web server provisioning according to the level of web traffic in production.",
    "vmc-kubernetes-what-is-kubernetes.automated" : "The main advantage of Kubernetes is the ability to operate an automated, elastic web server platform in production without the vendor lock-in to AWS with the EC2 service.",
    "vmc-kubernetes-what-is-kubernetes.capabilities" : "Kubernetes also has advanced load balancing capabilities for web traffic routing to web servers in operations.",
    "vmc-kubernetes-what-is-kubernetes.desc" : "Kubernetes is an open-source container orchestration platform that enables the operation of an elastic web server framework for cloud applications. Kubernetes can support data center outsourcing to public cloud service providers or can be used for web hosting at scale. Website and mobile applications with complex custom code can deploy using Kubernetes on commodity hardware to lower the costs on web server provisioning with public cloud hosts and to optimize software development processes.",
    "vmc-kubernetes-what-is-kubernetes.docker-desc" : "Kubernetes is an open-source container orchestration platform. Docker is the main container virtualization standard used with Kubernetes. Other elastic web server orchestration systems are Docker Swarm, CoreOS Tectonic, and Mesosphere. Intel also has a competing container standard with Kata, and there are several Linux container versions. Docker has the largest share of the container virtualization marketplace for software products. Docker is a software development company that specializes in container virtualization, whereas Kubernetes is an open-source project supported by a community of coders that includes professional programmers from all of the major IT companies.",
    "vmc-kubernetes-what-is-kubernetes.docker-title" : "5. Kubernetes vs. Docker",
    "vmc-kubernetes-what-is-kubernetes.features-img-alt" : "Paper - Kubernetes for Executives",
    "vmc-kubernetes-what-is-kubernetes.features-title" : "1. Kubernetes Features",
    "vmc-kubernetes-what-is-kubernetes.features-tooltip" : "Click to read paper on Kubernetes for Executives",
    "vmc-kubernetes-what-is-kubernetes.orchestration-desc" : "Container orchestration is the management of individual web servers operating in containers through virtual partitions on data center hardware. Container orchestration is a means of maintaining the elastic framework for web servers in a data center on an automated basis in production. Administrators can establish resources that can be automatically started if web traffic increases over the capacity of a single server. For SaaS applications, this can scale to support millions of simultaneous users.",
    "vmc-kubernetes-what-is-kubernetes.orchestration-title" : "4. Kubernetes Container Orchestration",
    "vmc-kubernetes-what-is-kubernetes.scalability" : "Kubernetes allows any company to operate its software code at the same level of scalability as the largest companies in the world on competitive data center pricing for hardware resources.",
    "vmc-kubernetes-what-is-kubernetes.server" : "Web server hardware can be located in different data centers, on different hardware, or through different hosting providers.",
    "vmc-kubernetes-what-is-kubernetes.services" : "Kubernetes runs on most public cloud hosting services and all of the major companies offer competitive pricing. Kubernetes enables the complete outsourcing of a corporate data center.",
    "vmc-kubernetes-what-is-kubernetes.title" : "What is Kubernetes?",
    "vmc-kubernetes-what-is-kubernetes.video-poster-img-alt-txt" : "Kubernetes in 5 minutes",
    "vmc-kubernetes-what-is-kubernetes.web-traffic" : "Kubernetes can also be used to scale web and mobile applications in production to the highest levels of web traffic."
  }
}