{
  "component" : "vmw-k8s",
  "locale" : "de",
  "messages" : {
    "vmc-kubernetes-cloud-as-platform.architecture-img-1-alt" : "Übersicht über Tanzu",
    "vmc-kubernetes-cloud-as-platform.architecture-img-2-alt" : "End-to-End-Flow mit Tanzu",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-acquisition-desc" : "Die Übernahme von Bitnami und Pivotal potenzieren die Produkte und Dienste, die wir durch VMware Tanzu auf den Markt bringen können. VMware verfügt nun über eine ungleich intensivere Verbindung mit der Entwickler-Community und kann Entwicklern eine vollständige Lieferkette moderner Anwendungen anbieten.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-packages-desc" : "Bitnami stellt Anwendungspakete für Kubernetes bereit – und dies mit einer unglaublichen Reichweite. Gegenwärtig werden im Bitnami Community Catalog 180 Anwendungen und Komponenten angeboten, die jeden Monat mehr als eine Million Mal installiert werden. Wir haben Project Galleon angekündigt, um Unternehmen Bitnami-Funktionen bereitstellen zu können, damit diese ihren Endentwicklern angepasste Anwendungsstapel anbieten können.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-pivotal-desc-3" : "Pivotal ist wichtiger Wegbereiter eines der beliebtesten Anwendungs-Frameworks der Welt (Spring) und bietet Kunden eine marktführende kommerzielle Anwendungsplattform an (Pivotal Application Service – PAS). Pivotal hat ganz auf Kubernetes gesetzt. Das Unternehmen hat über Jahre hinweg am Aufbau einer nativen Kubernetes-Technologie gearbeitet und hat kürzlich angekündigt, dass PAS und die zugehörigen Komponenten, einschließlich Pivotal Build Service und Pivotal Function Service dahingehend entwickelt werden, dass sie auf Kubernetes ausgeführt werden können. Gemeinsam erreichen Bitnami und Pivotal nahezu 5 Millionen Entwickler. Diese Zahl wird durch das ISV-Ökosystem von VMware weiter vergrößert. Partner von VMware erstellen Anwendungen, bieten auf Kubernetes Dienste mit Mehrwert an und sorgen für die Integration in den VMware-SDDC-Stack.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-title" : "1. Erstellen moderner Anwendungen",
    "vmc-kubernetes-cloud-as-platform.kubernetes-implementation-title" : "2. Ausführen einer konsistenten Implementierung von Kubernetes",
    "vmc-kubernetes-cloud-as-platform.kubernetes-title" : "Kubernetes",
    "vmc-kubernetes-cloud-as-platform.manage-environments-desc" : "Vor dem Hintergrund, dass wir die Verfügbarkeit von Kubernetes in verschiedenen Umgebungen erhöhen und Entwicklerteams damit beginnen, den Dienst zur Unterstützung ihrer Entwicklung moderner Anwendungen zu nutzen, nimmt die Komplexität der Verwaltung Ihres Systems zu. Wir möchten unseren Kunden eine Methode zur Verfügung stellen, mit der sie Kubernetes konsistent über Clouds, Cluster und Teams hinweg betreiben können, um ihnen eine maximale Betriebseffizienz und ein dazu passendes Toolkit für Unternehmen bereitzustellen. Aus diesem Grund haben wir auch VMware Tanzu Mission Control als Bestandteil des VMware Tanzu-Portfolios eingeführt.",
    "vmc-kubernetes-cloud-as-platform.manage-kubernetes-title" : "3. Verwalten Ihrer gesamten Kubernetes-Infrastruktur über eine zentrale Oberfläche",
    "vmc-kubernetes-cloud-as-platform.manage-mission-desc" : "Mit VMware Tanzu Mission Control verwalten Kunden ALLE ihre Kubernetes-Cluster, sei es in vSphere, VMware PKS, Public Clouds, verwalteten Diensten, Paketverteilungen oder DIY, über eine zentrale Oberfläche. Sie stellen über VMware Tanzu Mission Control neue Kubernetes-Cluster in diesen Umgebungen bereit und nutzen eine Richtlinien-Engine zum Festlegen von Leitlinien. Konkret wenden Operatoren Richtlinien für den Zugriff, Kontingente, Sicherung, Sicherheit usw. für einzelne Cluster oder Clustergruppen an, während Entwicklerteams Zugriff auf Arbeitsumgebungen haben, in denen sie ganz frei Ressourcen nutzen und zusammenarbeiten können.",
    "vmc-kubernetes-cloud-as-platform.pacific-implementation-desc" : "Project Pacific ist ein Projekt zum Einbetten von Kubernetes in vSphere. Die Integration von Kubernetes und vSphere findet auf der API- und der UI-Ebene statt, aber auch auf der Hauptebene für die Virtualisierung, wobei ESXi Kubernetes nativ ausführt. Project Pacific macht Kubernetes-Funktionen für Hunderttausende von vSphere-Kunden und Millionen von Administratoren verfügbar. Aber das Wichtigste ist, dass es unser vSphere-Vorzeigeprodukt weiter verbessert, indem es VMs und Container innerhalb einer einzigen Anwendungsplattform für die Zukunft vereinigt. Operatoren erhalten über vertraute Tools Zugriff auf Kubernetes-Funktionen, während Entwickler mithilfe von Kubernetes-APIs auf Cloudressourcen zugreifen können.",
    "vmc-kubernetes-cloud-as-platform.pacific-link" : "Weitere Informationen zu Project Pacific",
    "vmc-kubernetes-cloud-as-platform.pacific-video-link" : "Video: Einführung in Project Pacific",
    "vmc-kubernetes-cloud-as-platform.project-pacific-img-alt-1" : "Tanzu-Framework für moderne Anwendungen",
    "vmc-kubernetes-cloud-as-platform.project-pacific-img-alt-2" : "Integration von Kubernetes und vSphere",
    "vmc-kubernetes-cloud-as-platform.tanzu" : "VMware Tanzu",
    "vmc-kubernetes-cloud-as-platform.tanzu-mission-control-img-alt" : "Tanzu Mission Control: Konsistenter Betrieb von Kubernetes",
    "vmc-kubernetes-cloud-as-platform.tanzu-portfolio-desc" : "VMware Tanzu ist unser Produkt- und Dienstportfolio für eine ganz neue Art und Weise der Erstellung von Software auf Kubernetes.",
    "vmc-kubernetes-cloud-as-platform.tanzu-strategy-desc" : "Im Rahmen unserer Strategie, Kunden bei der Erstellung moderner Anwendungen, der konsistenten Ausführung von Kubernetes über verschiedene Umgebungen hinweg und der Verwaltung all dieser Funktionen über eine zentrale Oberfläche zu unterstützen, bieten wir VMware Tanzu an.",
    "vmc-kubernetes-cloud-as-platform.tanzu-title" : "{0} + {1} = {2}",
    "vmc-kubernetes-cloud-as-platform.tanzu-velocity-desc" : "Erstellen Sie Anwendungen schnell, führen Sie Open Source-Kubernetes mit Konsistenz aus und verwalten Sie Ihre Lösung mit einem sicheren Gefühl.",
    "vmc-kubernetes-cloud-as-platform.title" : "VMware Cloud als Plattform für Kubernetes",
    "vmc-kubernetes-cloud-as-platform.vision-implementation-desc" : "Von dieser Vision begeisterte Kunden brauchen nicht zu warten: Unser aktuelles Kubernetes-Angebot, VMware PKS, ist vollkommen kompatibel mit VMware Tanzu, einschließlich Project Pacific. Alle Angebote von VMware beruhen auf einem gemeinsamen Kern von Open Source-Kubernetes mit integrierter Lebenszyklus- und Clusterverwaltung. Und Kunden, die Kubernetes konsistent über verschiedene Clouds hinweg ausführen möchten, entscheiden sich für VMware PKS. Kurz gesagt, Kunden, die gemeinsam mit VMware den Weg zu Kubernetes einschlagen, unternehmen jetzt den ersten Schritt, indem sie VMware PKS erwerben und bereitstellen.",
    "vmc-kubernetes-cloud-as-platform.vmware" : "VMware",
    "vmc-kubernetes-faqs.answer-1" : "VMware Tanzu Kubernetes Grid Plus unterstützt jetzt VMware Cloud on AWS. Dies ermöglicht es Kunden, ihr SDDC mit den erforderlichen Komponenten zum Entwerfen und Skalieren von Kubernetes entsprechend ihren Anforderungen in der Cloud bereitzustellen. VMware Tanzu Kubernetes Grid Plus ist eine zertifizierte Kubernetes-Laufzeit mit sicherem Zugriff auf Open Source-Technologien, einschließlich Kubernetes, Cluster-Lebenszyklusverwaltung (Cluster-API) und Container-Image-Verwaltung (Harbor). Wenn Tanzu Kubernetes Grid Plus auf VMware Cloud on AWS ausgeführt wird, können Kunden Kubernetes-Cluster in der Cloud bereitstellen, skalieren und verwalten. Dies bildet eine verlässliche Grundlage für die Verwaltung und Modernisierung nativer Cloudanwendungen. Weitere Informationen finden Sie im Blog <a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\">hier<clr-icon shape=\"pop-out\"></clr-icon></a>.",
    "vmc-kubernetes-faqs.answer-10" : "Wenden Sie sich an Ihren Ansprechpartner bei VMware, um weitere Informationen zur Preisgestaltung für TKG+ auf VMware Cloud on AWS zu erhalten.",
    "vmc-kubernetes-faqs.answer-11" : "vSphere 7 with Kubernetes ist über VMware Cloud Foundation verfügbar. Es stellt die wesentlichen Dienste bereit, die die Hybrid Infrastructure-Dienste unterstützen. Die Hybrid Infrastructure-Dienste und der Tanzu Kubernetes Grid-Dienst sind Bestandteil der VMware Cloud Foundation-Dienste, die über VMware Cloud Foundation 4 verfügbar sind. Weitere Informationen hierzu finden Sie in diesem Blog. vSphere 7 with Kubernetes wird in Zukunft auch in VMware Cloud on AWS verfügbar sein. Kunden, die mit der Verwendung von Kubernetes und Containern in VMware Cloud on AWS beginnen möchten, können dies mit Tanzu Kubernetes Grid Plus tun. Die Kunden sind verantwortlich für die Bereitstellung und Verwaltung von TKG+-Clustern auf VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-12" : "Support für Tanzu Kubernetes Grid Plus auf VMware Cloud on AWS kann der Kunde über die bestehenden VMC-Supportkanäle erhalten, darunter auch den Support per Chat.",
    "vmc-kubernetes-faqs.answer-2" : "TKG+ umfasst die Hauptbinärdateien zum Installieren eines TKG-Clusters auf VMware Cloud on AWS sowie Customer Reliability Engineering-Support und -Dienste zur Unterstützung von Kunden bei der erfolgreichen Planung, Bereitstellung und Wartung ihrer Kubernetes-Umgebung. Eine detaillierte Liste der in TKG+ unterstützten Technologien und Dienste finden Sie unter <a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\">KB 78173<clr-icon shape=\"pop-out\"></clr-icon></a>. Im Folgenden werden die wichtigsten davon aufgeführt: <ul class=\"list\"><li>Patches für wichtige Probleme vor Upstream-Freigaben</li><li>vSAN Container Storage Interface (CSI)</li><li>Calico 2.6 und höher</li><li>Contour für eingehenden Datenverkehr</li><li>Registrierung von Containern im Hafen</li><li>Velero für Clustersicherung</li><li>Prometheus, Grafana und FluentBit für Beobachtbarkeit</li></ul>",
    "vmc-kubernetes-faqs.answer-3" : "Kunden sind für die Bereitstellung und Verwaltung von TKG+-Clustern auf VMware Cloud on AWS verantwortlich. Die Workflows für die Bereitstellung und Verwaltung der TKG+-Infrastruktur sind dieselben wie diejenigen für lokale Infrastrukturen. VMware ist verantwortlich für die Verwaltung von SDDC-Softwarekomponenten und der IaaS-Infrastruktur.",
    "vmc-kubernetes-faqs.answer-4" : "Nein. Tanzu Kubernetes Grid Plus ist eine Software, die von Kunden in der von VMware Cloud on AWS bereitgestellten IaaS-Infrastruktur (Infrastructure-as-a-Service) bereitgestellt werden kann.",
    "vmc-kubernetes-faqs.answer-5" : "Tanzu Kubernetes Grid Plus (TKG+) verhält sich wie jede andere Arbeitslast auf VMware Cloud on AWS, die auf VMs installiert wird. Der Verwaltungscluster kann eine einzelne VM sein, der Kubernetes-Cluster für die Arbeitslast erfordert mindestens eine VM für den Master-Knoten und eine VM für den Worker-Knoten (d. h. insgesamt zwei VMs).",
    "vmc-kubernetes-faqs.answer-6" : "TKG+ auf VMware Cloud on AWS wird in allen Regionen unterstützt, in denen VMware Cloud on AWS derzeit verfügbar ist.",
    "vmc-kubernetes-faqs.answer-7" : "TKG+ ist unabhängig von der Infrastruktur, und es besteht keine Abhängigkeit, die lokal installiertes NSX-T erforderlich macht, wenn Sie TKG+-Cluster auf VMware Cloud on AWS bereitstellen möchten.",
    "vmc-kubernetes-faqs.answer-8" : "Mit dem TKG+-Abonnement umfassen die unterstützten Betriebssysteme für den Kubernetes-Knoten Photon OS und Amazon Linux OS. Unterstützung für zusätzliche Betriebssysteme ist derzeit in Planung.",
    "vmc-kubernetes-faqs.answer-9" : "Bestehende Enterprise PKS- oder PKS Essentials-Lizenzen berechtigen Kunden nicht zur Ausführung von TKG+ auf VMware Cloud on AWS. Es muss eine TKG+-Abonnementlizenz erworben werden.",
    "vmc-kubernetes-faqs.question-1" : "Was wurde in Bezug auf VMware Cloud on AWS und VMware Tanzu Kubernetes Grid Plus angekündigt?",
    "vmc-kubernetes-faqs.question-10" : "Wo finde ich weitere Informationen zur Preisgestaltung für TKG+ auf VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-11" : "Welcher Zusammenhang besteht zwischen Tanzu Kubernetes Grid Plus-Support für VMware Cloud on AWS und vSphere with Kubernetes?",
    "vmc-kubernetes-faqs.question-12" : "Wie können Kunden Support für TKG+ auf VMware Cloud on AWS erhalten?",
    "vmc-kubernetes-faqs.question-2" : "Was ist in TKG+ enthalten?",
    "vmc-kubernetes-faqs.question-3" : "Wer ist verantwortlich für die Bereitstellung und Verwaltung von TKG+-Clustern auf VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-4" : "Ist Tanzu Kubernetes Grid Plus Bestandteil von VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-5" : "Welche Anzahl an VMware Cloud on AWS-Hosts wird mindestens für einen TKG+-Cluster benötigt?",
    "vmc-kubernetes-faqs.question-6" : "In welchen Regionen wird TKG+ auf VMware Cloud on AWS unterstützt?",
    "vmc-kubernetes-faqs.question-7" : "Muss ich NSX-T lokal bereitgestellt haben, um TKG+ auf VMware Cloud on AWS verwenden zu können?",
    "vmc-kubernetes-faqs.question-8" : "Welche Betriebssysteme werden für Kubernetes-Knoten unterstützt?",
    "vmc-kubernetes-faqs.question-9" : "Können Kunden bestehende Enterprise PKS- oder PKS Essentials-Lizenzen für eine Bereitstellung von TKG+ auf VMware Cloud on AWS verwenden?",
    "vmc-kubernetes-faqs.title" : "FAQs: Kubernetes",
    "vmc-kubernetes-journey.browser-title" : "Kubernetes – Ablauf",
    "vmc-kubernetes-journey.deploy-and-validate" : "Bereitstellen und validieren",
    "vmc-kubernetes-journey.deploy-and-validate-TKG" : "Bereitstellen und Validieren von Tanzu Kubernetes Grid",
    "vmc-kubernetes-journey.deploy-and-validate-demo-app" : "Erstellen Sie eine Demo-App.",
    "vmc-kubernetes-journey.deploy-and-validate-ssh-demo" : "SSH zur TKG-Demo-Appliance.",
    "vmc-kubernetes-journey.deploy-and-validate-stage-desc" : "Befolgen Sie nach dem Einrichten der Voraussetzungen den Leitfaden zum Bereitstellung von Tanzu Kubernetes Grid. In diesem Leitfaden wird gezeigt, wie Sie Ihre Demo-App erstellen.",
    "vmc-kubernetes-journey.deploy-and-validate-tkg-demo" : "Stellen Sie die VMC TKG-Demo-OVA bereit.",
    "vmc-kubernetes-journey.deploy-and-validate-workload-clusters" : "Stellen Sie TKG-Verwaltungs- und -Arbeitslastcluster bereit.",
    "vmc-kubernetes-journey.learn" : "Lernen",
    "vmc-kubernetes-journey.learn-kubernetes" : "Weitere Informationen zu Kubernetes",
    "vmc-kubernetes-journey.learn-stage-desc" : "Mit unseren Lernressourcen werden Ihre Fragen zu Kubernetes mehr als beantwortet, \n                  und mit den Informationen können Sie die Anwendungsteams von dieser Lösung überzeugen.\n            ",
    "vmc-kubernetes-journey.learn.kubernetes-academy" : "Erfahren Sie mehr anhand von Videolernprogrammen bei der VMware Kubernetes Academy.",
    "vmc-kubernetes-journey.learn.kubernetes-view-faq" : "Zeigen Sie FAQs an.",
    "vmc-kubernetes-journey.learn.what-kubernetes" : "Was ist Kubernetes?",
    "vmc-kubernetes-journey.learn.why-kubernetes" : "Warum ist VMware Cloud eine gute Plattform für Kubernetes?",
    "vmc-kubernetes-journey.pre-requisites" : "Setupvoraussetzungen",
    "vmc-kubernetes-journey.prerequisites-1-node" : "Vorhandenes SDDC oder Bereitstellung eines neuen 1-Knoten-SDDC.",
    "vmc-kubernetes-journey.prerequisites-configure" : "Konfigurieren Sie das Netzwerk und vCenter.",
    "vmc-kubernetes-journey.prerequisites-demo-appliance" : "Desktop für den Zugriff auf das SDDC und die VMC TKG-Demo-Appliance, wobei bestimmte Ports geöffnet sind.",
    "vmc-kubernetes-journey.prerequisites-dhcp" : "DHCP-aktiviertes Netzwerk zum Ausführen von TKG-Arbeitslasten.",
    "vmc-kubernetes-journey.prerequisites-review" : "Überprüfen Sie die Voraussetzungen.",
    "vmc-kubernetes-journey.prerequisites-stage-desc" : "Nachstehend sind einige Voraussetzungen für das Bereitstellen von Tanzu Kubernetes Grid (TKG) aufgeführt:",
    "vmc-kubernetes-journey.prerequisites-tkg-demo" : "Konfigurieren Sie die TKG-Demo-OVA.",
    "vmc-kubernetes-journey.prerequisites-view" : "Zeigen Sie den Leitfaden an.",
    "vmc-kubernetes-journey.stage" : "Bereitstellen ",
    "vmc-kubernetes-journey.title" : "Ihr Weg zu Kubernetes beginnt hier",
    "vmc-kubernetes-journey.view-guide-btn" : "Leitfaden anzeigen",
    "vmc-kubernetes-journey.view-guide-top-btn" : "Leitfaden anzeigen",
    "vmc-kubernetes-journey.view-resources-btn" : "Ressourcen anzeigen",
    "vmc-kubernetes-overview.browser-title" : "Übersicht über Kubernetes",
    "vmc-kubernetes-overview.capabilities-automated-desc" : "<strong>Automatisierte Multi-Cluster-Vorgänge:</strong> Mit einer deklarativen Multi-Cluster-Lebenszyklusverwaltung, optimierten Upgrades und Patches und einem API- und CLI-Tool für automatisierte Vorgänge macht es Tanzu Kubernetes Grid Plus leichter, große Kubernetes-Bereitstellungen mit mehreren Clustern zu verwalten und manuelle Aufgaben zu automatisieren. Dies trägt zur Verringerung von Geschäftsrisiken bei und ermöglicht eine stärkere Konzentration auf die strategische Arbeit.",
    "vmc-kubernetes-overview.capabilities-installation-desc" : "<strong>Vereinfachte Installation:</strong> Tanzu Kubernetes Grid Plus wurde so entwickelt, dass es die Tools und Open Source-Technologien umfasst, die zum Bereitstellen und konsistenten Betreiben einer skalierbaren Kubernetes-Umgebung erforderlich sind, und dies unabhängig davon, wo die Ausführung erfolgt: auf vSphere, in Ihrer von VMware verwalteten Cloud in der Public Cloud oder auf dem Edge.",
    "vmc-kubernetes-overview.capabilities-title" : "Kernfunktionen",
    "vmc-kubernetes-overview.challenges-growth-desc" : "<strong>Kunden wünschen sich eine operationelle Entlastung</strong> Kunden wünschen sich im Zuge der Bereitstellung und Verwaltung einer wachsenden Anzahl an Kubernetes-Clustern eine operationelle Entlastung.",
    "vmc-kubernetes-overview.challenges-lifecycle-desc" : "<strong>Kunden möchten sich auf Anwendungen und Innovation konzentrieren</strong>, weniger auf Infrastruktur-Lebenszyklusverwaltung mit geringem Mehrwert.",
    "vmc-kubernetes-overview.challenges-operations-desc" : "<strong>Kunden benötigen eine konsistente Infrastruktur</strong> und konsistente Vorgänge, um Kubernetes-Cluster über lokale und Cloud-Umgebungen hinweg bereitzustellen, auszuführen und zu verwalten.",
    "vmc-kubernetes-overview.challenges-order-desc" : "<strong>Kunden benötigen eine skalierbare Infrastruktur</strong> in der Cloud, mit der sie den sich ändernden Geschäftsanforderungen begegnen und zugleich die Kosten für diese Infrastruktur optimieren können, um moderne Anwendungen zu entwickeln.",
    "vmc-kubernetes-overview.challenges-title" : "Herausforderungen",
    "vmc-kubernetes-overview.description" : "Mit Tanzu Kubernetes Grid Plus können Sie Ihren Entwicklern das Erstellen, Verwalten und Ausführen der nächsten Generation von Apps mithilfe von durch Kubernetes orchestrierten Containern ermöglichen.",
    "vmc-kubernetes-overview.enterprise-support-desc" : "<strong>Support der Enterprise-Klasse:</strong> Kunden, die Tanzu Kubernetes Grid Plus auf VMware Cloud on AWS bereitstellen, können rund um die Uhr Support zur Fehlerbehebung und Reparatur für Kubernetes und namhafte Open Source-Ökosystemtechnologien im Bereich der Lösungsarchitektur in Anspruch nehmen. Darüber hinaus können Kunden, die beabsichtigen, die Art und Weise der Bereitstellung ihrer Anwendungen zu ändern, an VMware Pivotal Labs teilnehmen, um in ihrer Organisation agile Entwicklungsmethoden einzuführen und den Weg zur Produktionsreife zu verkürzen.",
    "vmc-kubernetes-overview.get-started-btn" : "Beginnen",
    "vmc-kubernetes-overview.infrastructure-label" : "Unterstützte Infrastruktur:",
    "vmc-kubernetes-overview.integrated-services-desc" : "<strong>Integrierte Plattformdienste:</strong> Tanzu Kubernetes Grid Plus optimiert die Bereitstellung lokaler und in Cluster integrierter Dienste zur Vereinfachung der Konfiguration von Container-Image-Registrierungsrichtlinien, Überwachung, Protokollierung, für eingehenden Datenverkehr, Netzwerk und Speicher und zum Vorbereiten Ihrer Kubernetes-Umgebung für Produktionsarbeitslasten.",
    "vmc-kubernetes-overview.open-source-desc" : "<strong>Open Source-Kompatibilität:</strong> Tanzu Kubernetes Grid Plus unterstützt Sie beim Ausführen Ihrer Containeranwendungen auf einer Upstream-kompatiblen Kubernetes-Verteilung und bei der Nutzung von namhaften Open Source-Technologien wie Cluster API, Fluentbit und Contour, sodass Sie Portabilität ermöglichen und die Vorteile der Unterstützung und Innovationen aus der weltweiten Kubernetes-Community nutzen können. Darüber hinaus bietet es einen Reparaturdienst und proaktiven Support für Ihr Open Source-Ökosystem mit Customer Reliability Engineering.",
    "vmc-kubernetes-overview.solution-containerized-desc" : "Wenn Tanzu Kubernetes Grid Plus auf VMware Cloud on AWS bereitgestellt wird, können Sie die Vorteile einer elastisch skalierbaren Infrastruktur in der Cloud für Containerarbeitslasten nutzen und Kubernetes-Cluster schnell erstellen und entsprechend Ihren Anforderungen skalieren.",
    "vmc-kubernetes-overview.solution-establishes-desc" : "Dies bildet eine flexible und verlässliche Grundlage für die Anwendungsmodernisierung. Mit auf Kubernetes aufbauenden Anwendungen erzielen Sie echte Anwendungsportabilität, damit das Funktionieren von Anwendungen nicht auf eine anbieterspezifische Verteilung beschränkt ist.",
    "vmc-kubernetes-overview.solution-overview-img-alt" : "Diagramm der Lösungsarchitektur",
    "vmc-kubernetes-overview.solution-release-desc" : "Bei der Veröffentlichung einer neuen Kubernetes-Version arbeitet VMware mit der Open Source-Community zusammen, um sie im Upstream zu testen und abzusichern. Sobald die stabilen Upstream-Binärdateien veröffentlicht sind, wird VMware die Binärdateien aus Sicherheitsgründen signieren und zum Herunterladen verfügbar machen. Das Erstellen und Verwalten von VMware TKG war nie leichter, denn es wurde von Kubernetes-Spezialisten entwickelt.",
    "vmc-kubernetes-overview.solution-tanzu-grid-desc" : "Mit VMware Tanzu Kubernetes Grid Plus auf VMware Cloud on AWS können Sie Ihr SDDC in der Cloud bereitstellen und verfügen dabei über alle erforderlichen Komponenten zum Entwerfen und Skalieren von Kubernetes entsprechend Ihren Anforderungen. VMware Cloud on AWS bietet eine nahtlos integrierte Hybrid Cloud-Lösung. Mit dieser Lösung werden lokale vSphere-Umgebungen auf ein VMware-SDDC ausgeweitet, das auf Amazon Elastic Compute Cloud (Amazon EC2), einer vollständig als Bestandteil in AWS integrierten Bare Metal-Infrastruktur, ausgeführt wird.",
    "vmc-kubernetes-overview.solution-title" : "Lösungsbeschreibung",
    "vmc-kubernetes-overview.supported-infrastructure" : "VMware Cloud on AWS",
    "vmc-kubernetes-overview.tanzu-grid-development-desc" : "Die Anwendungsentwicklung weist einen evolutionären Zyklus auf, bei dem unterschiedliche Abhängigkeiten von der Infrastruktur erforderlich sind. Moderne Anwendungen erfordern neue Plattformen, die eine deklarative Verwendung umfassen, aber auch vorübergehende Eigenschaften beinhalten. Die zugrunde liegende Infrastruktur muss an diese neuen Trends angepasst werden, um moderne Arbeitslasten verarbeiten zu können.",
    "vmc-kubernetes-overview.tanzu-grid-modernization-desc" : "Im Einklang mit dieser Modernisierungsinitiative wird für IT-Administratoren eine Unterstützung containerbasierter Anwendungen immer notwendiger. Die Änderungsgeschwindigkeit im Bereich der Container nimmt jedes Kalenderquartal sprunghaft zu. Traditionelle IT-Organisationen, die alle Arten von Infrastrukturen und Anwendungen verwalten müssen, können einfach nicht mehr schritthalten. Das Tempo, mit dem die Containertechnologie sich zur Reife entwickelt, erfordert eine Infrastruktur, die je nach geschäftlichen Anforderungen elastisch skalierbar ist und zur begleitenden Unterstützung dieser beschleunigten Innovation auf den neuesten und größten Softwarelösungen ausgeführt werden kann.",
    "vmc-kubernetes-overview.tanzu-grid-order-desc" : "Um Kunden hierbei zu unterstützen, stellen wir VMware Tanzu Kubernetes Grid Plus (TKG), die unterstützte Kubernetes-Laufzeit von VMware auf VMware Cloud on AWS bereit. Organisationen, die mit der Ausführung von Containern und Kubernetes auf VMware Cloud on AWS beginnen möchten, können noch heute mit VMware Tanzu Kubernetes Grid Plus durchstarten. Tanzu Kubernetes Grid Plus ist auf die Kubernetes-Community ausgerichtet und für die Wahrung der Konsistenz zwischen verschiedenen Umgebungen konzipiert. Es bietet sicheren Zugriff auf die maßgeblichen Open Source-Technologien, einschließlich Kubernetes, Clusterlebenszyklusverwaltung (Cluster-API) und eine Container-Image-Registrierung (Harbor).",
    "vmc-kubernetes-overview.tanzu-grid-progress-desc" : "Die Fortschritte von Organisationen bei der Erstellung und Bereitstellung nativer Cloudanwendungen erfordern die Verfügbarkeit konsistenter und zuverlässiger Technologie, mit der dieser Prozess vereinfacht und ein Großteil der zugrunde liegenden Unklarheiten beseitigt werden können.",
    "vmc-kubernetes-overview.tanzu-grid-simplified-desc" : "Mit der Unterstützung für VMware Tanzu Kubernetes Grid Plus verfügen Kunden über einen einfachen Weg zum Ausführen von Kubernetes auf VMware Cloud on AWS. Diese Lösung bietet eine standardisierte, geeignete und zuverlässige Infrastruktur, mit der die Herausforderungen der Bereitstellung und Verwaltung von auf Kubernetes zugeschnittenen Anwendungen bewältigt werden können. Mit VMware TKG auf VMware Cloud on AWS kombiniert diese Lösung die Unternehmensfunktionen des VMware Software Defined Data Center (SDDC), einschließlich Rechenressourcen, Speicher und Netzwerk, die als Dienst auf AWS bereitgestellt werden, mit den marktführenden Funktionen von VMware TKG für eine einfache, sichere und konsistente Containerbereitstellung.",
    "vmc-kubernetes-overview.tanzu-grid-title" : "VMware Tanzu Kubernetes Grid Plus auf VMware Cloud on AWS",
    "vmc-kubernetes-overview.technical-overview" : "Technische Übersicht",
    "vmc-kubernetes-overview.technical-overview-apps-desc" : "Das Produkt bietet Entwicklern einen schnellen Weg zur Bereitstellung moderner Apps und bietet gleichzeitig eine konsistente Kubernetes-Erfahrung für Mitarbeiter, die in verschiedenen Unternehmensumgebungen arbeiten, wie etwa lokal in vSphere, in der Public Cloud und auf dem Edge. Es erweitert containerbasierte, auf Kubernetes ausgeführte Anwendungen so, dass sie über Fehlerdomänen hinweg verfügbar sind.",
    "vmc-kubernetes-overview.technical-overview-grid-desc" : "VMware Tanzu Kubernetes Grid Plus wird im VMware-SDDC ausgeführt, das seinerseits auf einer dedizierten, elastischen Amazon EC2-Bare Metal-Infrastruktur ausgeführt wird. VMware Tanzu Kubernetes Grid Plus ist eine für den Einsatz in Unternehmen geeignete Kubernetes-Laufzeit, die Open Source-Technologien und Automatisierungstools in einem Paket vereinigt, mit dem Sie eine skalierbare Kubernetes-Umgebung mit mehreren Clustern schnell bereitstellen und ausführen können. Wird sie auf VMware Cloud on AWS bereitgestellt, bietet sie eine elastisch skalierbare Infrastruktur für Containerarbeitslasten und unterstützt Sie bei der Erstellung und Skalierung von Kubernetes-Clustern entsprechend Ihrer Anforderungen.",
    "vmc-kubernetes-overview.title" : "Kubernetes",
    "vmc-kubernetes-overview.video-btn" : "Video abspielen",
    "vmc-kubernetes-overview.video-poster-img-alt-txt" : "Tanzu Kubernetes Grid Plus auf VMware Cloud on AWS",
    "vmc-kubernetes-resources.browser-title" : "Kubernetes-Ressourcen",
    "vmc-kubernetes-resources.cloud-as-platform" : "VMware Cloud als Plattform",
    "vmc-kubernetes-resources.faqs" : "FAQs",
    "vmc-kubernetes-resources.videos-and-docs" : "Videos und Dokumente",
    "vmc-kubernetes-resources.what-is-kubernetes" : "Was ist Kubernetes?",
    "vmc-kubernetes-videos-and-docs.click-here-1" : "Hier klicken, um die wöchentliche Live-Serie zu TGIKubernetes auf YouTube anzusehen",
    "vmc-kubernetes-videos-and-docs.click-here-2" : "Hier klicken, um dieses eBook zu lesen",
    "vmc-kubernetes-videos-and-docs.desc" : "Weitere Informationen zu Kubernetes finden Sie in der weiter unten aufgeführten Liste eigens zusammengestellter Veröffentlichungen, einschließlich Whitepapers, technischer Videos und weiterer Materialien. Zusätzliche Ressourcen finden Sie <a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\">hier <clr-icon shape=\"pop-out\"></clr-icon></a>",
    "vmc-kubernetes-videos-and-docs.docs-title" : "Dokumente",
    "vmc-kubernetes-videos-and-docs.kube-academy-click-here" : "Hier klicken, um zu VMware Kubernetes Academy zu gehen",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-btn" : "Zur Kube Academy gehen",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-desc" : "Haben Sie wenig Zeit, möchten jedoch unbedingt mehr zu Containern und Kubernetes erfahren? Lassen Sie sich von führenden Experten der Kube Academy weiterbilden. Kube Academy-Kurse setzen sich aus Serien von mundgerecht aufbereiteten Videolektionen zusammen, die von erfahrenen Kursleitern entwickelt wurden. Diese Kurse bieten Ihnen kostenlos und unverbindlich Hilfe beim Verständnis der neuen Kubernetes-Begriffe.",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-img-alt" : "VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-title" : "VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.managing-book-btn" : "eBook lesen",
    "vmc-kubernetes-videos-and-docs.managing-book-desc" : "Es gibt Theorie und Praxis bei Kubernetes. Dieses eBook bezieht sich auf die Praxis und wurde von Brendan Burns (einem der drei ursprünglichen Autoren von Kubernetes) und Craig Tracey (VMware-Mitarbeiter und Kubernetes-Architekt) verfasst.",
    "vmc-kubernetes-videos-and-docs.managing-book-img-alt" : "Verwalten von Kubernetes",
    "vmc-kubernetes-videos-and-docs.managing-book-title" : "Verwalten von Kubernetes",
    "vmc-kubernetes-videos-and-docs.pdf-click-here" : "Hier klicken, um dieses eBook zu lesen",
    "vmc-kubernetes-videos-and-docs.title" : "Videos und Dokumente: Kubernetes",
    "vmc-kubernetes-videos-and-docs.tutorials-desc" : "Mit TGIKubernetes können Sie jede Woche in einen YouTube-Live-Stream zu neuen Kubernetes-Tools und -Begriffen eintauchen. Nehmen Sie jede Woche um 13:00 Uhr (PST) teil und bleiben Sie auf dem Laufenden. Darüber hinaus können Sie sich mit VMware Kubernetes Academy mit einer Reihe von mundgerecht aufbereiteten Videolernprogrammen weiterbilden, die von führenden Kursleitern bei VMware erstellt wurden.",
    "vmc-kubernetes-videos-and-docs.tutorials-title" : "Lernprogramme und wöchentliche Live-Serien",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-btn" : "eBook lesen",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-desc" : "Erhalten Sie eine praktische Einführung dazu, wie Kubernetes und die Containertechnologie Ihnen dabei helfen können, ein neues Niveau an Schnelligkeit, Agilität, Zuverlässigkeit und Effizienz zu erreichen.",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-title" : "Kubernetes: Praktische Einführung",
    "vmc-kubernetes-videos-and-docs.up-and-running-img-alt" : "Praktische Einführung in Kubernetes",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-btn" : "Auf YouTube ansehen",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-desc" : "Seien Sie dabei, wenn Joe Beda eine praktische Erkundung von Kubernetes und verwandten Themen vornimmt. Es handelt sich dabei einerseits um Dinge, die Joe sehr gut kennt, andererseits nimmt Joe Sie mit zur Erkundung von Neuland. Stellen Sie Fragen, geben Sie Kommentare und bestimmen Sie mit, wohin die Reise geht.",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-img-alt" : "Wöchentliche Live-Serie zu TGIKubernetes auf YouTube",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-title" : "Wöchentliche Live-Serie bei YouTube: TGIKubernetes",
    "vmc-kubernetes-what-is-kubernetes.advantages-title" : "3. Vorteile von Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.applications" : "Kubernetes skaliert Webserver entsprechend des Bedarfs für die Softwareanwendungen hoch und stuft Webserverinstanzen während Zeiten mit weniger oder keiner Aktivität wieder herunter.",
    "vmc-kubernetes-what-is-kubernetes.architecture-desc" : "Kubernetes hat sich aus Code entwickelt, den Google zum Verwalten seiner Datencenter entsprechend der Skalierung der „Borg“-Plattform verwendet hat. AWS hat mit der Markteinführung der Plattform EC2 elastische Webserver-Frameworks öffentlich verfügbar gemacht. Kubernetes lässt zu, dass Unternehmen Container wie EC2 orchestrieren, jedoch Open Source-Code verwenden. Google, AWS, Azure und andere große Public Cloud-Hosts bieten Kubernetes-Unterstützung für die Webserverorchestrierung in der Cloud an. Kunden können Kubernetes für ein vollständiges Datencenter-Outsourcing, Web- bzw. mobile Anwendungen, SaaS-Unterstützung, Web-Hosting in der Cloud oder Hochleistungs-Computing verwenden.",
    "vmc-kubernetes-what-is-kubernetes.architecture-title" : "2. Kubernetes-Architektur",
    "vmc-kubernetes-what-is-kubernetes.automate" : "Kubernetes bietet die Möglichkeit, die Webserver-Bereitstellung entsprechend des Aufkommens an Webdatenverkehr in der Produktion zu automatisieren.",
    "vmc-kubernetes-what-is-kubernetes.automated" : "Der Hauptvorteil von Kubernetes besteht in der Möglichkeit, eine automatisierte, elastische Webserverplattform in der Produktion zu betreiben, und dies ohne die Anbieterbeschränkung auf AWS mit dem EC2-Dienst.",
    "vmc-kubernetes-what-is-kubernetes.capabilities" : "Kubernetes verfügt auch über erweiterte Lastausgleichsfunktionen für das Routing von Webdatenverkehr zu Webservern bei laufendem Betrieb.",
    "vmc-kubernetes-what-is-kubernetes.desc" : "Kubernetes ist eine Open Source-Plattform für die Containerorchestrierung, die das Betreiben eines elastischen Webserver-Frameworks für Cloudanwendungen ermöglicht. Mit Kubernetes kann Dantencenter-Outsourcing auf Public Cloud-Dienstanbieter unterstützt werden, oder es kann zum Webhosting entsprechend der Skalierung verwendet werden. Website- und mobile Anwendungen mit komplexem benutzerdefiniertem Code können mithilfe von Kubernetes auf Standardhardware bereitgestellt werden. Dies trägt zur Senkung der Kosten für die Webserverbereitstellung in Verbindung mit Public Cloud-Hosts und zur Optimierung von Softwareentwicklungsprozessen bei.",
    "vmc-kubernetes-what-is-kubernetes.docker-desc" : "Kubernetes ist ein Open Source-Containerorchestrierungsplattform. Docker ist der in Verbindung mit Kubernetes hauptsächlich verwendete Containervirtualisierungsstandard. Andere Systeme für die elastische Webserverorchestrierung sind Docker Swarm, CoreOS Tectonic und Mesosphere. Intel verfügt mit Kata auch über einen Containerstandard im Wettbewerb, und es gibt mehrere Linux-Containerversionen. Docker hat den größten Marktanteil an Softwareprodukten im Bereich der Containervirtualisierung. Docker ist ein auf Containervirtualisierung spezialisiertes Softwareentwicklungsunternehmen, während Kubernetes ein Open Source-Projekt ist, das von einer Entwickler-Community, der professionelle Programmierer aller großen IT-Unternehmen angehören, getragen wird.",
    "vmc-kubernetes-what-is-kubernetes.docker-title" : "5. Kubernetes im Vergleich zu Docker",
    "vmc-kubernetes-what-is-kubernetes.features-img-alt" : "Dokument – Kubernetes für Führungskräfte",
    "vmc-kubernetes-what-is-kubernetes.features-title" : "1. Kubernetes-Funktionen",
    "vmc-kubernetes-what-is-kubernetes.features-tooltip" : "Hier klicken, um das Dokument zu Kubernetes für Führungskräfte zu lesen",
    "vmc-kubernetes-what-is-kubernetes.orchestration-desc" : "Containerorchestrierung ist die Verwaltung einzelner Webserver, die in Containern über virtuelle Partitionen auf Datencenter-Hardware betrieben werden. Containerorchestrierung dient dazu, das elastische Framework für Webserver in einem Datencenter auf Automatisierungsbasis in der Produktion aufrechtzuerhalten. Administratoren können Ressourcen festlegen, die automatisch gestartet werden, wenn der Webdatenverkehr über die Kapazität eines einzelnen Servers hinaus ansteigt. Bei SaaS-Anwendungen kann dies eine Skalierung zur Unterstützung von Millionen gleichzeitiger Benutzer bedeuten.",
    "vmc-kubernetes-what-is-kubernetes.orchestration-title" : "4. Kubernetes-Containerorchestrierung",
    "vmc-kubernetes-what-is-kubernetes.scalability" : "Kubernetes ermöglicht es jedem Unternehmen, seinen Softwarecode mit demselben Niveau an Skalierbarkeit zu betreiben wie die größten Unternehmen der Welt, und dies bei einer wettbewerbsfähigen Datencenter-Preisgestaltung für Hardwareressourcen.",
    "vmc-kubernetes-what-is-kubernetes.server" : "Die Hardwarefunktionen des Webservers können sich in verschiedenen Datencentern oder auf unterschiedlicher Hardware befinden oder über verschiedene Hostanbieter bereitgestellt werden.",
    "vmc-kubernetes-what-is-kubernetes.services" : "Kubernetes kann auf den meisten Public Cloud-Hostingdiensten ausgeführt werden, und alle namhaften Unternehmen bieten eine wettbewerbsfähige Preisgestaltung an. Kubernetes ermöglicht das vollständige Outsourcing eines Unternehmens-Datencenters.",
    "vmc-kubernetes-what-is-kubernetes.title" : "Was ist Kubernetes?",
    "vmc-kubernetes-what-is-kubernetes.video-poster-img-alt-txt" : "Kubernetes in 5 Minuten",
    "vmc-kubernetes-what-is-kubernetes.web-traffic" : "Kubernetes kann auch zum Skalieren von Web- und mobilen Anwendungen in der Produktion auf höchste Webdatenverkehrsaufkommen verwendet werden."
  }
}