{
  "component" : "vmw-migration",
  "locale" : "de",
  "messages" : {
    "migration.resource-content.video-poster-img-alt-txt" : "Demovideo",
    "migration.task.detail.compute-ip-range" : "Um Computing-Arbeitslasten innerhalb des SDDC bereitstellen zu können, müssen Sie mindestens ein Computing-Netzwerksegment erstellen. Obwohl die Bereitstellung eines SDDC nicht erforderlich ist, empfiehlt VMware, mindestens einen IP-Adressbereich für das SDDC-Computing-Netzwerk zuzuteilen. Nachdem das SDDC bereitgestellt wurde, können Sie ein Netzwerksegment unter Verwendung dieses Adressbereichs erstellen.",
    "migration.task.detail.create-sddc-step-2" : "Anzahl und Typ der bereitzustellenden Hosts",
    "migration.task.detail.create-sddc-step-3" : "Entscheidung, ob Sie einen Cluster in einer einzelnen Verfügbarkeitszone oder einen Stretched Cluster über mehrere Verfügbarkeitszonen hinweg erstellen möchten",
    "migration.task.detail.move-back" : "Zurück verschieben",
    "migration.task.detail.prepare-network-ranges" : "Wenn Sie ein SDDC erstellen, müssen Sie einen IP-Bereich für Ihr Verwaltungsnetzwerk angeben. Dieser IP-Adressbereich kann nach der Erstellung des SDDC nicht mehr geändert werden. Daher ist es wichtig, diesen IP-Bereich sorgfältig zu planen.",
    "migration.task.detail.size-consideration" : "Der Bereich muss groß genug für alle am ersten Tag bereitgestellten Hosts sein, er muss jedoch auch Raum für ein zukünftiges Wachstum bieten.",
    "task-detail.direct-connect-description-5" : "Weitere Informationen zum Konfigurieren von Direct Connect finden Sie in der Dokumentation.",
    "vmc-migration-journey.browser-title" : "Migration: Ablauf",
    "vmc-migration-journey.cancel" : "abbrechen",
    "vmc-migration-journey.get-started" : "Beginnen",
    "vmc-migration-journey.reset" : "Zurücksetzen",
    "vmc-migration-journey.reset-btn-txt" : "Zurücksetzen",
    "vmc-migration-journey.reset-confirmation" : "Hiermit wird der Inhalt der Fortschrittsanzeige gelöscht und der Status für jeden Schritt auf „Nicht gestartet“ zurückgesetzt. Dieser Vorgang kann nicht rückgängig gemacht werden. Möchten Sie wirklich alle Aufgaben zurücksetzen?",
    "vmc-migration-journey.reset-err-alert-desc" : "Das Zurücksetzen des Status aller Aufgaben ist fehlgeschlagen. Versuchen Sie es erneut.",
    "vmc-migration-journey.reset-err-alert-title" : "Zurücksetzen fehlgeschlagen.",
    "vmc-migration-journey.reset-modal.reset-confirmation" : "Hiermit wird der Inhalt der Fortschrittsanzeige gelöscht und der Status für jeden Schritt auf „Nicht gestartet“ zurückgesetzt. Dies kann nicht rückgängig gemacht werden. Möchten Sie wirklich alle Aufgaben zurücksetzen?",
    "vmc-migration-journey.reset-modal.reset-tasks" : "Alle Aufgaben zurücksetzen",
    "vmc-migration-journey.reset-success-alert-desc" : "Der Status aller Aufgaben wurde erfolgreich zurückgesetzt.",
    "vmc-migration-journey.reset-success-alert-title" : "Zurücksetzen erfolgreich.",
    "vmc-migration-journey.reset-tasks" : "Alle Aufgaben zurücksetzen",
    "vmc-migration-journey.reset-tracking" : "Um von Neuem zu beginnen, klicken Sie auf <strong>Zurücksetzen</strong>. Damit wird der Inhalt der Fortschrittsanzeige gelöscht und der Status \n für jeden Schritt auf „Nicht gestartet“ zurückgesetzt.\n    ",
    "vmc-migration-journey.title" : "Ihr Weg zur Migration beginnt hier!",
    "vmc-migration-journey.view-details" : "Details anzeigen",
    "vmc-migration-overview.browser-title" : "Übersicht über die Migration",
    "vmc-migration-overview.build-cloud-environment" : "Cloud-Umgebung erstellen",
    "vmc-migration-overview.build-overview" : "In der Erstellungsphase erstellen Sie Ihre VMware Cloud on AWS-Infrastruktur basierend auf den Anforderungen, die Sie in der Planungsphase festgelegt haben. Sie erstellen ein Cloud-SDDC und konfigurieren es so, dass es für die Ausführung Ihrer Arbeitslasten bereit ist.",
    "vmc-migration-overview.getting-started" : "Beginnen",
    "vmc-migration-overview.migrate-overview" : "In der Migrationsphase konfigurieren Sie HCX und richten einen Tunnel ein, den Sie zum Migrieren Ihrer Arbeitslasten verwenden. Sie können das Ergebnis der Migration auch mit Anwendungsbenutzern testen. Am Ende dieser Phase haben Sie erfolgreich virtuelle Maschinen aus Ihrem lokalen Datencenter zu VMware Cloud on AWS migriert.",
    "vmc-migration-overview.migrate-your-workloads" : "Arbeitslasten migrieren",
    "vmc-migration-overview.plan-overview" : "In der Planungsphase erhalten Sie Informationen zur VMware Cloud on AWS-Plattform, überprüfen die Größe Ihrer lokalen Arbeitslasten und ermitteln die für diese Arbeitslasten erforderlichen Netzwerk-, Sicherheits- und anderen Ressourcen. Mit diesen Informationen können Sie die Größe und Konfiguration Ihrer VMware Cloud on AWS-Infrastruktur bestimmen. Die Planung ist eine sehr wichtige Phase. Sie ist die Grundlage für Ihre Migration.",
    "vmc-migration-overview.plan-your-migration" : "Migration planen",
    "vmc-migration-overview.sub-title" : "Ein Schritt-für-Schritt-Migrationshandbuch für Ihr Projekt der Datencenter-Migration zu VMware Cloud on AWS.",
    "vmc-migration-overview.technical-overview" : "Technische Übersicht",
    "vmc-migration-overview.technical-overview-stage-description" : "Bei jedem Schritt des Prozesses bietet die VMware Cloud-Migrationslösung Anweisungen, Tools und Links zu zusätzlichen Informationen, die zum Abschließen der Migration erforderlich sind. Sie können die Migrationslösung auch zum Nachverfolgen Ihres Fortschritts verwenden, während Sie die einzelnen Schritte abschließen. Am Ende dieses geführten Prozesses haben Sie erfolgreich virtuelle Maschinen von Ihrem lokalen Datencenter zu VMware Cloud on AWS migriert.",
    "vmc-migration-overview.technical-overview-stages" : "Die VMware Cloud-Migrationslösung führt Sie durch die Migration virtueller Maschinen von Ihrem lokalen Datencenter zu VMware Cloud on AWS. Der Migrationsvorgang umfasst drei Phasen: Planen, Erstellen und Migrieren. Jede Phase ist in eine Reihe von aufeinander aufbauenden Schritten unterteilt, um Sie erfolgreich durch die Migration zu führen.",
    "vmc-migration-overview.title" : "Migration",
    "vmc-migration-resource-content.demo-videos.introduction" : "Erfahren Sie, wie Sie Arbeitslasten in ein VMware Cloud on AWS-SDDC migrieren können.",
    "vmc-migration-resource-content.demo-videos.page-title" : "Demovideos: Migration",
    "vmc-migration-resource-content.office-hours.introduction" : "Antworten auf Ihre Migrationsfragen erhalten Sie innerhalb der Geschäftszeiten vom VMware Customer Success-Team.",
    "vmc-migration-resource-content.office-hours.page-title" : "Geschäftszeiten: Migration",
    "vmc-migration-resource-content.past-sessions" : "Vergangene Sitzungen anzeigen",
    "vmc-migration-resource-content.play-video" : "Video abspielen: Praxisleitfaden",
    "vmc-migration-resource-content.quick-reference.btn-txt" : "Referenz anzeigen",
    "vmc-migration-resource-content.quick-reference.introduction" : "Dieser Leitfaden in Form einer Kurzreferenz enthält wichtige Überlegungen für die Vorbereitung, Durchführung und Nachbereitung einer Cloud-Migration in der Praxis.",
    "vmc-migration-resource-content.quick-reference.page-title" : "Kurzreferenz zur Cloud-Migration für die Praxis\n            ",
    "vmc-migration-resource-content.reference-architecture.btn-txt" : "Architektur anzeigen",
    "vmc-migration-resource-content.reference-architecture.introduction" : "Die Referenzarchitektur bietet eine generische Anleitung für die ersten Schritte bei der Bereitstellung von standardmäßigen Hybridanwendungen auf VMware Cloud on AWS, auf die lokale Endbenutzer zugreifen können.",
    "vmc-migration-resource-content.reference-architecture.page-title" : "Referenzarchitektur: Cloud-Migration mit VMware Cloud on AWS",
    "vmc-migration-resource-content.register-session" : "Für Sitzung registrieren",
    "vmc-migration-resource-content.solution-brief.btn-txt" : "Lösungsübersicht anzeigen",
    "vmc-migration-resource-content.solution-brief.introduction" : "In dieser Lösungsübersicht werden Herausforderungen bei der Cloud-Migration, die Methode von VMware Cloud on AWS zum Überwinden dieser Herausforderungen und die Hauptfunktionen von VMware Cloud on AWS in Verbindung mit Anwendungsfällen im Bereich der Cloud-Migration behandelt.",
    "vmc-migration-resource-content.solution-brief.page-title" : "Lösungsübersicht: Cloud-Migration mit VMware Cloud on AWS",
    "vmc-migration-resource-content.view-more" : "Mehr anzeigen",
    "vmc-migration-resource-content.whitepapers.btn-txt" : "Whitepaper anzeigen",
    "vmc-migration-resource-content.whitepapers.introduction" : "In diesem Whitepaper werden die Hybrid Cloud, damit in Zusammenhang stehende Anwendungsfälle, Herausforderungen und Chancen sowie die Methode von VMware Cloud on AWS zum Überwinden dieser Herausforderungen behandelt.\n            ",
    "vmc-migration-resource-content.whitepapers.page-title" : "Whitepaper: Hybrid Cloud mit Migration und VMware Cloud on AWS",
    "vmc-migration-resources.browser-title" : "Migrationsressourcen",
    "vmc-migration-resources.demo-videos" : "Demovideos",
    "vmc-migration-resources.office-hours" : "Geschäftszeiten",
    "vmc-migration-resources.quick-reference" : "Kurzreferenz für die Praxis",
    "vmc-migration-resources.reference-architecture" : "Referenzarchitektur",
    "vmc-migration-resources.solution-brief" : "Lösungsübersicht",
    "vmc-migration-resources.whitepapers" : "Whitepapers",
    "vmc-migration-stage-detail.action" : "Aktion",
    "vmc-migration-stage-detail.back" : "zurück",
    "vmc-migration-stage-detail.browser-title.build" : "Cloud-Umgebung erstellen",
    "vmc-migration-stage-detail.browser-title.migrate" : "Zur Cloud migrieren",
    "vmc-migration-stage-detail.browser-title.plan" : "Migration planen",
    "vmc-migration-stage-detail.build-what-next" : "In der nächsten Phase besteht Ihr Ziel darin, Arbeitslasten auf VMware Cloud on AWS zu migrieren. Am Ende der Phase werden die migrierten Arbeitslasten in Ihrem SDDC auf VMware Cloud on AWS ausgeführt.",
    "vmc-migration-stage-detail.cancel" : "Abbrechen",
    "vmc-migration-stage-detail.dont-ask-me-again" : "Nicht noch einmal fragen.",
    "vmc-migration-stage-detail.error" : "Fehler: Der Vorgang konnte nicht abgeschlossen werden.",
    "vmc-migration-stage-detail.fetching-data" : "Daten werden abgerufen",
    "vmc-migration-stage-detail.go-back-to-journey" : "Zurück zur Ablaufseite",
    "vmc-migration-stage-detail.go-to-next-phase" : "Zu Phase {0} wechseln",
    "vmc-migration-stage-detail.log-in" : "Anmelden",
    "vmc-migration-stage-detail.login-description" : "Sie müssen sich bei VMware Cloud Services anmelden, um Ihren Fortschritt zu speichern.",
    "vmc-migration-stage-detail.login-required" : "Anmeldung erforderlich",
    "vmc-migration-stage-detail.migration-task" : "Migrationsaufgabe",
    "vmc-migration-stage-detail.not-yet" : "Noch nicht",
    "vmc-migration-stage-detail.plan-what-next" : "In der nächsten Phase ist Ihr Ziel das Erstellen und Konfigurieren Ihres VMware Cloud on AWS-SDDC. Am Ende der Phase haben Sie eine Cloud-Umgebung mit der gewünschten Netzwerkkonnektivität, einer Verwaltung über eine zentrale Oberfläche und dem Zugriff auf Ihre Cloud-Umgebung erstellt.",
    "vmc-migration-stage-detail.request-access-moadal.description" : "Um mit der Verwendung von VMware Cloud on AWS in der Organisation beginnen zu können, müssen Sie auf den Produktmarketing-Seiten für VMware Cloud Zugriff anfordern.",
    "vmc-migration-stage-detail.request-access-moadal.learn-more-btn" : "Weitere Informationen",
    "vmc-migration-stage-detail.request-access-moadal.title" : "Zugriff auf VMware Cloud on AWS anfordern",
    "vmc-migration-stage-detail.required-modal.cancel-btn-text" : "Abbrechen",
    "vmc-migration-stage-detail.required-modal.description" : "Sie müssen sich anmelden, um Ihren Fortschritt zu speichern.",
    "vmc-migration-stage-detail.required-modal.submit-btn-text" : "Anmelden",
    "vmc-migration-stage-detail.required-modal.title" : "Anmelden erforderlich",
    "vmc-migration-stage-detail.status" : "Status",
    "vmc-migration-stage-detail.success-build" : "Sehr gut! Sie haben alle Schritte in der Erstellungsphase abgeschlossen. Fahren Sie jetzt mit der nächsten Phase fort.",
    "vmc-migration-stage-detail.success-migrate" : "Herzlichen Glückwunsch! Ihr Datencenter-Migrationsprojekt sollte jetzt abgeschlossen sein.",
    "vmc-migration-stage-detail.success-plan" : "Sehr gut! Sie haben alle Schritte in der Planungsphase abgeschlossen. Fahren Sie jetzt mit der nächsten Phase fort.",
    "vmc-migration-stage-detail.task" : "Aufgabe",
    "vmc-migration-stage-detail.track-any-way" : "Trotzdem nachverfolgen",
    "vmc-migration-stage-detail.tracking-alert" : "Nachverfolgungswarnung",
    "vmc-migration-stage-detail.tracking-alert-description" : "Sie haben nicht alle vorherigen Schritte abgeschlossen. Möchten Sie mit der Nachverfolgung dieses Schritts beginnen?",
    "vmc-migration-stage-detail.updated" : "Aktualisiert",
    "vmc-migration-stage-detail.whats-next" : "Nächste Phase",
    "vmc-migration-status-badge.completed" : "Abgeschlossen",
    "vmc-migration-status-badge.in-progress" : "Vorgang läuft",
    "vmc-migration-status-badge.not-started" : "Nicht gestartet",
    "vmc-migration-status-badge.skipped" : "Übersprungen",
    "vmc-migration-status-dropdown.change-status" : "Status ändern",
    "vmc-migration-status-dropdown.change-status-for" : "Status für aktuelle Aufgabe ändern",
    "vmc-migration-status-dropdown.completed" : "Abgeschlossen",
    "vmc-migration-status-dropdown.in-progress" : "Vorgang läuft",
    "vmc-migration-status-dropdown.not-started" : "Nicht gestartet",
    "vmc-migration-status-dropdown.set-status-to" : "Status festlegen auf",
    "vmc-migration-status-dropdown.skipped" : "Übersprungen",
    "vmc-migration-task-detail.access-aws" : "Vorgehensweise für den Zugriff auf AWS-Dienste",
    "vmc-migration-task-detail.account-creation" : "Erstellung und Verwaltung von VMware-Konten",
    "vmc-migration-task-detail.analyze-network-description-1" : "Sie können optional vRealize Network Insight Cloud verwenden, um VM-Netzwerkabhängigkeiten zu identifizieren. Überspringen Sie diesen Schritt, wenn Sie bereits wissen, welche VMs Sie zu VMware Cloud on AWS migrieren möchten.",
    "vmc-migration-task-detail.analyze-network-description-2" : "Die Netzwerkabhängigkeits-Zuordnung zeigt Ihnen, welche VMs miteinander kommunizieren. Miteinander kommunizierende VMs sollten zusammen migriert werden, um Gebühren für den Netzwerkdatenverkehr, Latenzen und andere Leistungsprobleme zu vermeiden.",
    "vmc-migration-task-detail.analyze-network-description-3" : "Ermitteln Sie die Netzwerkabhängigkeits-Zuordnung mithilfe des Diensts vRealize Network Insight Cloud. vRealize Network Insight Cloud ist ein Cloud-Dienst, der Ihnen eine detaillierte Ansicht Ihres Netzwerks ermöglicht und Sie beim Aufbau einer optimierten, hochverfügbaren und sicheren Netzwerkinfrastruktur in Multi-Cloud-Umgebungen unterstützt.",
    "vmc-migration-task-detail.analyze-on-premises-workload-description-1" : "Die Cloud-Migration ist häufig ein iterativer Prozess und sollte in „Wellen“ durchgeführt werden (d. h. Gruppen von VMs, die zu einem bestimmten Zeitpunkt migriert werden). Identifizieren Sie Arbeitslasten, die in die Cloud migriert werden sollen, und kategorisieren Sie diese basierend darauf, wie leicht sie migriert werden können. Beispielsweise können Entwicklungs- oder Staging-Arbeitslasten als „einfach“ betrachtet werden, da diese für die Produktion oft weniger kritisch sind. Große und/oder E/A-intensive Arbeitslasten, wie z. B. Datenbanken, sind möglicherweise schwieriger zu verschieben und sollten als letztes migriert werden. Bei der Kategorisierung von Arbeitslasten kann es hilfreich sein, Netzwerk- und Speicher-E/A-Metriken für alle zu migrierenden VMs zu erfassen und zu überprüfen. Diese Metriken sind hilfreich für die Planung der „Wellen“ des Migrationsprozesses. ",
    "vmc-migration-task-detail.analyze-on-premises-workload-description-2" : "Nachdem Sie die zu migrierenden VMs identifiziert und diese VMs in Migrationswellen gruppiert haben, besteht der nächste Schritt in der Schätzung der gesamten Computing-, Arbeitsspeicher- und Speicheranforderungen für alle VMs. Diese Informationen sind zur Bestimmung der für Ihr VMware Cloud on AWS-SDDC benötigten Anzahl an Hosts erforderlich.",
    "vmc-migration-task-detail.aws-direct-connect" : "AWS Direct Connect",
    "vmc-migration-task-detail.aws-vi" : "Was sind virtuelle AWS Direct Connect-Schnittstellen?",
    "vmc-migration-task-detail.back-to-choose" : "ZURÜCK ZUR AUSWAHL EINER NETZWERKOPTION",
    "vmc-migration-task-detail.boarding-handbook" : "VMware Cloud-Onboarding – Handbuch",
    "vmc-migration-task-detail.boarding-presentation" : "VMware Cloud-Onboarding – Präsentation",
    "vmc-migration-task-detail.choose-method" : "Wählen Sie die Methode aus, die für Ihre Umgebung am besten geeignet ist:",
    "vmc-migration-task-detail.compute-gateway" : "Vorgehensweise zum Hinzufügen einer Computing-Gateway-DNS-Zone",
    "vmc-migration-task-detail.configure-aws-connectivity" : "Zusätzlich zu der querverbundenen AWS-VPC, die Sie beim Erstellen des SDDC angegeben haben, können Sie optional eine Verbindung zu AWS-Ressourcen herstellen, die Teil anderer VPCs sind. Die genaue Strategie, die für diese Konnektivität verwendet wird, variiert zwar je nach Kunde, aber Folgendes wird am häufigsten verwendet:",
    "vmc-migration-task-detail.configure-aws-connectivity-direct-via-ip-sec" : "Direkt über IPsec: Es ist möglich, ein IPsec-VPN direkt zu einem VGW innerhalb einer VPC einzurichten. Diese Strategie ist nützlich zum Herstellen einer Verbindung mit einer kleinen Anzahl von VPCs.",
    "vmc-migration-task-detail.configure-aws-dc" : "AWS Direct Connect für VMware Cloud on AWS konfigurieren",
    "vmc-migration-task-detail.configure-hybrid-cloud-extension-description-1" : "Die Arbeitslastmigration zu VMware Cloud on AWS wird am besten mithilfe von VMware HCX (früher bekannt als Hybrid Cloud Extension und NSX Hybrid Connect) durchgeführt. HCX ist ein SaaS-Angebot, das Anwendungsmobilität und Infrastrukturhybridität über verschiedene vSphere-Versionen hinweg bietet, lokal und in der Cloud. Es ist für alle VMware Cloud on AWS-Kunden kostenlos.",
    "vmc-migration-task-detail.configure-hybrid-cloud-extension-description-2" : "Das erfolgreiche Migrieren von Arbeitslasten in das SDDC erfordert ein gewisses Maß an Planung. Dieser als „Planung in Wellen“ bezeichnete Vorgang trägt zur reibungslosen und erfolgreichen Migration zu VMware Cloud on AWS bei.",
    "vmc-migration-task-detail.configure-network-description" : "Nachdem Ihr Cloud-SDDC bereitgestellt wurde, rufen Sie die VMC Console auf und konfigurieren Sie die Netzwerkeinrichtung für das SDDC. Sie können AWS Direct Connect oder IPsec-VPN auswählen oder auch eine Verbindung über das öffentliche Internet herstellen. Weitere Informationen zu diesen Optionen finden Sie in der Planungsphase.",
    "vmc-migration-task-detail.configure-vpn" : "Vorgehensweise zum Konfigurieren einer VPN-Verbindung",
    "vmc-migration-task-detail.cpu-utilization" : "CPU-Nutzung",
    "vmc-migration-task-detail.create-sddc" : "Vorgehensweise zum Erstellen eines SDDCs auf VMware Cloud on AWS",
    "vmc-migration-task-detail.create-sddc-description-1" : "Ein softwaredefiniertes Datencenter (SDDC) ist die Kapazitätseinheit, in der Sie Ihre Arbeitslasten ausführen können. Verwenden Sie die Informationen aus dem vorherigen Schritt, um Ihr SDDC in VMware Cloud on AWS zu erstellen.",
    "vmc-migration-task-detail.create-sddc-description-2" : "Beachten Sie beim Erstellen Ihres SDDC Folgendes:",
    "vmc-migration-task-detail.create-sddc-step-1" : "Die Region, in der Sie Ihr SDDC bereitstellen möchten",
    "vmc-migration-task-detail.create-vmc-on-aws-account-description-1" : "VMware Cloud on AWS-Konten basieren auf einer oder mehreren Organisationen. Erstellen Sie ein VMware-Konto oder melden Sie sich bei Ihrem VMware-Konto an.",
    "vmc-migration-task-detail.create-vmc-on-aws-account-description-2" : "Erstellen Sie eine Zahlungsmethode für VMware Cloud on AWS und erstellen Sie optional ein Abonnement. Mit Abonnements können Sie Geld sparen, indem Sie sich verpflichten, eine bestimmte Kapazität für einen bestimmten Zeitraum zu erwerben.",
    "vmc-migration-task-detail.deploy-hcx-console" : "Bereitstellen von VMware HCX Cloud in der VMC Console",
    "vmc-migration-task-detail.direct-connect" : "Direct Connect: Wenn Direct Connect verwendet wird, ist über Direct Connect ein Transit zwischen VPCs möglich.",
    "vmc-migration-task-detail.direct-connect-aws" : "Was ist Direct Connect on AWS?",
    "vmc-migration-task-detail.direct-connect-description-1" : "VMware Cloud on AWS-SDDCs können eine oder mehrere der innerhalb des kundeneigenen AWS-Kontos vorhandenen Direct Connect-Verbindungen verwenden. Sobald eine Direct Connect-Verbindung bereitgestellt wurde, können Sie eine private virtuelle Schnittstelle (VIF) erstellen und sie dem VMware-eigenen AWS-Konto, das für Ihre VMware Cloud Services-Organisation erstellt wurde, zuteilen. Diese Kontonummer wird in der VMC-Konsole unter der UI-Komponente „Direct Connect“ eines SDDC angezeigt.",
    "vmc-migration-task-detail.direct-connect-description-2" : "Für die Integration von Direct Connect benötigen Sie die folgenden Elemente:",
    "vmc-migration-task-detail.direct-connect-description-3" : "Ein IP-Adressbereich für die private virtuelle Schnittstelle (Private VIF). In der Regel wird dafür eine Größe von /30 aus dem IPv4-Bereich für lokale Verbindungen (168.254.x.x) verwendet.",
    "vmc-migration-task-detail.direct-connect-description-4" : "Eine BGP-ASN (Autonome Systemnummer) sowohl für die lokale Seite der Verbindung als auch für das SDDC.",
    "vmc-migration-task-detail.download-hlm-gateway-1" : "Laden Sie die vCenter Cloud Gateway Appliance herunter, wenn Sie Ihr VMware Cloud on AWS-vCenter mit Ihrer lokalen vCenter Single Sign-On-Domäne unter Verwendung des Hybrid Linked Mode verknüpfen möchten. Mit dem Hybrid Linked Mode können Sie Ihr Cloud-SDDC und Ihr lokales Datencenter über dieselbe Schnittstelle anzeigen und verwalten und den Fortschritt von Aufgaben wie Migrationen einfacher überwachen.",
    "vmc-migration-task-detail.download-hlm-gateway-2" : "Um den Hybrid Linked Mode zu konfigurieren, stellen Sie die vCenter Cloud Gateway Appliance in Ihrem lokalen Datencenter bereit und geben Sie Ihre vCenter Single Sign-On-Anmeldeinformationen an. Anschließend verknüpfen Sie die vCenter Cloud Gateway Appliance mit Ihrem Cloud-SDDC.",
    "vmc-migration-task-detail.enable-log-intelligence" : "vRealize Log Insight Cloud bietet einen vollständig verwalteten und integrierten Protokollanalyse- und Fehlerbehebungsdienst. Es handelt sich um einen empfohlenen Dienst, um die Sichtbarkeit Ihrer VMware Cloud on AWS-Umgebung zu ermöglichen.",
    "vmc-migration-task-detail.etc" : "ETC",
    "vmc-migration-task-detail.firewall-rule" : "Vorgehensweise zum Konfigurieren von Firewallregeln für das Verwaltungs-Gateway",
    "vmc-migration-task-detail.gateway-appliance" : "Cloud Gateway Appliance herunterladen",
    "vmc-migration-task-detail.get-instruction" : "Anweisungen abrufen",
    "vmc-migration-task-detail.get-started" : "Beginnen",
    "vmc-migration-task-detail.get-to-know-vmc" : "Mit VMware Cloud on AWS können Sie eine vSphere-basierte Cloud auf einer AWS-Infrastruktur erstellen. Lesen Sie die zugehörigen Dokumente, um mehr darüber zu erfahren, wie Sie das Onboarding umsetzen.",
    "vmc-migration-task-detail.get-to-know-vmc-description-1" : "Mit VMware Cloud on AWS können Sie eine vSphere-basierte Cloud auf einer AWS-Infrastruktur erstellen. Überprüfen Sie die zugehörigen Dokumente, um mehr über das Onboarding zu erfahren.",
    "vmc-migration-task-detail.get-to-know-vmc-description-2" : "Bevor Sie mit dem nächsten Schritt fortfahren, sollten Sie Folgendes tun:",
    "vmc-migration-task-detail.get-to-know-vmc-description-3" : "Lernen Sie die grundlegenden Komponenten eines VMware Cloud on AWS-SDDC kennen, einschließlich vSphere, vSAN und NSX-T.",
    "vmc-migration-task-detail.get-to-know-vmc-description-4" : "Machen Sie sich mit dem Zweck eines Organisationskontos vertraut und identifizieren Sie den Benutzer, der das Organisationskonto erstellt.",
    "vmc-migration-task-detail.get-to-know-vmc-description-5" : "Machen Sie sich mit dem Zweck Ihres AWS-Kundenkontos und dem Vorgang zum Verknüpfen dieses Kontos mit Ihrem VMware Cloud on AWS-SDDC vertraut.",
    "vmc-migration-task-detail.hcx-aws" : "VMware HCX in VMware Cloud on AWS",
    "vmc-migration-task-detail.hcx-deployment" : "Planen von Private-zu-Public-Bereitstellungen mit VMware HCX",
    "vmc-migration-task-detail.hcx-direct-connect" : "Konfigurieren von VMware HCX für Direct Connect",
    "vmc-migration-task-detail.hcx-networking" : "Übersicht über das VMware HCX-Netzwerk",
    "vmc-migration-task-detail.hcx-overview" : "VMware HCX – Übersicht",
    "vmc-migration-task-detail.hub-and-spoke" : "Hub-and-Spoke: Zum Verbinden einer großen Anzahl an VPCs miteinander ist oft die Verwendung eines Designs mit Transit VPC oder Transit Gateway nützlich.",
    "vmc-migration-task-detail.hybrid-link-mode" : "Vorgehensweise zum Einrichten des Hybrid Linked Mode",
    "vmc-migration-task-detail.identify-compute-ip-range" : "Computing-IP-Bereiche des SDDC identifizieren",
    "vmc-migration-task-detail.ip-range" : "Vorgehensweise zum Identifizieren des IP-Bereichs für die SDDC-Verwaltung beim Erstellen eines SDDCs",
    "vmc-migration-task-detail.ipsec-vpn" : "IPsec-VPN",
    "vmc-migration-task-detail.ipsec-vpn-description-1" : "Ein IPsec-VPN kann als Mittel zur Bereitstellung einer verschlüsselten Verbindung zu einem VMware Cloud on AWS-SDDC verwendet werden. Obwohl sowohl ein richtlinienbasiertes als auch ein routenbasiertes VPN unterstützt wird, wird ein routenbasiertes VPN aufgrund seiner Flexibilität empfohlen.",
    "vmc-migration-task-detail.ipsec-vpn-description-2" : "Zum Konfigurieren eines routenbasierten IPsec-VPN benötigen Sie die folgenden Elemente:",
    "vmc-migration-task-detail.ipsec-vpn-description-3" : "Ein IP-Adressbereich für das Virtual Tunnel Interface (VTI). In der Regel wird dafür eine Größe von /30 aus dem IPv4-Bereich für lokale Verbindungen (168.254.x.x) verwendet.",
    "vmc-migration-task-detail.ipsec-vpn-description-4" : "Eine BGP-ASN (Autonome Systemnummer) sowohl für die lokale Seite der Verbindung als auch für das SDDC.",
    "vmc-migration-task-detail.ipsec-vpn-description-5" : "Weitere Informationen zum Konfigurieren des IPsec-VPN finden Sie in der Dokumentation.",
    "vmc-migration-task-detail.launch-vmc-sizer" : "VMC Sizer starten",
    "vmc-migration-task-detail.launch-vmware-cloud-on-aws" : "VMware Cloud on AWS starten",
    "vmc-migration-task-detail.launch-vrealize-log" : "vRealize Log Insight Cloud starten",
    "vmc-migration-task-detail.management-ip-range" : "IP-Bereich der SDDC-Verwaltung identifizieren",
    "vmc-migration-task-detail.mark-as-completed" : "Als abgeschlossen markieren",
    "vmc-migration-task-detail.memory-utilization" : "Arbeitsspeichernutzung",
    "vmc-migration-task-detail.migrate-by-wave" : "Nachdem Sie HCX installiert und vollständig getestet haben, können Sie mit Arbeitslastmigrationen beginnen. Migrationen sollten in Wellen durchgeführt werden. Jede der Migrationswellen sollte Validierung und Tests durch Endbenutzer umfassen, um sicherzustellen, dass jede Phase der Migration erfolgreich war.",
    "vmc-migration-task-detail.migrate-vm-hcx" : "Migrieren von virtuellen Maschinen mit VMware HCX",
    "vmc-migration-task-detail.network-segment" : "Vorgehensweise zum Erstellen eines Netzwerksegments",
    "vmc-migration-task-detail.prepare-aws-resources-description-1" : "Das Erstellen eines VMware Cloud on AWS-SDDC erfordert, dass Sie eine Verknüpfung zu einem kundeneigenen AWS-Konto herstellen. Nachstehend finden Sie einige wichtige Punkte zum kundeneigenen AWS-Konto:",
    "vmc-migration-task-detail.prepare-aws-resources-description-2" : "Zum Erstellen eines SDDC ist ein kundeneigenes AWS-Konto erforderlich.",
    "vmc-migration-task-detail.prepare-aws-resources-description-3" : "Das kundeneigene AWS-Konto wird benötigt, um dem SDDC Zugriff auf AWS-Dienste zu gewähren.",
    "vmc-migration-task-detail.prepare-aws-resources-description-4" : "Das kundeneigene AWS-Konto gehört dem Kunden, nicht VMware.",
    "vmc-migration-task-detail.prepare-aws-resources-description-5" : "Die Abrechnung für das AWS-Konto wird direkt über AWS abgewickelt.",
    "vmc-migration-task-detail.prepare-aws-resources-description-6" : "Identifizieren Sie das zu verwendende AWS-Konto oder erstellen Sie ein neues AWS-Konto. Erstellen Sie ein dediziertes Subnetz in der gewünschten AWS-Verfügbarkeitszone in der VPC Ihres kundeneigenen AWS-Kontos. Die minimale Subnetzgröße beträgt /26 in CIDR-Notation.",
    "vmc-migration-task-detail.prepare-network-connection-description" : "Das Herstellen einer Verbindung von Ihrem lokalen Datencenter zu einem VMware Cloud on AWS-SDDC kann auf verschiedene Arten erfolgen. Wählen Sie die Methode aus, die für Ihre Umgebung am besten funktioniert.",
    "vmc-migration-task-detail.prepare-network-dns" : "Standardmäßig ist Ihr VMware Cloud on AWS-SDDC für die Verwendung von öffentlichen DNS-Servern konfiguriert. Sie können jedoch private DNS-Server als Alternative verwenden. Ein privater DNS-Server wird häufig verwendet, wenn ein SDDC in lokale oder andere private Netzwerke integriert wird, da dies die DNS-Auflösung für Arbeitslasten innerhalb dieser privaten Netzwerke ermöglicht.",
    "vmc-migration-task-detail.public-internet" : "Öffentliches Internet",
    "vmc-migration-task-detail.public-internet.description-1" : "Obwohl eine sichere Konnektivität zu einem VMware Cloud on AWS-SDDC empfohlen wird, kann auf Arbeitslasten innerhalb des SDDC direkt über die öffentliche IP-Adresse im Internet zugegriffen werden. Im Rahmen der Erstkonfiguration wurde vCenter Server innerhalb des SDDC vorab mit einer öffentlichen IP bereitgestellt. Dadurch können Sie direkt über HTTPS mithilfe dieser öffentlichen IP auf vCenter Server zugreifen, indem Sie den Zugriff über das Verwaltungs-Gateway mithilfe der Gateway-Firewall zulassen. Bei Bedarf können Sie zusätzliche öffentliche IP-Adressen für das SDDC anfordern und NAT für Computing-VMs konfigurieren.",
    "vmc-migration-task-detail.public-internet.description-2" : "Weitere Informationen zum Konfigurieren der Gateway-Firewall und Anfordern von öffentlichen IPs finden Sie in der Dokumentation.",
    "vmc-migration-task-detail.related-articles" : "Verwandte Artikel",
    "vmc-migration-task-detail.request-public-ip" : "Vorgehensweise zum Abrufen einer öffentlichen IP-Adresse",
    "vmc-migration-task-detail.size" : "Größe",
    "vmc-migration-task-detail.size-workloads-description" : "Das VMware Cloud on AWS Sizer- und TCO-Tool unterstützt Sie bei der Schätzung der Anzahl der Hosts, die zum Ausführen Ihrer Arbeitslasten in VMware Cloud on AWS erforderlich sind. Verwenden Sie die Daten, die Sie über Ihre lokalen Arbeitslasten erfasst haben, um die Größe Ihres VMware Cloud on AWS-SDDC schätzen zu können.",
    "vmc-migration-task-detail.sizer-tco" : "Vorgehensweise zum Abrufen eines VMware Cloud on AWS-Dimensionierungs und -TCO-Modells",
    "vmc-migration-task-detail.sizer-work-flow-description" : "Je nach dem Typ Ihrer Arbeitslast bietet das VMware Cloud on AWS Sizer- und TCO-Tool sinnvolle Standardwerte als Ausgangspunkt. Überschreiben Sie diese Standardeinstellungen je nach den Informationen, die Sie in Ihrer lokalen Umgebung erfasst haben, und entsprechend Ihrer Erwartungen bezüglich der Arbeitslasten in VMware Cloud on AWS. Die Empfehlung enthält die geschätzte Anzahl an Hosts, die zum Ausführen Ihrer migrierten Arbeitslasten in VMware Cloud on AWS erforderlich sind. Die Empfehlung enthält darüber hinaus zusätzliche Informationen, die Aufschluss darüber geben, wie Ihre Cloud-Kapazität genutzt wird.",
    "vmc-migration-task-detail.storage-per-vm" : "Speicher pro VM (GB)",
    "vmc-migration-task-detail.team-subscription" : "Vorgehensweise zum Erstellen eines Teamabonnements in VMware Cloud on AWS",
    "vmc-migration-task-detail.test-migration" : "Die ordnungsgemäße Installation von HCX erfordert ein gewisses Maß an Vorbereitung. Nachdem Sie die cloudseitigen HCX-Komponenten aktiviert haben, installieren Sie die lokalen Komponenten. Testen Sie Ihre HCX-Installation, bevor Sie Arbeitslasten in das SDDC migrieren.",
    "vmc-migration-task-detail.total-count-of-vms" : "Gesamtanzahl der VMs",
    "vmc-migration-task-detail.uniqueness" : "Eindeutigkeit",
    "vmc-migration-task-detail.uniqueness-consideration" : "Sie sollten einen IP-Bereich bereitstellen, der innerhalb Ihrer Organisation eindeutig ist. Dies ist besonders wichtig, wenn Sie die Verbindung zu Ihrem SDDC über ein VPN oder über Direct Connect herstellen oder wenn Sie eine Querverbindung mit einer Produktions-VPC herstellen.",
    "vmc-migration-task-detail.vcpu-per-core" : "vCPU/Kern",
    "vmc-migration-task-detail.view-hybrid-cloud-extension" : "VMware HCX anzeigen",
    "vmc-migration-task-detail.view-network-insight" : "VRealize Network Insight Cloud anzeigen",
    "vmc-migration-task-detail.view-vmware.hcx" : "VMware HCX anzeigen",
    "vmc-migration-task-detail.vmc-sizer-required-input" : "Das VMware Cloud on AWS Sizer- und TCO-Tool erfordert eine Reihe von Eingaben. Zu den Eingaben gehören:",
    "vmc-migration-task-detail.vpn-connectivity" : "Konfigurieren der VPN-Konnektivität mit dem lokalen Datencenter",
    "vmc-migration-task-detail.vrealize-li-aws" : "Vorgehensweise zum Aktivieren von vRealize Log Insight Cloud für ein VMware Cloud on AWS-SDDC",
    "vmc-migration-task-detail.vrealize-ni" : "Vorgehensweise zum Verwenden von vRealize Network Insight Cloud für die Migration von Anwendungen",
    "vmc-migration-task-detailvrealize-li." : "Was ist vRealize Log Insight Cloud?",
    "vmc-migration.task-translation.analyze-onprem-workload" : "Lokale Arbeitslasten analysieren",
    "vmc-migration.task-translation.build" : "Erstellen",
    "vmc-migration.task-translation.build-cloud-overview" : "In der Erstellungsphase erstellen Sie Ihre VMware Cloud on AWS-Infrastruktur basierend auf den Anforderungen, die Sie in der Planungsphase festgelegt haben. Sie erstellen ein Cloud-SDDC und konfigurieren es so, dass es für die Ausführung Ihrer Arbeitslasten bereit ist.",
    "vmc-migration.task-translation.build-cloud-title" : "Cloud-Umgebung erstellen",
    "vmc-migration.task-translation.create-vmc-on-aws-account" : "VMware Cloud on AWS-Konto erstellen",
    "vmc-migration.task-translation.enable-log" : "vRealize Log Insight Cloud aktivieren (optional)",
    "vmc-migration.task-translation.migrate" : "Migrieren",
    "vmc-migration.task-translation.migrate-workloads-overview" : "In der Migrationsphase konfigurieren Sie HCX, richten einen Tunnel zum Migrieren Ihrer Arbeitslasten ein und testen das Ergebnis der Migration mit Anwendungsbenutzern. Am Ende dieser Phase haben Sie erfolgreich virtuelle Maschinen aus Ihrem lokalen Datencenter zu VMware Cloud on AWS migriert.",
    "vmc-migration.task-translation.migrate-workloads-title" : "Arbeitslasten zur Cloud migrieren",
    "vmc-migration.task-translation.plan" : "Plan",
    "vmc-migration.task-translation.plan-migration-overview" : "In der Planungsphase erhalten Sie Informationen zur VMware Cloud on AWS-Plattform, überprüfen die Größe Ihrer lokalen Arbeitslasten und ermitteln die für diese Arbeitslasten erforderlichen Netzwerk-, Sicherheits- und anderen Ressourcen. Mit diesen Informationen können Sie die Größe und Konfiguration Ihrer VMware Cloud on AWS-Infrastruktur bestimmen. Die Planung ist eine sehr wichtige Phase. Sie ist die Grundlage für Ihre Migration.",
    "vmc-migration.task-translation.plan-migration-title" : "Migration planen",
    "vmc-migration.task-translation.prepare-aws-resources" : "AWS-Ressourcen vorbereiten",
    "vmc-migration.task-translation.prepare-network-ranges" : "Netzwerkbereiche vorbereiten",
    "vmc-migration.task-translation.sronly-build" : "Details zur Erstellungsphase anzeigen",
    "vmc-migration.task-translation.sronly-migrate" : "Details zur Migrationsphase anzeigen",
    "vmc-migration.task-translation.sronly-plan" : "Details zur Planungsphase anzeigen",
    "vmc-migration.task-translation.stage-one" : "Phase 1",
    "vmc-migration.task-translation.stage-three" : "Phase 3",
    "vmc-migration.task-translation.stage-two" : "Phase 2",
    "vmc-migration.task-translation.task.analyze-network" : "Netzwerkabhängigkeiten analysieren (optional)",
    "vmc-migration.task-translation.task.aws-connectivity" : "Intra-AWS-Konnektivität konfigurieren",
    "vmc-migration.task-translation.task.configure-network" : "Netzwerk konfigurieren",
    "vmc-migration.task-translation.task.create-sddc" : "SDDC erstellen",
    "vmc-migration.task-translation.task.download-gateway" : "HLM-Gateway herunterladen (optional)",
    "vmc-migration.task-translation.task.get-to-know-vmc" : "VMware Cloud on AWS kennenlernen",
    "vmc-migration.task-translation.task.install-test-hcx" : "Installieren und Testen von HCX",
    "vmc-migration.task-translation.task.migrate-wave" : "Nach Welle migrieren",
    "vmc-migration.task-translation.task.network-connection" : "Auf Netzwerkverbindung vorbereiten",
    "vmc-migration.task-translation.task.plan-migration" : "Planung für die Migration",
    "vmc-migration.task-translation.task.prepare-dns-strategy" : "DNS-Strategie vorbereiten",
    "vmc-migration.task-translation.task.size-workload" : "Arbeitslasten dimensionieren",
    "welcome-home.aws-title" : "VMware Cloud on AWS",
    "welcome-home.infrastructure-label" : "Unterstützte Infrastruktur:"
  }
}