{
  "component" : "vmw-migration",
  "locale" : "fr",
  "messages" : {
    "migration.resource-content.video-poster-img-alt-txt" : "Vidéo de démonstration",
    "migration.task.detail.compute-ip-range" : "Pour provisionner des charges de travail de calcul dans le SDDC, vous devez créer au moins un segment de réseau de calcul. Bien qu'il ne soit pas nécessaire de provisionner un SDDC, VMware recommande d'allouer au moins une plage d'adresses IP au réseau de calcul du SDDC. Une fois le SDDC provisionné, vous pouvez créer un segment de réseau à l'aide de cette plage d'adresses.",
    "migration.task.detail.create-sddc-step-2" : "Nombre et type d'hôtes à déployer",
    "migration.task.detail.create-sddc-step-3" : "Si vous souhaitez créer un cluster dans une zone AZ unique ou un cluster étendu qui couvre plusieurs zones",
    "migration.task.detail.move-back" : "revenir en arrière",
    "migration.task.detail.prepare-network-ranges" : "Lorsque vous créez un SDDC, vous devez spécifier une plage d'adresses IP pour votre réseau de gestion. Cette plage d'adresses IP ne peut pas être modifiée après la création du SDDC. Par conséquent, il est essentiel de planifier soigneusement cette plage d'adresses IP.",
    "migration.task.detail.size-consideration" : "La plage doit être suffisamment grande pour intégrer l'ensemble des hôtes qui seront déployés le premier jour, mais doit également tenir compte de la croissance future",
    "task-detail.direct-connect-description-5" : "Pour plus d'informations sur la configuration de Direct Connect, consultez la documentation.",
    "vmc-migration-journey.browser-title" : "Parcours de migration",
    "vmc-migration-journey.cancel" : "annuler",
    "vmc-migration-journey.get-started" : "démarrage",
    "vmc-migration-journey.reset" : "Réinitialiser",
    "vmc-migration-journey.reset-btn-txt" : "Réinitialiser",
    "vmc-migration-journey.reset-confirmation" : "Cette action va effacer la progression et définira l'état de chaque étape sur « Non commencé ». Cette opération ne peut pas être annulée. Voulez-vous vraiment réinitialiser toutes les tâches?",
    "vmc-migration-journey.reset-err-alert-desc" : "Échec de la réinitialisation de l'état de toutes les tâches. Veuillez réessayer.",
    "vmc-migration-journey.reset-err-alert-title" : "Échec de la réinitialisation.",
    "vmc-migration-journey.reset-modal.reset-confirmation" : "Cette action effacera la progression et définira l'état de chaque étape sur « Non commencé ». Cette opération ne peut pas être annulée. Voulez-vous vraiment réinitialiser toutes les tâches ?",
    "vmc-migration-journey.reset-modal.reset-tasks" : "Réinitialiser toutes les tâches",
    "vmc-migration-journey.reset-success-alert-desc" : "Réinitialisation réussie de l'état de toutes les tâches.",
    "vmc-migration-journey.reset-success-alert-title" : "Réinitialisation réussie.",
    "vmc-migration-journey.reset-tasks" : "Réinitialiser toutes les tâches",
    "vmc-migration-journey.reset-tracking" : "Pour redémarrer le parcours, cliquez sur <strong>Réinitialiser</strong>. Cette action efface la progression et définit l'état de toutes les étapes sur « Non démarré ».\n    ",
    "vmc-migration-journey.title" : "Votre parcours de migration commence ici !",
    "vmc-migration-journey.view-details" : "Afficher les détails",
    "vmc-migration-overview.browser-title" : "Présentation de la migration",
    "vmc-migration-overview.build-cloud-environment" : "Créer votre environnement de cloud",
    "vmc-migration-overview.build-overview" : "Lors de la phase de création, vous allez créer votre infrastructure VMware Cloud on AWS en fonction des besoins que vous avez déterminés dans la phase de planification. Vous allez créer un SDDC de cloud et le configurer pour qu'il soit prêt à exécuter vos charges de travail.",
    "vmc-migration-overview.getting-started" : "Démarrage",
    "vmc-migration-overview.migrate-overview" : "Lors de la phase de migration, vous allez configurer HCX et établir un tunnel que vous utiliserez pour migrer vos charges de travail. Vous allez également tester le résultat de la migration avec les utilisateurs d'application. À la fin de cette étape, vous aurez migré les machines virtuelles de votre centre de données sur site vers VMware Cloud on AWS.",
    "vmc-migration-overview.migrate-your-workloads" : "Migrer vos charges de travail",
    "vmc-migration-overview.plan-overview" : "Lors de la phase de planification, vous allez découvrir la plate-forme VMware Cloud on AWS, évaluer la taille de vos charges de travail sur site et déterminer la mise en réseau, la sécurité et d'autres ressources requises pour prendre en charge ces charges de travail. Ces informations vous aideront à déterminer la taille et la configuration de votre infrastructure VMware Cloud on AWS. La planification est une étape très importante, qui permet de créer des fondations pour votre migration.",
    "vmc-migration-overview.plan-your-migration" : "Planifier votre migration",
    "vmc-migration-overview.sub-title" : "Guide de migration étape par étape pour votre projet de migration de centre de données vers VMware Cloud on AWS.",
    "vmc-migration-overview.technical-overview" : "Présentation technique",
    "vmc-migration-overview.technical-overview-stage-description" : "À chaque étape du processus, la solution de migration VMware Cloud fournit des instructions, des outils et des liens vers des informations supplémentaires requises pour effectuer la migration. Vous pouvez également utiliser la solution de migration pour suivre votre progression à chaque étape. À la fin de ce processus guidé, vous aurez migré les machines virtuelles de votre centre de données sur site vers VMware Cloud on AWS.",
    "vmc-migration-overview.technical-overview-stages" : "La solution de migration VMware Cloud vous guide tout au long de la migration de machines virtuelles de votre centre de données sur site vers VMware Cloud on AWS. Le processus de migration s'effectue en trois temps : planifier, créer et migrer. Chaque étape est divisée en une série d'étapes dépendant les unes des autres pour vous guider tout au long de la migration.",
    "vmc-migration-overview.title" : "Migration",
    "vmc-migration-resource-content.demo-videos.introduction" : "Découvrez comment vous pouvez migrer les charges de travail vers un SDDC VMware Cloud on AWS.",
    "vmc-migration-resource-content.demo-videos.page-title" : "Vidéos de démonstration : migration",
    "vmc-migration-resource-content.office-hours.introduction" : "Contactez l'équipe de gestion clientèle de VMware aux heures de bureau afin d'obtenir des réponses à vos questions relatives à la migration.",
    "vmc-migration-resource-content.office-hours.page-title" : "Heures de bureau : migration",
    "vmc-migration-resource-content.past-sessions" : "afficher les sessions passées",
    "vmc-migration-resource-content.play-video" : "Lire la vidéo : guide du praticien",
    "vmc-migration-resource-content.quick-reference.btn-txt" : "afficher la référence",
    "vmc-migration-resource-content.quick-reference.introduction" : "Ce guide de référence rapide fournit aux praticiens des éléments clés à prendre en compte avant, pendant et après la migration cloud.",
    "vmc-migration-resource-content.quick-reference.page-title" : "Référence rapide du praticien pour la migration cloud\n            ",
    "vmc-migration-resource-content.reference-architecture.btn-txt" : "afficher l'architecture",
    "vmc-migration-resource-content.reference-architecture.introduction" : "L'architecture de référence fournit des instructions génériques pour commencer à déployer des applications hybrides standard sur VMware Cloud on AWS accessibles par les utilisateurs locaux.",
    "vmc-migration-resource-content.reference-architecture.page-title" : "Architecture de référence : migration cloud avec VMware Cloud on AWS",
    "vmc-migration-resource-content.register-session" : "enregistrer pour une session",
    "vmc-migration-resource-content.solution-brief.btn-txt" : "afficher la présentation de la solution",
    "vmc-migration-resource-content.solution-brief.introduction" : "Cette solution présente les défis de migration cloud, comment VMware Cloud on AWS relève ces défis et les capacités clés de VMware Cloud on AWS spécifiques des cas d'utilisation de la migration cloud.",
    "vmc-migration-resource-content.solution-brief.page-title" : "Présentation de la solution : migration cloud avec VMware Cloud on AWS",
    "vmc-migration-resource-content.view-more" : "afficher plus",
    "vmc-migration-resource-content.whitepapers.btn-txt" : "afficher le livre blanc",
    "vmc-migration-resource-content.whitepapers.introduction" : "Ce livre blanc traite du cloud hybride, de ses cas d'utilisation, de ses défis et de ses opportunités, ainsi que de la manière dont VMware Cloud on AWS relève ces défis.\n            ",
    "vmc-migration-resource-content.whitepapers.page-title" : "Livre blanc : Cloud hybride avec migration et VMware Cloud on AWS",
    "vmc-migration-resources.browser-title" : "Ressources de migration",
    "vmc-migration-resources.demo-videos" : "Vidéos de démonstration",
    "vmc-migration-resources.office-hours" : "Heures de bureau",
    "vmc-migration-resources.quick-reference" : "Référence rapide du praticien",
    "vmc-migration-resources.reference-architecture" : "Architecture de référence",
    "vmc-migration-resources.solution-brief" : "Présentation de la solution",
    "vmc-migration-resources.whitepapers" : "Livres blancs",
    "vmc-migration-stage-detail.action" : "Action",
    "vmc-migration-stage-detail.back" : "retour",
    "vmc-migration-stage-detail.browser-title.build" : "Créer un environnement de cloud",
    "vmc-migration-stage-detail.browser-title.migrate" : "Migrer vers le cloud",
    "vmc-migration-stage-detail.browser-title.plan" : "Planifier la migration",
    "vmc-migration-stage-detail.build-what-next" : "À l'étape suivante, votre objectif est de migrer les charges de travail vers VMware Cloud on AWS. À la fin de l'étape, les charges de travail seront migrées et exécutées dans votre SDDC sur VMware Cloud on AWS.",
    "vmc-migration-stage-detail.cancel" : "Annuler",
    "vmc-migration-stage-detail.dont-ask-me-again" : "Ne plus me demander.",
    "vmc-migration-stage-detail.error" : "Erreur : échec de l'opération.",
    "vmc-migration-stage-detail.fetching-data" : "Extraction des données",
    "vmc-migration-stage-detail.go-back-to-journey" : "revenir à la page de bienvenue",
    "vmc-migration-stage-detail.go-to-next-phase" : "Passer à l'étape {0}",
    "vmc-migration-stage-detail.log-in" : "Se connecter",
    "vmc-migration-stage-detail.login-description" : "Vous devez vous connecter à VMware Cloud Services pour enregistrer votre progression.",
    "vmc-migration-stage-detail.login-required" : "Connexion requise",
    "vmc-migration-stage-detail.migration-task" : "Tâche de migration",
    "vmc-migration-stage-detail.not-yet" : "Pas encore",
    "vmc-migration-stage-detail.plan-what-next" : "À l'étape suivante, votre objectif est de créer et de configurer votre SDDC VMware Cloud on AWS. À la fin de l'étape, vous aurez créé un environnement de cloud avec la connectivité réseau souhaitée, la gestion de l'écran unique et l'accès à votre environnement de cloud.",
    "vmc-migration-stage-detail.request-access-moadal.description" : "Pour commencer avec VMware Cloud on AWS dans l'organisation, vous devez demander un accès sur les pages de marketing du produit VMware Cloud.",
    "vmc-migration-stage-detail.request-access-moadal.learn-more-btn" : "En savoir plus",
    "vmc-migration-stage-detail.request-access-moadal.title" : "Demander l'accès à VMware Cloud on AWS",
    "vmc-migration-stage-detail.required-modal.cancel-btn-text" : "Annuler",
    "vmc-migration-stage-detail.required-modal.description" : "Vous devez vous connecter pour enregistrer votre progression.",
    "vmc-migration-stage-detail.required-modal.submit-btn-text" : "Se connecter",
    "vmc-migration-stage-detail.required-modal.title" : "Connexion requise",
    "vmc-migration-stage-detail.status" : "État",
    "vmc-migration-stage-detail.success-build" : "Excellent travail sur la vérification de tous les éléments lors de la phase de création. Maintenant, vous devez continuer votre voyage vers la phase suivante.",
    "vmc-migration-stage-detail.success-migrate" : "Félicitations ! Vous devez désormais avoir terminé votre projet de migration de centre de données.",
    "vmc-migration-stage-detail.success-plan" : "Excellent travail sur la vérification de tous les éléments lors de la phase de planification. Vous devez maintenant poursuivre votre parcours vers la phase suivante.",
    "vmc-migration-stage-detail.task" : "Tâche",
    "vmc-migration-stage-detail.track-any-way" : "Suivre quand même",
    "vmc-migration-stage-detail.tracking-alert" : "Alerte de suivi",
    "vmc-migration-stage-detail.tracking-alert-description" : "Vous n'avez pas terminé toutes les étapes précédentes. Voulez-vous commencer le suivi de cette étape ?",
    "vmc-migration-stage-detail.updated" : "Mise à jour effectuée",
    "vmc-migration-stage-detail.whats-next" : "Prochaines étapes",
    "vmc-migration-status-badge.completed" : "Terminé",
    "vmc-migration-status-badge.in-progress" : "En cours",
    "vmc-migration-status-badge.not-started" : "Non démarrée",
    "vmc-migration-status-badge.skipped" : "Ignoré",
    "vmc-migration-status-dropdown.change-status" : "Modifier l'état",
    "vmc-migration-status-dropdown.change-status-for" : "Modifier l'état de la tâche actuelle",
    "vmc-migration-status-dropdown.completed" : "Terminé",
    "vmc-migration-status-dropdown.in-progress" : "En cours",
    "vmc-migration-status-dropdown.not-started" : "Non démarrée",
    "vmc-migration-status-dropdown.set-status-to" : "Définir l'état sur",
    "vmc-migration-status-dropdown.skipped" : "Ignoré",
    "vmc-migration-task-detail.access-aws" : "Comment accéder aux services AWS ?",
    "vmc-migration-task-detail.account-creation" : "Création et gestion de compte VMware",
    "vmc-migration-task-detail.analyze-network-description-1" : "Vous pouvez éventuellement utiliser vRealize Network Insight Cloud pour faciliter l'identification des dépendances de réseau de machine virtuelle. Ignorez cette étape si vous savez déjà quelles machines virtuelles vous souhaitez migrer vers VMware Cloud on AWS.",
    "vmc-migration-task-detail.analyze-network-description-2" : "Le mappage de dépendance réseau vous indique quelles machines virtuelles communiquent entre elles. Les machines virtuelles qui communiquent doivent être migrées ensemble pour éviter les frais de trafic réseau, les latences et autres problèmes de performances.",
    "vmc-migration-task-detail.analyze-network-description-3" : "Déterminez la carte de dépendance réseau à l'aide du service de vRealize Network Insight Cloud. vRealize Network Insight Cloud est un service de cloud qui vous fournit une vue détaillée de votre réseau et vous permet de créer une infrastructure réseau optimisée, hautement disponible et sécurisée dans des environnements multi-cloud.",
    "vmc-migration-task-detail.analyze-on-premises-workload-description-1" : "La migration cloud est souvent un processus itératif et doit être effectuée par « vagues » (c'est-à-dire, plusieurs groupes de machines virtuelles qui sont migrées au même moment). Identifiez les charges de travail à migrer vers le cloud et classez-les par catégorie en fonction de la facilité de leur migration. Par exemple, les charges de travail de développement ou de transfert peuvent être considérées comme « faciles », car elles sont souvent moins critiques pour la production. Les charges de travail volumineuses et/ou d'E/S intensives, telles que les bases de données, sont peut-être plus difficiles à déplacer et doivent être migrées en dernier. Lors de la catégorisation des charges de travail, il peut être utile de collecter et de vérifier les mesures d'E/S réseau et de stockage pour toutes les machines virtuelles qui doivent être migrées. Ces mesures seront utiles pour le processus de planification par vagues. ",
    "vmc-migration-task-detail.analyze-on-premises-workload-description-2" : "Une fois que vous avez identifié les machines virtuelles qui seront migrées et regroupé ces machines virtuelles en vagues de migration, l'étape suivante consiste à estimer les besoins totaux en matière de calcul, de mémoire et de stockage pour toutes les machines virtuelles. Ces informations sont requises afin de déterminer le nombre d'hôtes nécessaires à votre SDDC VMware Cloud on AWS.",
    "vmc-migration-task-detail.aws-direct-connect" : "AWS Direct Connect",
    "vmc-migration-task-detail.aws-vi" : "Que sont les interfaces virtuelles d'AWS Direct Connect ?",
    "vmc-migration-task-detail.back-to-choose" : "RETOUR À L'OPTION CHOISIR UN RÉSEAU",
    "vmc-migration-task-detail.boarding-handbook" : "Manuel d'intégration de VMware Cloud",
    "vmc-migration-task-detail.boarding-presentation" : "Présentation de l'intégration de VMware Cloud",
    "vmc-migration-task-detail.choose-method" : "Choisissez la méthode qui convient le mieux à votre environnement :",
    "vmc-migration-task-detail.compute-gateway" : "Comment ajouter une zone DNS de passerelle de calcul ?",
    "vmc-migration-task-detail.configure-aws-connectivity" : "Outre le VPC AWS à lien transversal que vous avez spécifié lors de la création du SDDC, vous pouvez éventuellement vous connecter à des ressources AWS faisant partie d'autres VPC. Bien que la stratégie exacte utilisée pour cette connectivité varie selon le client, les éléments suivants sont les plus couramment utilisés :",
    "vmc-migration-task-detail.configure-aws-connectivity-direct-via-ip-sec" : "Directe via IPSec : il est possible d'établir un VPN IPSec directement vers un VGW dans un VPC. Cette stratégie est utile pour la connexion à un petit nombre de VPC.",
    "vmc-migration-task-detail.configure-aws-dc" : "Configurer AWS Direct Connect pour VMware Cloud on AWS",
    "vmc-migration-task-detail.configure-hybrid-cloud-extension-description-1" : "La migration de charge de travail vers VMware Cloud on AWS est recommandée à l'aide de VMware HCX (anciennement appelé Hybrid Cloud Extension et NSX Hybrid Connect). HCX est une offre SaaS qui fournit une mobilité des applications et une hybridité de l'infrastructure sur différentes versions de vSphere, sur site et dans le cloud. Il est gratuit pour tous les clients de VMware Cloud on AWS.",
    "vmc-migration-task-detail.configure-hybrid-cloud-extension-description-2" : "La migration réussie des charges de travail vers le SDDC nécessite un degré de planification. Ce processus, appelé « planification par vagues » permet de garantir une migration facile et efficace vers VMware Cloud on AWS.",
    "vmc-migration-task-detail.configure-network-description" : "Une fois votre SDDC de cloud déployé, accédez à la console VMC et configurez le paramétrage réseau pour le SDDC. Vous pouvez choisir AWS Direct Connect, VPN IPSec ou vous pouvez également choisir de vous connecter via l'Internet public. Reportez-vous à l'étape de planification pour plus d'informations sur ces options.",
    "vmc-migration-task-detail.configure-vpn" : "Comment configurer une connexion VPN ?",
    "vmc-migration-task-detail.cpu-utilization" : "Utilisation du CPU",
    "vmc-migration-task-detail.create-sddc" : "Comment créer un SDDC sur VMware Cloud on AWS ?",
    "vmc-migration-task-detail.create-sddc-description-1" : "Un centre de données défini par logiciel est une unité de capacité dans laquelle vous pouvez exécuter vos charges de travail. À l'aide des informations que vous avez collectées à l'étape précédente pour créer votre SDDC sur VMware Cloud on AWS.",
    "vmc-migration-task-detail.create-sddc-description-2" : "Tenez compte des éléments suivants lorsque vous créez votre SDDC :",
    "vmc-migration-task-detail.create-sddc-step-1" : "Région dans laquelle vous souhaitez déployer votre SDDC",
    "vmc-migration-task-detail.create-vmc-on-aws-account-description-1" : "Les comptes VMware Cloud on AWS sont basés sur une ou plusieurs organisations. Créez ou connectez-vous à un compte VMware.",
    "vmc-migration-task-detail.create-vmc-on-aws-account-description-2" : "Créez un mode de paiement pour VMware Cloud on AWS et, le cas échéant, créez un abonnement. Les abonnements vous permettent de réaliser des économies en vous engageant à acheter une certaine quantité de capacité pour une période définie.",
    "vmc-migration-task-detail.deploy-hcx-console" : "Déploiement de VMware HCX Cloud depuis la console VMC",
    "vmc-migration-task-detail.direct-connect" : "Direct Connect : si Direct Connect est utilisé, il est possible de transiter entre plusieurs VPC via Direct Connect.",
    "vmc-migration-task-detail.direct-connect-aws" : "Qu'est-ce que Direct Connect on AWS ?",
    "vmc-migration-task-detail.direct-connect-description-1" : "Les SDDC VMware Cloud on AWS peuvent utiliser une ou plusieurs connexions Direct Connect existantes au sein du compte AWS détenu par le client. Une fois qu'une connexion Direct Connect a été provisionnée, vous pouvez créer un VIF privé et l'allouer au compte AWS détenu par VMware qui a été créé pour votre organisation de VMware Cloud Services. Ce numéro de compte est visible dans la console VMC sous le composant de l'interface utilisateur de Direct Connect d'un SDDC",
    "vmc-migration-task-detail.direct-connect-description-2" : "Pour intégrer Direct Connect, vous aurez besoin des éléments suivants :",
    "vmc-migration-task-detail.direct-connect-description-3" : "Plage d'adresses IP pour le VIF privé. En général, un /30 de la plage locale de liaison IPv4 (168.254.x.x) est utilisé dans ce cas.",
    "vmc-migration-task-detail.direct-connect-description-4" : "Un numéro de système autonome (ASN) BGP pour le côté sur site de la connexion et pour le SDDC.",
    "vmc-migration-task-detail.download-hlm-gateway-1" : "Téléchargez le dispositif vCenter Cloud Gateway Appliance si vous souhaitez lier votre vCenter VMware Cloud on AWS à votre domaine vCenter Single Sign-on sur site à l'aide du mode Hybrid Linked Mode. Le mode Hybrid Linked Mode vous permet d'afficher et de gérer votre SDDC de cloud et votre centre de données sur site à partir de la même interface et facilite la surveillance de l'avancement des tâches telles que la migration.",
    "vmc-migration-task-detail.download-hlm-gateway-2" : "Pour configurer le mode Hybrid Linked Mode, vous devez déployer le dispositif vCenter Cloud Gateway Appliance sur votre centre de données sur site et lui fournir vos informations d'identification vCenter Single Sign-on. Vous devez ensuite lier le dispositif vCenter Cloud Gateway Appliance à votre SDDC de cloud.",
    "vmc-migration-task-detail.enable-log-intelligence" : "vRealize Log Insight Cloud fournit un service d'analyse et de dépannage des journaux entièrement géré et intégré. Il s'agit d'un service recommandé pour activer la visibilité dans votre environnement VMware Cloud on AWS.",
    "vmc-migration-task-detail.etc" : "Etc",
    "vmc-migration-task-detail.firewall-rule" : "Comment configurer des règles de pare-feu pour la passerelle de gestion ?",
    "vmc-migration-task-detail.gateway-appliance" : "Télécharger Cloud Gateway Appliance",
    "vmc-migration-task-detail.get-instruction" : "Obtenir des instructions",
    "vmc-migration-task-detail.get-started" : "Démarrage",
    "vmc-migration-task-detail.get-to-know-vmc" : "VMware Cloud on AWS vous permet de créer un cloud basé sur vSphere sur une infrastructure AWS. Consultez la documentation associée pour en savoir plus son fonctionnement.",
    "vmc-migration-task-detail.get-to-know-vmc-description-1" : "VMware Cloud on AWS vous permet de créer un cloud basé sur vSphere sur une infrastructure AWS. Consultez la documentation associée pour en savoir plus sur l'intégration.",
    "vmc-migration-task-detail.get-to-know-vmc-description-2" : "Avant de passer à l'étape suivante, vous devez :",
    "vmc-migration-task-detail.get-to-know-vmc-description-3" : "Vous devez connaître les composants de base d'un SDDC VMware Cloud on AWS, notamment vSphere, vSAN et NSX-T.",
    "vmc-migration-task-detail.get-to-know-vmc-description-4" : "Vous devez comprendre l'intérêt d'un compte d'organisation et avoir identifié l'utilisateur qui créera le compte d'organisation.",
    "vmc-migration-task-detail.get-to-know-vmc-description-5" : "Vous devez comprendre l'intérêt de votre compte client AWS et le processus de liaison à votre SDDC VMware Cloud on AWS.",
    "vmc-migration-task-detail.hcx-aws" : "VMware HCX dans VMware Cloud on AWS",
    "vmc-migration-task-detail.hcx-deployment" : "Planification des déploiements privés vers publics de VMware HCX",
    "vmc-migration-task-detail.hcx-direct-connect" : "Configuration de VMware HCX pour Direct Connect",
    "vmc-migration-task-detail.hcx-networking" : "Présentation de la mise en réseau VMware HCX",
    "vmc-migration-task-detail.hcx-overview" : "Présentation de VMware HCX",
    "vmc-migration-task-detail.hub-and-spoke" : "Hub and Spoke (réseau en étoile) : pour l'interconnexion d'un grand nombre de VPC, il est souvent utile d'utiliser un VPC de transit ou une conception de passerelle de transit.",
    "vmc-migration-task-detail.hybrid-link-mode" : "Comment configurer le mode Hybrid Linked Mode ?",
    "vmc-migration-task-detail.identify-compute-ip-range" : "Identifier les plages d'adresses IP de calcul du SDDC",
    "vmc-migration-task-detail.ip-range" : "Comment identifier la plage d'adresses IP de gestion de SDDC lors de la création d'un SDDC ?",
    "vmc-migration-task-detail.ipsec-vpn" : "VPN IPsec",
    "vmc-migration-task-detail.ipsec-vpn-description-1" : "Le VPN IPSec peut être utilisé comme moyen de fournir une connexion chiffrée à un SDDC VMware Cloud on AWS. Bien que les VPN basés sur les stratégies et sur les routes soient tous deux pris en charge, un VPN basé sur les routes est recommandé en raison de sa flexibilité.",
    "vmc-migration-task-detail.ipsec-vpn-description-2" : "Afin de configurer un VPN IPSec basé sur les routes, vous aurez besoin des éléments suivants :",
    "vmc-migration-task-detail.ipsec-vpn-description-3" : "Plage d'adresses IP pour l'interface de tunnel virtuel (VTI). En général, un /30 de la plage locale de liaison IPv4 (168.254.x.x) est utilisé dans ce cas.",
    "vmc-migration-task-detail.ipsec-vpn-description-4" : "Un numéro de système autonome (ASN) BGP pour le côté sur site de la connexion et pour le SDDC.",
    "vmc-migration-task-detail.ipsec-vpn-description-5" : "Pour plus d'informations sur la configuration du VPN IPSec, reportez-vous à la documentation.",
    "vmc-migration-task-detail.launch-vmc-sizer" : "Lancer VMC Sizer",
    "vmc-migration-task-detail.launch-vmware-cloud-on-aws" : "Lancer VMware Cloud On AWS",
    "vmc-migration-task-detail.launch-vrealize-log" : "lancer vRealize Log Insight Cloud",
    "vmc-migration-task-detail.management-ip-range" : "Identifier la plage d'adresses IP de gestion du SDDC",
    "vmc-migration-task-detail.mark-as-completed" : "Marquer comme terminé",
    "vmc-migration-task-detail.memory-utilization" : "Utilisation de la mémoire",
    "vmc-migration-task-detail.migrate-by-wave" : "Une fois que vous avez installé et effectué un test complet de HCX, vous pouvez commencer les migrations des charges de travail. Les migrations doivent être effectuées par vagues, chaque vague doit inclure la validation de l'utilisateur final et un test pour s'assurer que chaque phase de la migration a réussi.",
    "vmc-migration-task-detail.migrate-vm-hcx" : "Migration de machines virtuelles avec VMware HCX",
    "vmc-migration-task-detail.network-segment" : "Comment créer un segment de réseau ?",
    "vmc-migration-task-detail.prepare-aws-resources-description-1" : "La création d'un SDDC VMware Cloud on AWS nécessite un lien vers un compte AWS détenu par un client. Voici quelques points importants concernant le compte AWS du client :",
    "vmc-migration-task-detail.prepare-aws-resources-description-2" : "Un compte AWS détenu par un client est requis pour créer un SDDC.",
    "vmc-migration-task-detail.prepare-aws-resources-description-3" : "Le compte AWS détenu par un client est nécessaire pour fournir l'accès aux services AWS au SDDC.",
    "vmc-migration-task-detail.prepare-aws-resources-description-4" : "Le compte AWS possédé par un client appartient au client, pas à VMware.",
    "vmc-migration-task-detail.prepare-aws-resources-description-5" : "La facturation du compte AWS est gérée directement via AWS.",
    "vmc-migration-task-detail.prepare-aws-resources-description-6" : "Identifiez le compte AWS que vous utiliserez ou créez un compte AWS. Créez un sous-réseau dédié dans la zone de disponibilité AWS souhaitée dans le VPC de votre compte AWS possédé par un client. La taille minimale du sous-réseau est de /26 en notation CIDR.",
    "vmc-migration-task-detail.prepare-network-connection-description" : "La connexion de votre centre de données sur site à un SDDC de VMware Cloud on AWS peut être effectuée de différentes manières. Choisissez la méthode qui convient le mieux à votre environnement.",
    "vmc-migration-task-detail.prepare-network-dns" : "Par défaut, votre SDDC VMware Cloud on AWS est configuré pour utiliser des serveurs DNS publics. Cependant, vous pouvez utiliser des serveurs DNS privés comme alternative. Un serveur DNS privé est souvent utilisé lors de l'intégration d'un SDDC à des réseaux sur site ou d'autres réseaux privés, car cela permet la résolution DNS pour les charges de travail au sein de ces réseaux privés.",
    "vmc-migration-task-detail.public-internet" : "Internet public",
    "vmc-migration-task-detail.public-internet.description-1" : "Même si la connectivité sécurisée à un SDDC VMware Cloud on AWS est recommandée, les charges de travail dans le SDDC peuvent être accédées directement via une adresse IP publique sur Internet. Dans le cadre de la configuration initiale, vCenter Server dans le SDDC a été précédemment provisionné avec une adresse IP publique. Par conséquent, vous pouvez accéder à vCenter Server directement via HTTPs sur cette adresse IP publique en autorisant l'accès via la passerelle de gestion à l'aide du pare-feu de passerelle. Si vous le souhaitez, vous pouvez demander des adresses IP publiques supplémentaires pour le SDDC et configurer la NAT pour les machines virtuelles de calcul.",
    "vmc-migration-task-detail.public-internet.description-2" : "Pour plus d'informations sur la configuration du pare-feu de passerelle et la demande d'adresses IP publiques, consultez la documentation.",
    "vmc-migration-task-detail.related-articles" : "Articles associés",
    "vmc-migration-task-detail.request-public-ip" : "Comment demander une adresse IP publique ?",
    "vmc-migration-task-detail.size" : "Taille",
    "vmc-migration-task-detail.size-workloads-description" : "L'outil de redimensionnement et de coût total de possession VMware Cloud on AWS vous aide à estimer le nombre d'hôtes requis pour exécuter vos charges de travail dans VMware Cloud on AWS. Utilisez les données que vous avez collectées sur vos charges de travail sur site pour obtenir une estimation de la taille de votre SDDC VMware Cloud on AWS.",
    "vmc-migration-task-detail.sizer-tco" : "Comment obtenir un modèle de redimensionnement et de coût total de possession VMware Cloud on AWS",
    "vmc-migration-task-detail.sizer-work-flow-description" : "En fonction de votre type de charges de travail, l'outil de redimensionnement et de coût total de possession VMware Cloud on AWS fournit des valeurs par défaut raisonnables comme point de départ. Remplacez ces valeurs par défaut en fonction des informations que vous avez collectées dans votre environnement sur site et de vos attentes pour les charges de travail de VMware Cloud on AWS. La recommandation inclut le nombre estimé d'hôtes requis pour exécuter vos charges de travail migrées sur VMware Cloud on AWS. La recommandation inclut également des informations supplémentaires pour fournir un aperçu de la manière dont votre capacité de cloud est utilisée.",
    "vmc-migration-task-detail.storage-per-vm" : "Stockage par machine virtuelle (Go)",
    "vmc-migration-task-detail.team-subscription" : "Comment créer un abonnement d'équipe dans VMware Cloud on AWS ?",
    "vmc-migration-task-detail.test-migration" : "Une installation correcte de HCX nécessite un certain niveau de préparation. Après avoir activé les composants HCX côté cloud, installez les composants sur site. Testez votre installation HCX avant de migrer les charges de travail vers le SDDC.",
    "vmc-migration-task-detail.total-count-of-vms" : "Nombre total de machines virtuelles",
    "vmc-migration-task-detail.uniqueness" : "Particularité",
    "vmc-migration-task-detail.uniqueness-consideration" : "Vous devez provisionner une plage d'adresses IP unique au sein de votre organisation. Cela est particulièrement important si vous devez vous connecter à votre SDDC via un VPN ou Direct Connect, ou si vous effectuez un lien transversal vers un VPC de production.",
    "vmc-migration-task-detail.vcpu-per-core" : "vCPU/Cœur",
    "vmc-migration-task-detail.view-hybrid-cloud-extension" : "Afficher VMware HCX",
    "vmc-migration-task-detail.view-network-insight" : "Afficher vRealize Network Insight Cloud",
    "vmc-migration-task-detail.view-vmware.hcx" : "Afficher VMware HCX",
    "vmc-migration-task-detail.vmc-sizer-required-input" : "L'outil de redimensionnement et de coût total de possession VMware Cloud on AWS requiert un certain nombre d'entrées. Ces entrées incluent :",
    "vmc-migration-task-detail.vpn-connectivity" : "Configurer la connectivité du VPN au centre de données sur site",
    "vmc-migration-task-detail.vrealize-li-aws" : "Comment activer vRealize Log Insight Cloud pour le SDDC VMware Cloud on AWS ?",
    "vmc-migration-task-detail.vrealize-ni" : "Comment utiliser vRealize Network Insight Cloud pour la migration d'applications ?",
    "vmc-migration-task-detailvrealize-li." : "Qu'est-ce que vRealize Log Insight Cloud ?",
    "vmc-migration.task-translation.analyze-onprem-workload" : "Analyser les charges de travail sur site",
    "vmc-migration.task-translation.build" : "Créer",
    "vmc-migration.task-translation.build-cloud-overview" : "Lors de la phase de création, vous allez créer votre infrastructure VMware Cloud on AWS en fonction des besoins que vous avez déterminés dans la phase de planification. Vous allez créer un SDDC de cloud et le configurer pour qu'il soit prêt à exécuter vos charges de travail.",
    "vmc-migration.task-translation.build-cloud-title" : "Créer votre environnement de cloud",
    "vmc-migration.task-translation.create-vmc-on-aws-account" : "Créer un compte VMware Cloud on AWS",
    "vmc-migration.task-translation.enable-log" : "Activer vRealize Log Insight Cloud (facultatif)",
    "vmc-migration.task-translation.migrate" : "Migrer",
    "vmc-migration.task-translation.migrate-workloads-overview" : "Lors de la phase de migration, vous allez configurer HCX et établir un tunnel que vous utiliserez pour migrer vos charges de travail. Vous allez également tester le résultat de la migration avec les utilisateurs d'application. À la fin de cette étape, vous aurez migré les machines virtuelles de votre centre de données sur site vers VMware Cloud on AWS.",
    "vmc-migration.task-translation.migrate-workloads-title" : "Migrer les charges de travail vers le cloud",
    "vmc-migration.task-translation.plan" : "Plan",
    "vmc-migration.task-translation.plan-migration-overview" : "Lors de la phase de planification, vous allez découvrir la plate-forme VMware Cloud on AWS, évaluer la taille de vos charges de travail sur site et déterminer la mise en réseau, la sécurité et d'autres ressources requises pour prendre en charge ces charges de travail. Ces informations vous aideront à déterminer la taille et la configuration de votre infrastructure VMware Cloud on AWS. La planification est une étape très importante, qui permet de créer des fondations pour votre migration.",
    "vmc-migration.task-translation.plan-migration-title" : "Planifier votre migration",
    "vmc-migration.task-translation.prepare-aws-resources" : "Préparer les ressources AWS",
    "vmc-migration.task-translation.prepare-network-ranges" : "Préparer les plages réseau",
    "vmc-migration.task-translation.sronly-build" : "afficher les détails de la phase de création",
    "vmc-migration.task-translation.sronly-migrate" : "afficher les détails de la phase de migration",
    "vmc-migration.task-translation.sronly-plan" : "afficher les détails de la phase de planification",
    "vmc-migration.task-translation.stage-one" : "Étape 1",
    "vmc-migration.task-translation.stage-three" : "Étape 3",
    "vmc-migration.task-translation.stage-two" : "Étape 2",
    "vmc-migration.task-translation.task.analyze-network" : "Analyser les dépendances réseau (facultatif)",
    "vmc-migration.task-translation.task.aws-connectivity" : "Configurer la connectivité intra AWS",
    "vmc-migration.task-translation.task.configure-network" : "Configurer le réseau",
    "vmc-migration.task-translation.task.create-sddc" : "Créer un SDDC",
    "vmc-migration.task-translation.task.download-gateway" : "Télécharger la passerelle HLM (facultatif)",
    "vmc-migration.task-translation.task.get-to-know-vmc" : "Découvrir VMware Cloud on AWS",
    "vmc-migration.task-translation.task.install-test-hcx" : "Installation et test de HCX",
    "vmc-migration.task-translation.task.migrate-wave" : "Migrer par vague",
    "vmc-migration.task-translation.task.network-connection" : "Préparer la connexion réseau",
    "vmc-migration.task-translation.task.plan-migration" : "Planification de la migration",
    "vmc-migration.task-translation.task.prepare-dns-strategy" : "Préparer la stratégie DNS",
    "vmc-migration.task-translation.task.size-workload" : "Dimensionner vos charges de travail",
    "welcome-home.aws-title" : "VMware Cloud on AWS",
    "welcome-home.infrastructure-label" : "Infrastructure prise en charge :"
  }
}