{
  "component" : "docs",
  "locale" : "de",
  "messages" : {
    "0004be8f6b3629f0e708d1ec68ed0e10" : "<!--\ntitle: Warum haben virtuelle Maschinen keinen Zugang zum Internet?\ncontext: [networking,firewall]\n-->\n<p>Die standardmäßigen Computing-Gateway-Firewallregeln hindern den gesamten Datenverkehr von VMs daran, das Internet zu erreichen. Damit die virtuellen Maschinen Zugang zum Internet erhalten, müssen Sie eine Computing-Gateway-Firewallregel erstellen, die ausgehenden Datenverkehr in dem logischen Netzwerk zulässt, mit dem die VM verbunden ist.</p>\n<ol class=\"list\">\n <li>Navigieren Sie zur Registerkarte <b>Netzwerk</b> für das SDDC.</li>\n    <li>Erweitern Sie unter <b>Computing-Gateway</b> den Abschnitt <b>Firewallregeln</b>.</li>\n    <li>Klicken Sie auf <b>Regel hinzufügen</b>.</li>\n    <li>Geben Sie die Regelparameter ein:\n        <ul class=\"list\">\n            <li><b>Regelname:</b> Geben Sie einen Namen für die Regel ein.</li>\n            <li><b>Aktion:</b> Wählen Sie <b>Zulassen</b> aus.</li>\n            <li><b>Quelle:</b> Geben Sie den IP-Adressbereich des CIDR-Blocks ein, der dem logischen Netzwerk für die VM zugewiesen ist.</li>\n            <li><b>Ziel:</b> Geben Sie <b>Beliebig</b> ein.</li>\n            <li><b>Dienst:</b> Wählen Sie <b>Beliebig (Gesamter Datenverkehr)</b> aus.</li>\n        </ul>\n    </li>\n\n</ol>",
    "0bedef5eb3bf011102af4dde2ffd30f3" : "<!--\ntitle: Worin bestehen Vorschaufeatures?\ncontext: [dashboard]\n-->\n<p>Die Freigabe von Funktionen in der Vorschau dient dazu, Feedback zu diesen Funktionen zu sammeln. Derartige Funktionen sind auf der Benutzeroberfläche durch das Symbol <b>Vorschau</b> gekennzeichnet. Diese Funktionen stehen möglicherweise nicht allen Kunden oder nicht in allen AWS-Regionen zur Verfügung. Es kann nicht gewährleistet werden, dass die Funktionen in der „Vorschau“ innerhalb eines bestimmten Zeitraums verfügbar sind. Möglicherweise werden sie auch gar nicht erhältlich sein. Treffen Sie Ihre Kaufentscheidung nur anhand verfügbarer Funktionen.</p>",
    "0f673b9345c9b2d37731c1bc20ea21d7" : "<!--\ntitle: Wie entferne ich Hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Sie können einen Host entfernen, solange mehr als das Minimum von 3 Hosts in einem SDDC-Cluster verbleiben:</p>\n<ol class=\"list\">\n    <li>Navigieren Sie zur Registerkarte <b>Übersicht</b> für Ihr SDDC.</li>\n    <li>Wählen Sie <b>Aktionen</b> &gt; <b>Hosts entfernen</b> aus.</li>\n    <li>Wählen Sie die Anzahl der Hosts aus, die entfernt werden sollen.</li>\n    <li>Wählen Sie die Option <b>Ich weiß, dass diese Aktion nicht rückgängig gemacht werden kann</b> aus.</li>\n    <li>Klicken Sie auf <b>Entfernen</b>.</li>\n</ol>\n<p>Die Größe des SDDC zu ändern, kann mehrere Stunden dauern. Während die Hosts entfernt werden, werden Ihre Arbeitslasten und vCenter Server weiterhin wie gewohnt ausgeführt. Sie können jedoch keine weiteren Aktionen zum Hinzufügen oder Entfernen von Hosts starten.</p>\n",
    "1041670326db849c3331e1879416f57a" : "<!--\ntitle: Wie lege ich meine Standardorganisation fest?\ncontext: [dashboard]\n-->\n\n<p>Wenn Sie Mitglied mehrerer Organisationen sind, können Sie eine Standardorganisation festlegen. Diese Organisation wird dann angezeigt, wenn Sie sich anmelden.</p>\n<ol class=\"list\">\n    <li>Klicken Sie im VMC Console-Dashboard in der Symbolleiste auf Ihren Benutzernamen und die Organisation.</li>\n    <li>Klicken Sie auf <b>Standardorganisation festlegen</b> und wählen Sie die Organisation aus, die als Standardorganisation festgelegt werden soll.</li>\n</ol>",
    "147a7e2ad24bb56ec548c1540fcb6fe8" : "<!--\ntitle: Welche Aktionen kann ich auf der Seite „Dashboard“ ausführen?\ncontext: [dashboard]\n-->\n<p>Im Dashboard können Sie:</p>\n<ul class=\"list\">\n    <li>Alle in der aktuellen Organisation erstellten SDDCs anzeigen. Sie können auf ein einzelnes SDDC klicken, um vCenter Server zu öffnen, Details anzuzeigen oder das SDDC zu löschen.</li>\n    <li>Den Fortschritt laufender SDDC-Bereitstellungen überwachen.</li>\n    <li>Klicken Sie auf <b>SDDC erstellen</b>, um ein neues SDDC zu erstellen.</li>\n    <li>Klicken Sie auf <b>Benutzer einladen</b>, um andere Benutzer zu Ihrer Organisation einzuladen.</li>\n    <li>Klicken Sie oben rechts auf Ihren Benutzernamen, um zwischen Organisationen zu wechseln (wenn Sie Mitglied mehrerer Organisationen sind), Ihr Profil anzuzeigen, ein OAuth-Token zu generieren und Ihre Standardorganisation festzulegen.</li>\n</ul>\n",
    "1611103ba0feffd85e1a9f1d8c264a91" : "<!--\ntitle: Wie konfiguriere ich DNS?\ncontext: [networking,dns]\n-->\n<p>Konfigurieren Sie DNS so, dass Computer in Ihrem SDDC vollqualifizierte Domänennamen (Fully-Qualified Domain Names, FQDNs) in IP-Adressen auflösen können. Achten Sie beim Konfigurieren von DNS darauf, dass Sie nicht einen öffentlichen DNS-Server und einen privaten (lokalen) DNS-Server konfigurieren. Dies führt zu unvorhersehbaren DNS-Ergebnissen. </p>\n<ol class=\"list\">\n    <li>Erweitern Sie auf der Registerkarte „Netzwerk“ für Ihr SDDC den Eintrag <b>DNS</b> unter <b>Verwaltungs-Gateway</b> oder <b>Computing-Gateway</b>. </li>\n    <li>Klicken Sie auf <b>Bearbeiten</b>.</li>\n    <li>Geben Sie die IP-Adressen für <b>DNS-Server 1</b> und (optional) <b>DNS-Server 2</b> ein.</li>\n    <li>Wenn Sie DNS für das Verwaltungs-Gateway konfigurieren, wählen Sie aus, wie der vollqualifizierte Domänenname (FQDN) für vCenter Server aufgelöst werden soll.\n        <ul class=\"list\">\n            <li>Wenn Sie über das Internet auf vCenter Server zugreifen, wählen Sie <b>Öffentliche IP</b> aus.</li>\n            <li>Wenn Sie ein VPN konfiguriert haben und das VPN für den Zugriff auf vCenter Server verwenden, wählen Sie <b>Private IP</b> aus.</li>\n        </ul>\n    </li>\n    <li>Wenn Sie DNS für das Computing-Gateway konfigurieren und private DNS-Server konfiguriert haben, müssen Sie sicherstellen, dass Ihr VPN so konfiguriert wurde, dass DNS-Anforderungen über das Computing-Gateway-VPN zulässig sind. Wählen Sie dafür <b>cgw-dns-network</b> als eines der lokalen Netzwerke für das VPN aus. Weitere Informationen finden Sie unter „Wie wird eine IPsec-VPN-Verbindung mit dem Computing-Gateway eingerichtet?“ </li>\n</ol>\n",
    "1e7fa90bb4da44fd3a9411ebf9db3435" : "<!--\ntitle: Wie lauten die empfohlenen Kryptografieeinstellungen für IPsec-VPNs?\ncontext: [networking,vpn]\n-->\n<p>Sofern nicht anders angegeben, können diese Einstellungen nicht in der VMC Console bearbeitet werden. Wenn Sie andere Werte für die bearbeitbaren Einstellungen wählen, müssen Sie sicherstellen, dass die Einstellungen Ihres lokalen Gateways mit denen in der VMC Console übereinstimmen. </p>\n<h4>Phase 1 – IKE-Einstellungen (Internet Key Exchange)</h4>\n<ul class=\"list\">\n    <li>Protokoll: IKEv1</li>\n    <li>ISAKMP-Modus: Hauptmodus (Aggressiven Modus deaktivieren)</li>\n    <li>ISAKMP/IKE SA-Lebensdauer: 28800 Sekunden (8 Stunden)</li>\n    <li>Verschlüsselung (bearbeitbar): AED-256</li>\n    <li>Hashing: SHA-1</li>\n    <li>Diffie-Hellman (bearbeitbar): DH-Gruppe 2</li>\n    <li>IPsec-Modus: Tunnel</li>\n    <li>IKE-Authentifizierung: Vorinstallierter Schlüssel</li>\n</ul>\n<h4>Phase 2 – Einstellungen</h4>\n<ul class=\"list\">\n    <li>Verschlüsselung (bearbeitbar): AES-256</li>\n    <li>Hashing: SHA-1</li>\n    <li>Tunnelmodus: ESP-Tunnelmodus (Encapsulating Security Payload)</li>\n    <li>Diffie-Hellman (bearbeitbar): DH-Gruppe 2</li>\n    <li>SA-Lebensdauer: 3600 Sekunden (1 Stunde)</li>\n    <li>Perfect Forward Secrecy (PFS): Aktiviert</li>\n</ul>\n",
    "2283807a9964ef305873059103b3049b" : "<!--\ntitle: Was ist ein vorinstallierter Schlüssel?\ncontext: [networking,vpn]\n-->\n<p>Der vorinstallierte Schlüssel wird von den beiden Enden des Verwaltungs-Gateway-VPN-Tunnels zur gegenseitigen Authentifizierung verwendet. Daher müssen das SDDC-Gateway und das lokale Gateway denselben Schlüssel verwenden. Der Schlüssel hat eine maximale Länge von 128 Zeichen. Behandeln Sie den vorinstallierten Schlüssel wie ein Kennwort: halten Sie ihn geheim und teilen Sie den Schlüssel anderen Personen nicht per E-Mail oder über andere unsichere Verfahren mit.</p>\n",
    "2c1ba2f7d865746fd731ed552a7f0b2e" : "<!--\ntitle: Wie greife ich auf den vSphere Client zu?\ncontext: [connection-info]\n-->\n<p>Bevor Sie auf den vSphere Client zugreifen können, müssen Sie eine VPN-Verbindung oder eine Firewallregel konfigurieren, um den Zugriff auf vCenter Server zuzulassen. Weitere Informationen finden Sie unter <a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Festlegen von Firewallregeln für das Verwaltungs-Gateway</a>.</p>\n<p>Klicken Sie auf den Link unter <b>vSphere Client (HTML5)</b> und melden Sie sich mit dem auf der Seite „Verbindungsinformationen“ angezeigten Benutzernamen und Kennwort an.</p>\n",
    "30b59ac2bbc24fc5bbec7cbb1e9a495f" : "<!--\ntitle: Wie erstelle ich eine öffentliche virtuelle Schnittstelle?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>Sie können eine öffentliche virtuelle Schnittstelle für den Zugriff auf öffentliche AWS-Dienste (z. B. S3) konfigurieren, um Daten über die Direct Connect-Verbindung zu übertragen. Sie können auch die Tunnel des Verwaltungs- und Computing-Gateway-VPNs über die öffentliche virtuelle Direct Connect-Schnittstelle einrichten.</p>\n<p>Bevor Sie eine öffentliche virtuelle Schnittstelle erstellen, müssen Sie sicherstellen, dass die Voraussetzungen unter <a href=\"http://docs.aws.amazon.com/de_de/directconnect/latest/UserGuide/WorkingWithVirtualInterfaces.html#vif-prerequisites\">Virtuelle Schnittstellen</a> erfüllt sind.</p>\n<ol class=\"list\">\n    \n    <li>Melden Sie sich bei der AWS-Konsole an.</li>\n    <li>Klicken Sie auf <b>Direct Connect</b> und anschließend auf <b>Virtuelle Schnittstellen</b>.</li>\n    <li>Klicken Sie auf <b>Virtuelle Schnittstelle erstellen</b>.</li>\n    <li>Wählen Sie <b>Öffentlich</b> aus, um eine öffentliche virtuelle Schnittstelle zu erstellen, und wählen Sie dann als Besitzer der virtuellen Schnittstelle <b>Mein AWS-Konto</b> aus.</li>\n</ol>\n<p>Konfigurieren Sie nach der Erstellung der öffentlichen virtuellen Schnittstelle die Verwaltungs- und Computing-Gateway-IPsec-VPNs so, dass die Remote-Gateway-IP und die Remotenetzwerke dem Gerät entsprechen, das die Direct Connect-Verbindung im lokalen Datencenter beendet.</p>",
    "368b83feade4e30006d029979ca09467" : "<!--\ntitle: Der Speicherplatz wird knapp. Was kann ich tun?\ncontext: [summary]\n-->\n<p>Wenn die Möglichkeit besteht, Hosts hinzuzufügen, und die maximale Anzahl Hosts in Ihrem SDDC noch nicht erreicht ist, können Sie einen Host hinzufügen, um die verfügbare Speicherkapazität zu erhöhen. Andernfalls müssen Sie Arbeitslasten herunterfahren oder aus dem SDDC migrieren.</p>",
    "371bacda2d54ffb6283b3c1ba319749f" : "<!--\ntitle: Was ist eine verbundenene Amazon-VPC?\ncontext: [networking]\n-->\n<p>Während der SDDC-Erstellung verbinden Sie Ihr SDDC mit einem AWS-Konto und wählen eine VPC und ein Subnetz in diesem Konto aus. VMware Cloud™ on AWS erstellt mithilfe einer CloudFormation-Vorlage eine Elastic Network Interface (ENI), über die das SDDC und die Dienste in der Amazon-VPC und dem Subnetz in Ihrem AWS-Konto kommunizieren können, ohne Datenverkehr über das Internet-Gateway weiterleiten zu müssen. Sie können ein SDDC nur mit einer einzigen Amazon-VPC verbinden.</p>\n\n<p>Sie können Details Ihrer verbundenen Amazon-VPC anzeigen (beispielsweise die Konto-ID, die VPC-ID und das Subnetz), indem Sie auf der Registerkarte <b>Netzwerk</b> auf <b>Verbundene Amazon-VPC</b> klicken.</p>\n",
    "399fb082e659bd059c329d47187b2c9b" : "<!--\ntitle: Wie greife ich auf den vSphere Client zu?\ncontext: [connection-info]\n-->\n<p>Bevor Sie auf den vSphere Client zugreifen können, müssen Sie entweder eine VPN-Verbindung oder eine Firewallregel konfigurieren, um den Zugriff auf vCenter Server zuzulassen. Weitere Informationen finden Sie unter <a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Festlegen von Firewallregeln für das Verwaltungs-Gateway</a>.</p>\n<p>Klicken Sie auf den Link unter <b>vSphere Client (HTML5)</b> und melden Sie sich mit dem auf der Seite „Verbindungsinformationen“ angezeigten Benutzernamen und Kennwort an.</p>\n",
    "48964c31fdfaa31e73dd1678ae622e6d" : "<!--\ntitle: Wie richte ich eine IPsec-VPN-Verbindung zum Computing-Gateway ein?\ncontext: [networking,vpn]\n-->\n<p>Sie können eine VPN-Verbindung zwischen dem Computing-Gateway Ihres SDDC und einem lokalen Computing-Netzwerk erstellen.</p>\n<ol class=\"list\">\n    <li>Führen Sie auf der Registerkarte „Netzwerk“ für Ihr SDDC die Computing-Gateway-VPN-Konfiguration durch.\n        <ul class=\"list\">\n            <li><b>VPN-Name:</b> Geben Sie einen Namen für das VPN ein.</li>\n            <li><b>Öffentliche IP des Remote-Gateways:</b> Geben Sie die IP-Adresse des lokalen Gateways ein.</li>\n            <li><b>Private IP des Remote-Gateways:</b> Befindet sich Ihr lokales Gateway hinter der NAT, geben Sie die private IP-Adresse Ihres lokalen Gateways ein.</li>\n            <li><b>Remotenetzwerke:</b> Geben Sie die Adresse Ihres lokalen Computing-Netzwerks ein.</li>\n            <li><b>IP des lokalen Gateways:</b> Zeigt die IP-Adresse des SDDC-Computing-Gateways an. Dieses Feld kann nicht bearbeitet werden.</li>\n            <li><b>Lokales Netzwerk:</b> Wählen Sie das logische Netzwerk aus, zu dem über dieses VPN eine Verbindung hergestellt werden soll. Wenn in dem logischen Netzwerk DHCP verwendet wird und wenn ein lokaler DNS-Server konfiguriert wurde, wählen Sie auch das Netzwerk <b>cgw-dns-network</b> aus, damit DNS-Anforderungen über das VPN geleitet werden können. </li>\n            <li><b>Verschlüsselung:</b> Wählen Sie <b>AES-256</b> aus.</li>\n            <li><b>Perfect Forward Secrecy:</b> Wählen Sie <b>Aktiviert</b> aus.</li>\n            <li><b>Diffie-Hellman:</b> Wählen Sie eine Diffie-Hellman-Gruppe aus. Diese muss mit den für das lokale Gateway konfigurierten Einstellungen übereinstimmen.</li>\n            <li><b>Vorinstallierter Schlüssel:</b> Geben Sie eine maximal 128 Zeichen umfassende Schlüsselzeichenfolge ein.</li>\n        </ul>\n    </li>\n    <li>Konfigurieren Sie die lokale Seite des VPN-Tunnels unter Anwendung der empfohlenen Kryptografieeinstellungen. Weitere Informationen zum Konfigurieren bestimmter Gateway-Geräte finden Sie im <i>Einführungshandbuch zu VMware Cloud on AWS</i>. </li>\n  \n</ol>\n<p>Auf der Registerkarte „Netzwerk“ können Sie anhand des VPN-Status überprüfen, ob der VPN-Tunnel ordnungsgemäß verbunden ist.</p>\n",
    "48a5b54af2520255a60f1aeb8acc32fc" : "<!--\ntitle: Wie richte ich eine IPsec-VPN-Verbindung zum Computing-Gateway ein?\ncontext: [networking,vpn]\n-->\n<p>Sie können eine VPN-Verbindung zwischen dem Computing-Gateway Ihres SDDC und einem lokalen Computing-Netzwerk erstellen.</p>\n<ol class=\"list\">\n    <li>Führen Sie auf der Registerkarte „Netzwerk“ für Ihr SDDC die Computing-Gateway-VPN-Konfiguration durch.\n        <ul class=\"list\">\n            <li><b>VPN-Name:</b> Geben Sie einen Namen für das VPN ein.</li>\n            <li><b>Öffentliche IP des Remote-Gateways:</b> Geben Sie die IP-Adresse des lokalen Gateways ein.</li>\n            <li><b>Private IP des Remote-Gateways:</b> Befindet sich Ihr lokales Gateway hinter der NAT, geben Sie die private IP-Adresse Ihres lokalen Gateways ein.</li>\n            <li><b>Remotenetzwerke:</b> Geben Sie die Adresse Ihres lokalen Computing-Netzwerks ein.</li>\n            <li><b>IP des lokalen Gateways:</b> Zeigt die IP-Adresse des SDDC-Computing-Gateways an. Dieses Feld kann nicht bearbeitet werden.</li>\n            <li><b>Lokales Netzwerk:</b> Wählen Sie das logische Netzwerk aus, zu dem über dieses VPN eine Verbindung hergestellt werden soll. Wenn in dem logischen Netzwerk DHCP verwendet wird und wenn ein lokaler DNS-Server konfiguriert wurde, wählen Sie auch das Netzwerk <b>cgw-dns-network</b> aus, damit DNS-Anforderungen über das VPN geleitet werden können. </li>\n            <li><b>Verschlüsselung:</b> Wählen Sie <b>AES-256</b> aus.</li>\n            <li><b>Perfect Forward Secrecy:</b> Wählen Sie <b>Aktiviert</b> aus.</li>\n            <li><b>Diffie-Hellman:</b> Wählen Sie eine Diffie-Hellman-Gruppe aus. Diese muss mit den für das lokale Gateway konfigurierten Einstellungen übereinstimmen.</li>\n            <li><b>Vorinstallierter Schlüssel:</b> Geben Sie eine maximal 128 Zeichen umfassende Schlüsselzeichenfolge ein.</li>\n        </ul>\n    </li>\n    <li>Konfigurieren Sie die lokale Seite des VPN-Tunnels unter Anwendung der empfohlenen Kryptografieeinstellungen. Weitere Informationen zum Konfigurieren bestimmter Gateway-Geräte finden Sie im <i>Einführungshandbuch zu VMware Cloud on AWS</i>. </li>\n  \n</ol>\n<p>Auf der Seite „Netzwerk“ können Sie anhand des VPN-Status überprüfen, ob der VPN-Tunnel ordnungsgemäß verbunden ist.</p>\n",
    "4b1343d42dce723ba29e55b781b412ac" : "<!--\ntitle: Wie hänge ich eine private virtuelle Schnittstelle an mein Cloud-SDDC an?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>Bei Verwendung einer privaten virtuellen Schnittstelle kann der ESXi-Verwaltungsdatenverkehr und der vMotion-Datenverkehr über die Direct Connect-Verbindung zwischen der lokalen Umgebung und dem SDDC geleitet werden.</p>\n<p>Bevor Sie eine private virtuelle Schnittstelle erstellen, müssen Sie sicherstellen, dass die Voraussetzungen unter <a href=\"http://docs.aws.amazon.com/de_de/directconnect/latest/UserGuide/WorkingWithVirtualInterfaces.html#vif-prerequisites\">Virtuelle Schnittstellen</a> erfüllt sind.</p>\n<ol class=\"list\">\n    <li>Ermitteln Sie die Konto-ID für das VMC AWS-Konto. Sie wird im Abschnitt <b>Direct Connect</b> auf der Registerkarte <b>Netzwerk</b> Ihres SDDC angezeigt.</li>\n    <li>Melden Sie sich bei der AWS-Konsole an.</li>\n    <li>Klicken Sie auf <b>Direct Connect</b> und dann auf <b>Virtuelle Schnittstellen</b>.</li>\n    <li>Klicken Sie auf <b>Virtuelle Schnittstelle erstellen</b>.</li>\n    <li>Wählen Sie <b>Privat</b> aus, um eine private virtuelle Schnittstelle zu erstellen. Wählen Sie als Kontobesitzer <b>Anderes AWS-Konto</b> aus und geben Sie die Konto-ID Ihres VMC AWS-Kontos ein.</li>\n    <li>Melden Sie sich bei der VMC Console an und navigieren Sie zur Registerkarte <b>Netzwerk</b> Ihres SDDC.</li>\n    <li>Erweitern Sie unter <b>Direct Connect</b> den Eintrag <b>Virtuelle Schnittstellen</b> und klicken Sie neben der von Ihnen erstellten virtuellen Schnittstelle auf <b>Anhängen</b>.</li>\n    <li>Wählen Sie <b>Mir ist bekannt, dass ich für die für die Schnittstelle anfallenden Datenübertragungsgebühren hafte</b> aus und klicken Sie auf <b>Virtuelle Schnittstelle akzeptieren</b>.</li>\n    <li>Wenn Sie über ein konfiguriertes IPsec-VPN verfügen, aktualisieren Sie die VPN-Einstellungen.\n        <ol class=\"list\">\n            <li>Aktualisieren Sie in der VMC Console die IPsec-VPN-Verwaltungseinstellungen. Im Netzwerktopologiediagramm ist die Subnetzadresse der Verwaltungs-Appliance im Feld <b>Appliance-Subnetz</b> angegeben.</li>\n            <li>Aktualisieren Sie die Remotenetzwerkeinstellung in Ihrem lokalen Gateway, sodass die Subnetzadresse der Verwaltungs-Appliance verwendet wird.</li>\n        </ol>\n    </li>\n</ol>\n",
    "4f87a32661f5b7d16a44c3302de7d26f" : "<!--\ntitle: Wie wähle ich den IP-Adressbereich für das Verwaltungsnetzwerk?\ncontext: [networking]\n-->\n<p>Nachdem das SDDC erstellt wurde, können Sie die für das Verwaltungsnetzwerk angegebenen Werte nicht mehr ändern. Beachten Sie bei der Auswahl dieser Werte Folgendes:</p>\n<ul class=\"list\">\n    <li>Die einzigen unterstützten Größen für den Bereich des CIDR-Blocks sind /23, /20 und /16.</li>\n\t<li>Wenn Sie Ihr SDDC mit einem lokalen Datencenter verbinden möchten, müssen sich die von Ihnen für das SDDC gewählten IP-Adressen von denen des lokalen Datencenters unterscheiden, um IP-Adressenkonflikte zu vermeiden.</li>\n\t<li>Die maximale Anzahl Hosts, die Ihr SDDC enthalten kann, hängt von der Größe des angegebenen CIDR-Blocks ab. Wenn der CIDR-Block in der Form XXX.XXX.XXX.XXX/YY angegeben wird, ist die maximale Anzahl Hosts, die das SDDC enthalten kann, (2 ^(27 - YY)) - 3. Wenn Sie beispielsweise den CIDR-Block 192.0.2.0/23 angeben, ist die maximale Anzahl Hosts (2 ^(27 - 24)) - 3 bzw. 13.</li>\n</ul>\n<p><b>Hinweis:</b> Obwohl in einem /16-CIDR-Block 2045 Host-IP-Adressen verfügbar sind, ist die maximale Anzahl der Hosts im SDDC durch andere Faktoren auf 160 begrenzt.</p>",
    "504c453076570eee108f676037cdb3fd" : "<!--\ntitle: Wie lade ich einen anderen Benutzer ein?\ncontext: [dashboard]\n-->\n\n<p>Um einen anderen Benutzer einzuladen, müssen Sie ein Organisationsbesitzer sein.</p>\n<ol class=\"list\">\n    <li>Klicken Sie im VMC Console-Dashboard auf <b>Benutzer einladen</b>.</li>\n    <li>Geben Sie die E-Mail-Adressen der Benutzer ein, die Sie einladen möchten.</li>\n    <li>Wählen Sie die Rolle für die Benutzer aus, die Sie einladen. Sie können <b>Besitzer der Organisation</b> oder <b>Mitglied der Organisation</b> auswählen.</li>\n    <li>Klicken Sie auf <b>Hinzufügen</b>.</li>\n</ol>\n<p>Die von Ihnen eingeladenen Benutzer erhalten eine E-Mail mit einem Link und weiteren Anweisungen, sodass sie sich für VMware Cloud on AWS registrieren können.</p>",
    "512168942276546150ab4591791d2c97" : "<!--\ntitle: Wie richte ich eine IPsec-VPN-Verbindung zum Verwaltungs-Gateway ein?\ncontext: [networking,vpn]\n-->\n<p>Sie können eine VPN-Verbindung zwischen dem Verwaltungs-Gateway Ihres SDDC und Ihrem lokalen Verwaltungsnetzwerk erstellen.</p>\n<ol class=\"list\">\n    <li>Vervollständigen Sie auf der Registerkarte „Netzwerk“ für Ihr SDDC die Konfiguration des Verwaltungs-Gateway-VPNs.\n        <ul class=\"list\">\n            <li><b>VPN-Name:</b> Geben Sie einen Namen für das VPN ein.</li>\n            <li><b>Öffentliche IP des Remote-Gateways:</b> Geben Sie die öffentliche IP-Adresse Ihres lokalen Gateways ein.</li>\n            <li><b>Private IP des Remote-Gateways:</b> Befindet sich Ihr lokales Gateway hinter der NAT, geben Sie die private IP-Adresse Ihres lokalen Gateways ein.</li>\n            <li><b>Remotenetzwerke:</b> Geben Sie die Adresse Ihrer lokalen Verwaltungsnetzwerke ein.</li>\n            <li><b>IP des lokalen Gateways:</b> Zeigt die IP-Adresse des SDDC-Verwaltungs-Gateways an. Dieses Feld kann nicht bearbeitet werden.</li>\n            <li><b>Lokales Netzwerk:</b> Zeigt den CIDR-Block des Verwaltungssubnetzes für das Verwaltungs-Gateway an. Dieses Feld kann nicht bearbeitet werden.</li>\n            <li><b>Verschlüsselung:</b> Wählen Sie <b>AES-256</b> aus.</li>\n            <li><b>Perfect Forward Secrecy:</b> Wählen Sie <b>Aktiviert</b> aus.</li>\n            <li><b>Diffie-Hellman:</b> Wählen Sie eine Diffie-Hellman-Gruppe aus. Diese muss mit den von Ihnen für das lokale Gateway konfigurierten Einstellungen übereinstimmen.</li>\n            <li><b>Vorinstallierter Schlüssel:</b> Geben Sie eine maximal 128 Zeichen umfassende Schlüsselzeichenfolge ein.</li>\n        </ul>\n    </li>\n    <li>Konfigurieren Sie die lokale Seite des VPN-Tunnels unter Anwendung der empfohlenen Kryptografieeinstellungen. Weitere Informationen zum Konfigurieren bestimmter Gateway-Geräte finden Sie im <i>Einführungshandbuch zu VMware Cloud on AWS</i>. </li>\n\n</ol>\n<p>Auf der Seite „Netzwerk“ können Sie anhand des VPN-Status überprüfen, ob der VPN-Tunnel ordnungsgemäß verbunden ist.</p>\n",
    "51e82d2f893994cad4a0435b6704fa8a" : "<!--\ntitle: Welche Firewallregeln benötige ich für Site Recovery?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n\n<p>\n    Sie müssen mehrere Firewallregeln erstellen, um den Verwaltungs- und Replizierungsdatenverkehr zuzulassen und den VMware Site Recovery-Dienst zu aktivieren.\n</p>\n\n<p>\n    So aktivieren Sie den Verwaltungs- und API-Zugriff:\n</p>\n\n<ol>\n    <li>Eingehenden Dienst zulassen – HTTPS (TCP 433) zu vCenter</li>\n    <li>Eingehenden Dienst zulassen – SRM Server Management (TCP 9086) zu Site Recovery Manager</li>\n    <li>Eingehenden Dienst zulassen – VR Server Management (TCP 8043) zu vSphere Replication</li>\n    <li>Ausgehenden Dienst zulassen – „Beliebig (Gesamter Datenverkehr)“ von vCenter, Site Recovery Manager und vSphere Replication</li>\n</ol>\n\n<p>\n    So aktivieren Sie den Replizierungsdatenverkehr:\n</p>\n\n<ol>\n    <li>Eingehenden Dienst zulassen – VM-Replizierung (TCP 31031, 44046) zu vSphere Replication</li>\n    <li>Ausgehenden Dienst zulassen – „Beliebig (Gesamter Datenverkehr)“ von „Nur ESXi-Verwaltung“</li>\n</ol>\n\n<p>\n    So aktivieren Sie den Zugriff auf die Site Recovery-Konsole:\n</p>\n\n<ol>\n    <li>Eingehenden Datenverkehr zulassen – HTTPS (TCP 443) zu vSphere Replication</li>\n</ol>\n",
    "52939d0bf7f6e015fc43b762e1fe79b0" : "<!--\ntitle: Kann ich Hosts meinem SDDC später hinzufügen?\ncontext: [create-sddc]\n-->\n<p>Sie können zu einem späteren Zeitpunkt weitere Hosts bereitstellen, wenn Ihr SDDC weniger Hosts enthält als die Ihrer Organisation zugeteilte maximale Anzahl.</p>\n\n    \n\n",
    "52b8f73acf9935a10aed190f248e5a6c" : "<!--\ntitle: Wie entferne ich einen anderen Benutzer?\ncontext: [dashboard]\n-->\n\n<p>Um einen anderen Benutzer aus einer Organisation zu entfernen, müssen Sie der Organisationsbesitzer sein.</p>\n<ol class=\"list\">\n    <li>Klicken Sie im Dashboard der VMC Console oben rechts im Fenster auf das Symbol für Dienste und wählen Sie <b>Identitäts- und Zugriffsverwaltung</b> aus.</li>\n    <li>Wählen Sie den oder die Benutzer aus, den bzw. die Sie entfernen möchten.</li>\n    <li>Klicken Sie auf <b>Benutzer entfernen</b>.</li>\n    <li>Klicken Sie auf <b>Entfernen</b>, um das Entfernen zu bestätigen.</li>\n</ol>\n<p>Der Benutzer wird aus der Organisation entfernt und kann nicht mehr auf die Ressourcen der Organisation zugreifen.</p>",
    "5ba0833e46158bb895f9a8776f02fb99" : "<!--\ntitle: Was ist ein Site Recovery-Add-On?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n\n<p>VMware Site Recovery Manager ermöglicht die Durchführung der automatischen Notfallwiederherstellung virtueller Maschinen aus dem lokalen Datencenter zu Ihrem SDDC in der Cloud.</p>\n",
    "5c4cd561f50297e3eb2c5783b9405139" : "<!--\ntitle: Wie erstelle ich ein neues SDDC?\ncontext: [dashboard,create-sddc]\n-->\n<p>Während der SDDC-Erstellung verbinden Sie Ihr SDDC mit einem AWS-Konto und wählen eine VPC und ein Subnetz in diesem Konto aus. VMware Cloud™ on AWS erstellt mithilfe einer CloudFormation-Vorlage eine Elastic Network Interface (ENI), über die Ihr SDDC und die Dienste in der Amazon-VPC kommunizieren können, ohne Datenverkehr über das Internet-Gateway weiterleiten zu müssen. Sie können ein SDDC nur mit einer einzigen Amazon-VPC verbinden.</p>\n<p>Stellen Sie sicher, dass Sie über ein AWS-Konto und eine geeignete VPC verfügen, bevor Sie ein SDDC erstellen. Erstellen Sie die VPC in derselben Region, die Sie auch für Ihr SDDC nutzen möchten, und erstellen Sie ein Subnetz mit mindestens 64 IP-Adressen (ein /27-CIDR-Block) in jeder Verfügbarkeitszone (Availability Zone, AZ) in Ihrer VPC.</p>\n<p>So erstellen Sie ein neues SDDC:</p>\n<ol class=\"list\">\n    <li>Klicken Sie im Dashboard auf <b>SDDC erstellen</b>.</li>\n    <li>Befolgen Sie die Schritte zum Verbinden Ihres AWS-Kontos, legen Sie die SDDC-Eigenschaften fest und wählen Sie das Subnetz aus. Weitere Informationen finden Sie unter <a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-EF198D55-03E3-44D1-AC48-6E2ABA31FF02.html\" target=\"_blank\">Bereitstellen eines SDDC über die VMC Console</a>.</li>\n</ol>\n<p>Der Status der SDDC-Bereitstellung wird im Dashboard angezeigt.</p>\n",
    "6ced784d9c5e00071eff86b77b849f2e" : "<!--\ntitle: Welche Aktionen kann ich auf der Seite „Netzwerk“ ausführen?\ncontext: [networking]\n-->\n<p>Auf der Seite „Netzwerk“ können Sie folgende Aktionen ausführen:</p>\n<ul class=\"list\">\n    <li>Ein Topologiediagramm anzeigen, das den Status der Netzwerkverbindungen zu und von Ihrem SDDC zeigt.</li>\n    <li>Firewallregeln für die Verwaltungs- und Computing-Gateways erstellen.</li>\n    <li>VPN-Einstellungen für IPsec-VPN-Verbindungen zwischen Ihrem SDDC und einem lokalen Datencenter konfigurieren.</li>\n    <li>DNS-Einstellungen für die Verwaltungs- und Computing-Gateways konfigurieren.</li>\n    <li>Logische Netzwerke anzeigen. (Verwenden Sie zum Konfigurieren logischer Netzwerke den vSphere Client.)</li>\n    <li>Eingehende NAT für Ihr Computing-Gateway konfigurieren.</li>\n    <li>Öffentliche IP-Adressen für Ihr Computing-Gateway erstellen.</li>\n    <li>Informationen über die verbundene Amazon-VPC anzeigen.</li>\n    <li>Private virtuelle AWS Direct Connect-Schnittstellen an Ihr SDDC anhängen.</li>\n</ul>\n",
    "7f1e7006f73bb6f25bf233669f10341a" : "<!--\ntitle: Wie richte ich Firewallregeln für das Computing-Gateway ein?\ncontext: [networking,firewall]\n-->\n<p>Die Firewall für das Computing-Gateway ist standardmäßig so eingerichtet, dass der gesamte eingehende und ausgehende Datenverkehr abgelehnt wird. Fügen Sie bei Bedarf weitere Firewallregeln hinzu, um Datenverkehr zuzulassen.</p>\n<ol class=\"list\">\n    <li>Navigieren Sie zur Registerkarte <b>Netzwerk</b> für das SDDC.</li>\n    <li>Erweitern Sie unter <b>Computing-Gateway</b> den Abschnitt <b>Firewallregeln</b>.</li>\n    <li>Klicken Sie auf <b>Regel hinzufügen</b>.</li>\n    <li>Geben Sie die Regelparameter ein:\n        <ul class=\"list\">\n            <li><b>Regelname:</b> Geben Sie einen Namen für die Regel ein.</li>\n            <li><b>Aktion:</b> Wählen Sie <b>Zulassen</b> oder <b>Verweigern</b> aus.</li>\n            <li><b>Quelle:</b> Geben Sie Folgendes ein oder wählen Sie eine der folgenden Optionen aus:\n                <ul class=\"list\">\n                <li>Wählen Sie <b>Gesamtes Internet und VPN</b> aus, um die Regel auf den gesamten Datenverkehr aus dem Internet und VPN anzuwenden.</li>\n                <li>Wählen Sie <b>Gesamte verbundene Amazon-VPC</b> aus, um die Regel auf den gesamten Datenverkehr von der verbundenen Amazon-VPC anzuwenden.</li>    \n                <li>Geben Sie <b>Beliebig</b> ein, um die Regel auf Datenverkehr von allen Quellen anzuwenden.</li>\n                <li>Geben Sie eine(n) oder mehrere IP-Adressen oder IP-Adressbereiche getrennt durch Kommas ein, um die Regel auf Datenverkehr von diesen bestimmten IP-Adressen anzuwenden. </li>    \n                </ul>\n            </li>\n            <li><b>Ziel:</b> </b> Geben Sie Folgendes ein oder wählen Sie eine der folgenden Optionen aus:\n                <ul class=\"list\">\n                <li>Wählen Sie <b>Gesamtes Internet und VPN</b> aus, um die Regel auf den gesamten Datenverkehr zum Internet und VPN anzuwenden.</li>\n                <li>Wählen Sie <b>Gesamte verbundene Amazon-VPC</b> aus, um die Regel auf den gesamten Datenverkehr zu der verbundenen Amazon-VPC anzuwenden.</li>    \n                <li>Geben Sie <b>Beliebig</b> ein, um die Regel auf den Datenverkehr zu allen Quellen anzuwenden.</li>\n                <li>Geben Sie eine(n) oder mehrere IP-Adressen oder IP-Adressbereiche getrennt durch Kommas ein, um die Regel auf Datenverkehr zu diesen bestimmten IP-Adressen anzuwenden. </li>    \n                </ul></li>\n            <li><b>Dienst:</b> Wählen Sie eine der folgenden Optionen aus:\n                <ul class=\"list\">\n                    <li><b>Beliebig (Gesamter Datenverkehr):</b> Die Regel gilt für den gesamten Datenverkehr.</li>\n                    <li>Ein bestimmter Dienst: Die Regel gilt für den Datenverkehr von dem ausgewählten Dienst und Port.</li>\n                    <li><b>ICMP (Gesamtes ICMP)</b>: Die Regel gilt für den gesamten ICMP-Datenverkehr</li>\n                    <li><b>Benutzerdefiniertes TCP</b> oder <b>Benutzerdefiniertes UDP</b>: Hiermit werden ein benutzerdefinierter Dienst und ein Port definiert, auf die die Regel angewendet wird.</li>\n                </ul>\n            </li>\n            <li><b>Ports:</b> Wenn Sie einen benutzerdefinierten TCP- oder UDP-Dienst ausgewählt haben, geben Sie hier die Portnummer ein.</li>\n        </ul>\n    </li>\n</ol>\n<p>Firewallregeln werden in der Reihenfolge von oben nach unten angewendet. Verschieben Sie die Firewallregeln mit den nach oben bzw. unten weisenden Pfeilen.</p>\n",
    "815b9b868cca3fed897e848acddbf460" : "<!--\ntitle: Was ist ein Hybrid Cloud Extension-Add-On?\ncontext: [hcx,addons]\n-->\n\n<p>VMware Hybrid Cloud Extension (HCX) abstrahiert lokale und Cloud-Ressourcen und stellt sie den Arbeitslasten als Hybrid Cloud zur Verfügung. Dadurch wird die Mobilität von Arbeitslasten zwischen dem lokalen Datencenter und dem Cloud-SDDC ermöglicht.</p>\n<p>HCX ist ein Bestandteil des VMC on AWS-Diensts. Weitere Informationen zum Installieren und Konfigurieren von HCX finden Sie unter <a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws\n.getting-started/GUID-DAE9B318-294A-4422-BBF4-82AE9DDFF043.html\">Checkliste für Hybrid-Migration mit HCX</a>.</p>",
    "8779212284284274601fb331ab4033a1" : "<!--\ntitle: Wie erstelle ich ein logisches Netzwerk?\ncontext: [networking,logical-network]\n-->\n<p>Logische Netzwerke werden in der VMC Console angezeigt, aber mithilfe des vSphere Client erstellt. </p>\n<ol class=\"list\">\n    <li>Klicken Sie auf der Registerkarte <b>Verbindungsinformationen</b> Ihres SDDC auf den Link unter <b>vSphere Client (HTML5)</b> und melden Sie sich mit Ihren vCenter Server-Anmeldedaten an.</li>\n    <li>Wählen Sie <b>Menü</b> &gt; <b>Globale Bestandslisten</b> und anschließend <b>Logische Netzwerke</b> aus</li>\n    <li>Klicken Sie auf die Schaltfläche „Hinzufügen“.</li>\n    <li>Geben Sie im Textfeld <b>Name</b> einen Namen für das logische Netzwerk ein.</li>\n    <li>Geben Sie im Textfeld <b>CIDR-Block</b> einen CIDR-Block im Format „xxx.xxx.xxx.0/YY“ ein. <p>Die Länge des Präfixes muss zwischen 22 und 30 liegen, da das logische Netzwerk maximal 1000 Ports aufweisen darf.</p></li>\n    <li>(Optional) Wählen Sie <b>Aktiviert</b> aus, um DHCP zu aktivieren. <p>Wenn Sie DHCP in einem logischen Netzwerk aktivieren und einen lokalen DNS-Server konfiguriert haben, müssen Sie das Computing-Gateway-VPN so bearbeiten, dass DNS-Abfragen korrekt über das VPN weitergeleitet werden. Wählen Sie dazu <b>cgw-dns-network</b> als eines der logischen Netzwerke für das VPN aus.</p></li>\n    <li>Klicken Sie auf <b>OK</b>.</li>\n</ol>\n",
    "8c9c25e613fcceef9f17aab074171d86" : "<!--\ntitle: Welche Aktionen kann ich auf der Seite „Übersicht“ ausführen?\ncontext: [summary]\n-->\n<p>Auf der Seite „Übersicht“ wird die aktuelle CPU-, Arbeitsspeicher- und Speicherauslastung Ihres SDDC angezeigt. Außerdem können Sie auf dieser Seite Ihrem SDDC Hosts hinzufügen bzw. daraus entfernen.</p>",
    "8e142af13e14fd0858db11652a4f6a91" : "<!--\ntitle: Wie verwalte ich den Zugriff auf vCenter Server?\ncontext: [networking,firewall,vpn]\n-->\n<p>Standardmäßig ist kein externer Zugriff auf das vCenter Server-System in Ihrem SDDC möglich. Aktivieren Sie den Zugriff auf das vCenter Server-System, indem Sie Folgendes durchführen:</p>\n<ul class=\"list\">\n    <li>Konfigurieren einer Firewallregel für den Zugriff auf das vCenter Server-System.</li>\n    <li>Konfigurieren eines IPsec-VPNs zwischen dem lokalen Datencenter und dem SDDC.</li>\n</ul>\n<p>Wenn Sie eine dieser Optionen konfiguriert haben, klicken Sie auf die Registerkarte <b>Verbindungsinformationen</b>, um zu ermitteln, wie mithilfe von vSphere Client und PowerCLI eine Verbindung zu vCenter Server hergestellt werden kann.</p>\n",
    "907e29f426a0e6cfe310ca3065113696" : "<!--\ntitle: Was passiert, wenn ich ein SDDC lösche?\ncontext: [dashboard]\n-->\n<p>Wenn Sie ein SDDC löschen, werden Ihre VMs und Daten gelöscht und die dem SDDC zugewiesenen Hosts und sonstigen Ressourcen werden für die Verwendung in anderen SDDCs freigegeben. Sichern oder migrieren Sie alle wichtigen Daten und VMs, bevor Sie ein SDDC löschen.</p>\n",
    "9473fdd0d880a43c21b7778d34872157" : "Inhalte testen",
    "99a1f78f70ee152574b1f192a311da43" : "<!--\ntitle: Wie lösche ich ein SDDC?\ncontext: [dashboard]\n-->\n<p>Suchen Sie im Dashboard die Karte für das zu löschende SDDC und klicken Sie auf <b>Aktionen</b> &gt; <b>SDDC löschen</b>.</p>\n",
    "9a5c79ad338ec95353d9a47570c368bc" : "<!--\ntitle: Kann ich einen Benutzer einladen, der nicht über ein MyVMware-Konto verfügt?\ncontext: [dashboard, invite]\n-->\n\n<p>Ja. Im Verlauf des Registrierungsprozesses wird der Benutzer aufgefordert, ein My VMware-Konto zu erstellen.</p>",
    "9a876507c260d5e28f7888e94b34c30b" : "<!--\ntitle: Wie richte ich Firewallregeln für das Verwaltungs-Gateway ein?\ncontext: [networking,firewall]\n-->\n<p>Standardmäßig ist die Firewall für das Verwaltungs-Gateway so eingerichtet, dass der gesamte eingehende und ausgehende Datenverkehr abgelehnt wird. Fügen Sie nach Bedarf weitere Firewallregeln hinzu, damit auf vCenter Server zugegriffen und weiterer Datenverkehr zugelassen werden kann.</p>\n<ol class=\"list\">\n    <li>Navigieren Sie zur Registerkarte <b>Netzwerk</b> für das SDDC.</li>\n    <li>Erweitern Sie unter <b>Verwaltungs-Gateway</b> den Abschnitt <b>Firewallregeln</b>.</li>\n    <li>Klicken Sie auf <b>Regel hinzufügen</b>.</li>\n    <li>Geben Sie die Regelparameter ein:\n        <ul class=\"list\">\n            <li><b>Regelname:</b> Geben Sie einen beschreibenden Namen für die Regel ein.</li>\n              <li><b>Aktion:</b> Für Firewallregeln für das Verwaltungs-Gateway ist nur die Aktion <b>Zulassen</b> verfügbar.</li>\n            <li><b>Quelle:</b> Geben Sie Folgendes ein:\n                <ul class=\"list\">\n                    <li>eine IP-Adresse, einen IP-Adressbereich oder <b>Beliebig</b>, um Datenverkehr von dieser Adresse oder diesem Adressbereich zuzulassen.</li>\n                    <li><b>vCenter</b>, um Datenverkehr vom vCenter Server Ihres SDDC zuzulassen.</li>\n                    <li><b>Nur ESXi-Verwaltung</b>, um Datenverkehr von der ESXi-Verwaltung in Ihrem SDDC zuzulassen.</li>\n                </ul>\n            </li>\n            <li><b>Ziel:</b>Geben Sie Folgendes ein:\n                <ul class=\"list\">\n                    <li>eine IP-Adresse, einen IP-Adressbereich oder <b>Beliebig</b>, um Datenverkehr zu dieser Adresse oder diesem Adressbereich zuzulassen.</li>\n                    <li><b>vCenter</b>, um Datenverkehr zum vCenter Server Ihres SDDC zuzulassen.</li>\n                    <li><b>Nur ESXi-Verwaltung</b>, um Datenverkehr zu der ESXi-Verwaltung in Ihrem SDDC zuzulassen.</li>\n                </ul>\n            </li>\n            <li><b>Dienst</b>: Wählen Sie eine der folgenden Optionen aus:\n                <ul class=\"list\">\n                    <li><b>Beliebig (Gesamter Datenverkehr)</b></li>\n                    <li><b>HTTPS (TCP 443)</b>: Gilt nur für vCenter Server als Ziel.</li>\n                    <li><b>Bereitstellung (TCP 902)</b>: Gilt nur für ESXi-Verwaltung als Ziel.</li>\n                    <li><b>Remotekonsole (TCP 903)</b>: Gilt nur für ESXi-Verwaltung als Ziel.</li>\n                    <li><b>ICMP (Gesamtes ICMP)</b></li>\n                </ul>\n            </li>  \n            <li><b>Port</b>: Dies ist ein nicht bearbeitbarer Parameter, der den Port für den ausgewählten Dienst angibt.</li>\n        </ul>\n    </li>\n</ol>\n<p>Firewallregeln werden in der Reihenfolge von oben nach unten angewendet. Verschieben Sie die Firewallregeln mit den nach oben bzw. unten weisenden Pfeilen.</p>\n",
    "9fee73eeba958dca24974ae6e88a6c55" : "<!--\ntitle: Was ist Amazon Direct Connect?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>AWS Direct Connect ist ein von AWS bereitgestellter Dienst, der es Ihnen ermöglicht, eine Hochgeschwindigkeitsverbindung mit geringer Latenz zwischen Ihrem lokalen Datencenter und AWS-Diensten zu erstellen.</p>\n\n<p>Der Zugriff auf Direct Connect erfolgt über eine private oder eine öffentliche virtuelle Schnittstelle. Eine private virtuelle Schnittstelle kann für die ESXi-Verwaltung und den vMotion-Datenverkehr zwischen Ihrem lokalen Datencenter und Ihrem Cloud-SDDC verwendet werden. Eine öffentliche virtuelle Schnittstelle kann verwendet werden, um auf öffentliche AWS-Dienste zuzugreifen und um den IPsec-VPN-Datenverkehr des Verwaltungs-Gateways über Direct Connect zu leiten.</p>\n",
    "a82311223952969b5c0c177b512d9a90" : "<!--\ntitle: Informationen zu VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>Copyright © 2017-2018 VMware, Inc. Alle Rechte vorbehalten. Dieses Produkt ist durch das Urheberrecht und Gesetze zum geistigen Eigentum in den USA und anderen Ländern sowie durch internationale Abkommen geschützt. VMware-Produkte sind durch ein oder mehrere der unter <a href=\"http://www.vmware.com/go/patents-de\" target=\"_blank\">http://www.vmware.com/go/patents-de</a> aufgeführten Patente geschützt.</p>\n<p>VMware ist eine eingetragene Marke oder Marke der VMware, Inc. in den USA und anderen Rechtssystemen. Alle anderen hierin erwähnten Bezeichnungen und Namen können Marken der jeweiligen Unternehmen sein.</p>\n",
    "about-vmc-on-aws" : "<!--\ntitle: Informationen zu VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>\n    Copyright © 2017-2020 VMware, Inc. Alle Rechte vorbehalten. Dieses Produkt ist durch Urheberrechtsgesetze und Gesetze zum Schutz geistigen Eigentums in den USA und anderen Ländern sowie durch internationale Verträge geschützt. VMware Produkte unterliegen einem oder mehreren Patenten, die unter <a\n        href=\"http://www.vmware.com/go/patents-de\"\n        target=\"_blank\"\n    >http://www.vmware.com/go/patents-de</a> aufgeführt sind.\n</p>\n<p>VMware ist eine eingetragene Marke oder Marke der VMware, Inc. in den USA und anderen Rechtssystemen.\n    Alle anderen hierin erwähnten Bezeichnungen und Namen können Marken der jeweiligen Unternehmen sein.</p>\n",
    "ad24817552198eb1a923aebd467e0274" : "<!--\ntitle: Wie behebe ich IPsec-VPN-Verbindungsfehler?\ncontext: [networking,vpn]\n-->\n<p>Nachdem Sie eine VPN-Verbindung zwischen dem Computing-Gateway\n    Ihres SDDC und einem lokalen Computing-Netzwerk erstellt haben, können Sie auf der Registerkarte „Netzwerk“\n    anhand des VPN-Status überprüfen, ob der VPN-Tunnel ordnungsgemäß verbunden ist.\n    Die VPN-Erstellung kann aufgrund einer fehlerhaften Konfiguration auf der Seite des SDDC\n    oder des lokalen Netzwerks fehlschlagen. Klicken Sie auf „VPN-Statusdetails“, um weitere Informationen zum\n    VPN-Status, einschließlich Kanal- und Tunnel-Fehlermeldungen, zu erhalten.\n    Die Liste der VPN-Fehlermeldungen enthält empfohlene Korrekturen für die Hauptursache des Fehlers.</p>\n\n<p>\n    Kanalmeldung:\n    <kbd>Policy does not allow OAKLEY_RSA_SIG authentication...</kbd>\n    <br>Tunnelmeldung:\n    <kbd> No acceptable Oakley Transform, sending notification...</kbd>\n    <br> <strong>Vorgeschlagene Korrektur:</strong> Legen Sie den lokalen VPN-\n    Authentifizierungsmodus auf PSK fest.\n</p>\n<p>\n    Kanalmeldung:\n    <kbd>peer is NATed...</kbd>\n    <br>Tunnelmeldung:\n    <kbd>peer is NATed...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Überprüfen Sie, ob die lokale\n    Firewall Port 4500 für UDP-Datenverkehr zwischen dem lokalen VPN\n    und der öffentlichen IP-Adresse des SDDC-VPN öffnet.\n<p>\n    Kanalmeldung:\n    <kbd> sending notification NO_PROPOSAL_CHOSEN ...</kbd>\n    <br>Tunnelmeldung:\n    <kbd> NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Laden Sie die SDDC-VPN-\n    Konfiguration herunter und überprüfen Sie, ob das lokale VPN über die gleiche Phase-1-\n    IPsec_configuration verfügt.\n</p>\n<p>\n    Kanalmeldung: keine<br> Tunnelmeldung:\n    <kbd> NO_PROPOSAL_CHOSEN msgid=00000000 ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Laden Sie die SDDC-VPN-\n    Konfiguration herunter und überprüfen Sie, ob das lokale VPN über die gleiche Phase-2-\n    IPsec_configuration verfügt.\n</p>\n<p>\n    Kanalmeldung: keine<br> Tunnelmeldung:\n    <kbd> cannot respond to IPsec SA request because no connection is\n        known for ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Laden Sie die SDDC-VPN-\n    Konfiguration herunter und überprüfen Sie, ob das lokale VPN unter der\n    lokalen Adresse erreichbar ist, die unter den lokalen Konfigurationsadressen angezeigt wird, und die SDDC-\n    VPN-Benutzeroberfläche diese Adresse für <b>Remote-Gateway-IP</b> anzeigt.\n</p>\n<p>\n    Kanalmeldung:\n    <kbd>initiating Main Mode, STATE_MAIN_I1: initiate, deleting\n        state (STATE_MAIN_I1) ...</kbd>\n    <br>Tunnelmeldung:\n    <kbd>deleting state (STATE_MAIN_I1), STATE_MAIN_I1: initiate,\n        initiating Main Mode ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Überprüfen Sie, ob die lokalen\n    Firewallregeln für das Verwaltungs-Gateway ICMP-Ping-Datenverkehr zum\n    SDDC-VPN zulassen.\n</p>\n<p>\n    Kanalmeldung:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., we require peer to have ID '208.91.1.25', but peer declares\n        '10.146.97.30'...</kbd>\n    <br>Tunnelmeldung:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., deleting state (STATE_MAIN_R2), deleting state (STATE_QUICK_R2),\n        Main mode peer ID is ID_IPV4_ADDR: '10.146.97.30' ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Der Wert, der in der SDDC-IPsec-VPN-Benutzeroberfläche für <b>Öffentliche IP des Remote-Gateways</b> konfiguriert ist (208.91.1.25 in diesem Beispiel), entspricht nicht dem Wert, den das lokale VPN für seine Identität bereitstellt (10.146.97.30 in diesem Beispiel). Bearbeiten Sie den Wert von <b>Öffentliche IP des Remote-Gateways</b> in der SDDC-IPsec-VPN-Benutzeroberfläche oder aktualisieren Sie das lokale Netzwerk unter Verwendung einer lokalen ID, die mit dem Wert <b>Öffentliche IP des Remote-Gateways</b> in der SDDC-IPsec-VPN-Benutzeroberfläche übereinstimmt.\n\n</p>\n<p>\n    Kanalmeldung:\n    <kbd>received 1 malformed payload notifies, ...</kbd>\n    <br>Tunnelmeldung:\n    <kbd>sending notification PAYLOAD_MALFORMED to ..., probable\n        authentication failure (mismatch of preshared secrets?)...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Überprüfen Sie, ob der vorinstallierte Schlüssel,\n    der für das lokale Ende des VPN konfiguriert wurde, mit dem vorinstallierten\n    Schlüssel übereinstimmt, der in der SDDC-IPsec-VPN-Benutzeroberfläche konfiguriert wurde.\n</p>\n\n<p>\n    Weitere Informationen zur Fehlerbehebung bei Problemen mit VPN-Verbindungen finden Sie unter <a\n    href=\"https://docs.vmware.com/de/VMware-NSX-for-vSphere/6.4/com.vmware.nsx.troubleshooting.doc/GUID-3E4D0B69-B7E7-4C8B-BC78-A3FB3EE5E8BA.html\">Fehlerbehebung\n    für virtuelle private Netzwerke (VPN)</a> in der NSX for vSphere-Dokumentation.\n</p>\n",
    "add-custom-service" : "<!--\ntitle: Wie füge ich einen benutzerdefinierten Dienst hinzu?\ncontext: [networking, inventory]\nfeature: enableNsxtDeployment\n-->\n<P>Wenn Sie eine Firewallregel erstellen, können Sie angeben, dass sie für den Netzwerkdatenverkehr aus einem oder mehreren Diensten verwendet wird, die in der Bestandsliste Ihrer SDDC-Dienste definiert sind. Die Standardliste enthält VMware-Dienste wie z. B.\n   Remotekonsole und Bereitstellung, Standarddienste wie IKE, ICMP und TCP sowie viele bekannte Drittanbieterdienste. Sie können Dienste zu dieser Liste hinzufügen, indem Sie Werte, in der Regel Ports und Protokolle, aus\n   einer Liste von Diensttypen und zusätzlichen Diensteigenschaften auswählen.</p>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>Dienste &gt; NEUEN DIENST HINZUFÜGEN</strong> und geben Sie dem neuen Dienst einen Namen.\n   </li>\n   <li>Klicken Sie auf <strong>Diensteinträge festlegen</strong>, um die entsprechende Seite zu öffnen.\n   </li>\n   <li>Klicken Sie auf der Seite „Diensteinträge festlegen“ auf <strong>NEUEN DIENSTEINTRAG HINZUFÜGEN</strong>. <br> Um die Liste der bekannten Dienste anzuzeigen, können Sie mithilfe der Dropdown-Steuerfelder durch die Listen <strong>Diensttyp</strong> und <strong>Zusätzliche Eigenschaften</strong> scrollen. Um einen Dienst hinzuzufügen, wählen Sie einen <strong>Diensttyp</strong> aus dem Dropdown-Menü aus und geben Sie <strong>Zusätzliche Eigenschaften</strong> wie Quell- oder\n      Zielports des Diensts an. Klicken Sie dann auf <strong>ANWENDEN</strong>.\n   </li>\n   <li>(Optional) Geben Sie eine <strong>Beschreibung</strong> des Diensts an und markieren Sie den Dienst.\n   </li>\n   <li>Klicken Sie auf <strong>SPEICHERN</strong>, um die Dienstdefinition zu erstellen.\n   </li>\n</ol>",
    "add-host" : "<!--\ntitle: Wie füge ich zusätzliche Hosts hinzu?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>\n    <b></b>Sie können einen Host hinzufügen, wenn Ihr SDDC weniger als die maximal zulässigen Hosts enthält. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_010\"\n        target=\"_blank\"\n    >Hosts hinzufügen</a>.",
    "add-management-group" : "<!--\ntitle: Wie füge ich Verwaltungsgruppen hinzu?\ncontext: [networking, inventory]\nfeature: enableNsxtDeployment\n-->\n<p>Vordefinierte Verwaltungs-Bestandslistengruppen werden automatisch für die SDDC-Infrastrukturkomponenten wie z. B. vCenter und NSX Manager erstellt. Sie können eine vordefinierte Verwaltungsgruppe nicht ändern, aber Sie können zusätzliche Verwaltungs-Bestandslistengruppen durch Angabe der CIDR-Blöcke, mit denen die Gruppenmitglieder verbunden sind, erstellen.</p>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>Bestandsliste &gt; Gruppen</strong>.\n   </li>\n   <li>Klicken Sie auf der Gruppenseite auf <strong>VERWALTUNGSGRUPPEN</strong>, anschließend auf <strong>GRUPPE HINZUFÜGEN</strong> und geben Sie dann der Gruppe einen <strong>Namen</strong> und optional eine <strong>Beschreibung</strong>.\n   </li>\n   <li>Klicken Sie auf <strong>Mitglieder festlegen</strong>, um die Seite <strong>Mitglieder auswählen</strong> zu öffnen. Geben Sie eine oder mehrere IP-Adressen von Verwaltungs-VMs im CIDR-Format ein.\n   </li>\n   <li>(Optional) Markieren Sie die Gruppe.</li>\n   <li>Klicken Sie auf <strong>SPEICHERN</strong>, um die Gruppe zu erstellen.\n   </li>\n</ol>",
    "add-workload-groups" : "<!--\ntitle: Wie füge ich Arbeitslast- oder Computing-Gruppen hinzu?\ncontext: [networking,inventory]\n-->\n<p>Da Computing-Bestandslistengruppen aus den Computing-VMs bestehen, die Sie in Ihren Computing-Netzwerksegmenten bereitstellen, kann VMware Cloud on AWS sie nicht für Sie erstellen. Sie müssen sie selbst erstellen, bevor Sie Firewallregeln für das Computing-Gateway entwickeln können.</p>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>Bestandsliste &gt; Gruppen</strong>.\n   </li>\n   <li>Klicken Sie auf der Gruppenseite auf <strong>COMPUTING-GRUPPEN</strong>, anschließend auf <strong>GRUPPE HINZUFÜGEN</strong> und geben Sie dann der Gruppe einen <strong>Namen</strong> und optional eine <strong>Beschreibung</strong>.\n   </li>\n   <li>Klicken Sie auf <strong>Mitglieder festlegen</strong>, um die Seite <strong>Mitglieder auswählen</strong> zu öffnen. Weitere Informationen zur Benennung der Mitgliedschaft in einer Computing-Gruppe finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_023\" target=\"_blank\"\n   >Hinzufügen oder Ändern einer Computing-Gruppe</a>.\n   </li>\n   <li>(Optional) Markieren Sie die Gruppe.</li>\n   <li>Klicken Sie auf <strong>SPEICHERN</strong>, um die Gruppe zu erstellen. \n   </li>\n</ol>",
    "advanced-security" : "<!--\ntitle: Was ist das NSX Advanced Security-Add-On?\ncontext: [networking,addons]\nfeature: uiEnableNsxtAddon\n-->\n<p>\nNSX Advanced Security für VMware Cloud on AWS gibt Ihrem SDDC Zugriff auf NSX-Anwendungssicherheitsfunktionen, wie z. B.\n<a\n        href=\"https://docs.vmware.com/de/VMware-NSX-T-Data-Center/3.0/administration/GUID-967EA04D-EA5A-4E0C-ACC3-D05B282C7FAF.html\"\n        target=\"_blank\"\n    >Kontextprofile</a>.\n</p>\n",
    "ae317d4d23c887da92794b8baed1d765" : "<!--\ntitle: Informationen zu VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>Copyright © 2017 VMware, Inc. Alle Rechte vorbehalten. Dieses Produkt ist durch das Urheberrecht und Gesetze zum geistigen Eigentum in den USA und anderen Ländern sowie durch internationale Abkommen geschützt. VMware-Produkte sind durch ein oder mehrere der unter <a href=\"http://www.vmware.com/go/patents-de\" target=\"_blank\">http://www.vmware.com/go/patents-de</a> aufgeführten Patente geschützt.</p>\n<p>VMware ist eine eingetragene Marke oder Marke der VMware, Inc. in den USA und anderen Rechtssystemen. Alle anderen hierin erwähnten Bezeichnungen und Namen können Marken der jeweiligen Unternehmen sein.</p>",
    "attach-private-vif" : "<!--\ntitle: Wie hänge ich eine private virtuelle Schnittstelle an mein Cloud-SDDC an?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    Eine private virtuelle AWS-Schnittstelle (VIF) verwendet einen privaten IP-Adressbereich und bietet eine private dedizierte Verbindung\n    zum AWS-Netzwerk-Backbone, die bei Ihrer VPC endet. Melden Sie sich bei der AWS-\n    Konsole an, um die private VIF zu erstellen. Melden Sie sich anschließend bei Ihrer SDDC-Konsole an, um die VIF anzuhängen. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_014\"\n        target=\"_blank\"\n    >Erstellen einer privaten virtuellen Schnittstelle für vMotion- und ESXi-Verwaltungsdatenverkehr</a>. Beachten Sie, dass Ihre Organisation\n    die für diese Schnittstelle gegebenenfalls anfallenden Datenverkehrsgebühren übernehmen muss, bevor Sie damit beginnen, sie zum Verbinden\n    eines lokalen Datencenters mit Ihrem SDDC zu verwenden.\n</p>\n",
    "available-roles" : "<!--\ntitle: Welche Rollen kann ich einem neuen Benutzer zuweisen?\ncontext: [dashboard, invite]\n-->\n<p>Ein Organisationsbesitzer muss jedem Organisationsmitglied eine der folgenden Rollen zuweisen:</p>\n<ul class=\"list\">\n    <li>Organisationsbesitzer: Nur Organisationsbesitzer können andere Benutzer einladen, der Organisation beizutreten.</li>\n    <li>Mitglied der Organisation: Organisationsmitglieder können zu der Organisation gehörende Cloud-Datencenter erstellen und verwalten sowie darauf zugreifen. Sie können jedoch keine neuen Benutzer einladen.</li>\n</ul>\n<p>\n    Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_021\"\n        target=\"_blank\"\n    >Zuweisen einer VMC-Dienstrolle an Organisationsmitglieder</a>.\n</p>",
    "bb4bd2b0bac3cadb60ded3460a132c6c" : "<!--\ntitle: Welche Aktionen kann ich auf der Seite „Netzwerk“ ausführen?\ncontext: [networking]\n-->\n<p>Auf der Seite „Netzwerk“ können Sie:</p>\n<ul class=\"list\">\n    <li>Ein Topologiediagramm anzeigen, das den Status der Netzwerkverbindungen zu und von Ihrem SDDC zeigt.</li>\n    <li>Firewallregeln für die Verwaltungs- und Computing-Gateways erstellen.</li>\n    <li>VPN-Einstellungen für IPsec-VPN-Verbindungen zwischen Ihrem SDDC und einem lokalen Datencenter konfigurieren.</li>\n    <li>DNS-Einstellungen für die Verwaltungs- und Computing-Gateways konfigurieren.</li>\n    <li>Logische Netzwerke anzeigen. (Verwenden Sie zum Konfigurieren logischer Netzwerke den vSphere Client.)</li>\n    <li>Eingehende NAT für Ihr Computing-Gateway konfigurieren.</li>\n    <li>Öffentliche IP-Adressen für Ihr Computing-Gateway erstellen.</li>\n    <li>Informationen über die verbundene Amazon-VPC anzeigen.</li>\n    <li>Private virtuelle AWS Direct Connect-Schnittstellen an Ihr SDDC anhängen.</li>\n</ul>\n",
    "bb6d9d33a0a0560a5eaa7ba985b8fceb" : "<!--\ntitle: Wie stelle ich mithilfe von PowerCLI eine Verbindung zu meinem SDDC her?\ncontext: [connection-info]\n-->\n\n<p>Bevor Sie mithilfe von PowerCLI eine Verbindung herstellen können, müssen Sie eine Firewallregel erstellen, um den Zugriff auf vCenter Server zuzulassen. Weitere Informationen finden Sie unter <a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Festlegen von Firewallregeln für das Verwaltungs-Gateway</a>.</p>\n<ol class=\"list\">\n    <li>Starten Sie PowerCLI auf Ihrem Clientcomputer.</li>\n    <li>Kopieren Sie auf der Seite „Verbindungsinformationen“ in der VMC Console den Befehl unter <b>PowerCLI Connect</b>, indem Sie auf die Schaltfläche zum Kopieren klicken.</li>\n    <li>Fügen Sie den Befehl in das PowerCLI-Fenster ein.</li>\n    <li>Ersetzen Sie das <tt>&lt;Kennwort&gt;</tt> durch das unter <b>Authentifizierung</b> angezeigte Kennwort. Wenn das Kennwort Sonderzeichen enthält, schließen Sie es in einfache Anführungszeichen ein.</li>\n</ol>\n",
    "c0ecc7ac8dc10d134d859bd7c95f90e0" : "<!--\ntitle: Wie füge ich zusätzliche Hosts hinzu?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Sie können einen Host hinzufügen, wenn das SDDC weniger Hosts als die maximal zulässige Anzahl enthält. Wird die Option <b>Hosts hinzufügen</b> im Menü <b>Aktionen</b> nicht angezeigt, wenden Sie sich an VMware.</p>\n    \n<p>So fügen Sie einen Host hinzu:</p>\n<ol class=\"list\">\n    <li>Navigieren Sie zur Registerkarte <b>Übersicht</b> für Ihr SDDC.</li>\n    <li>Wählen Sie <b>Aktionen</b> &gt; <b>Hosts hinzufügen</b> aus.</li>\n    <li>Wählen Sie die Anzahl der hinzuzufügenden Hosts aus.</li>\n    <li>Klicken Sie auf <b>Hosts hinzufügen</b>.</li>\n</ol>\n<p>Die Größe des SDDC zu ändern, kann mehrere Minuten dauern. Während die Hosts hinzugefügt werden, werden Ihre Arbeitslasten und vCenter Server weiterhin wie gewohnt ausgeführt. Sie können jedoch keine weiteren Aktionen zum Hinzufügen oder Entfernen von Hosts starten.</p>\n",
    "c1dcdcbe735c6e47a057611d5c3ed1f9" : "<!--\ntitle: Wie richte ich eine L2-VPN-Verbindung zum Computing-Gateway ein?\ncontext: [networking,l2vpn]\n-->\n<p>\n\tDas Einrichten eines L2-VPN ist Teil der Konfiguration eines erweiterten Netzwerks. Ein erweitertes Netzwerk hat einen einzigen IP-Adressraum, der sich über Ihre lokale und Ihre SDDC-\tUmgebung erstreckt. Dies vereinfacht die Migration von Arbeitslast-VMs zu und von Ihrem Cloud-SDDC.\n</p>\n<ol class=\"list\">\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-B447CF8B-8A5F-4189-8E12-078E0FD62320.html\">Konfigurieren Sie den L2-VPN-Server in Ihrem SDDC.</a>\n\t\tDas Computing-Gateway in Ihrem Cloud-SDDC fungiert als L2-VPN-Server und stellt die SDDC-Seite des L2-VPN bereit, das ein erweitertes Netzwerk stützt. Verwenden Sie die VMC Console zum Konfigurieren des Servers.\n\t</li>\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-027ECB6F-78D7-4089-8E71-3FEE6F327D72.html\">Konfigurieren und\t\t\taktivieren Sie Ihren lokalen L2-VPN-Client.</a>\t\tNachdem die SDDC-Seite des L2-VPN konfiguriert ist, werden Sie vom System dazu aufgefordert, die Remote-Seite (lokale Seite) des L2-VPN zu konfigurieren. Sie können dazu Ihr vorhandenes lokales NSX\t\tverwenden, oder Sie können eine eigenständige NSX-Appliance herunterladen.\n\t</li>\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-AFC96BF4-DBE4-4AFC-85E3-749C09289758.html\">Erstellen Sie ein erweitertes Netzwerk in Ihrem SDDC.</a>\n\t\tGeben Sie die IDs der von Ihnen in Schritt 1 und Schritt 2 erstellten Tunnels an. Nachdem das erweiterte Netzwerk konfiguriert ist, können Sie den L2 VPN-Tunnel hochfahren.\n\t</li>\n</ol>\n<p>\n\tUm zu überprüfen, ob der L2-VPN-Tunnel ordnungsgemäß verbunden ist, öffnen Sie die Zeile <b>L2-VPNs</b> unter <b>Computing-Gateway</b> und aktualisieren Sie den Status.\n</p>\n",
    "c4a6fedc7bfcfeb8f152266f21e8d145" : "<!--\ntitle: Wie sollte ich den vCenter Server-FQDN konfigurieren?\ncontext: [networking,dns]\n-->\n<p>Als Teil der Verwaltungs-Gateway-DNS-Einstellungen müssen Sie konfigurieren, wie der vollqualifizierte Domänenname des vCenter Servers aufgelöst werden soll.</p>\n<ul class=\"list\">\n    <li>Wenn Sie über das Internet auf vCenter Server zugreifen, wählen Sie <b>Öffentliche IP</b> aus.</li>\n    <li>Wenn Sie ein VPN konfiguriert haben und das VPN für den Zugriff auf vCenter Server verwenden, wählen Sie <b>Private IP</b> aus.</li>\n</ul>\n",
    "ccbad6ce65d351ae7236e3fd1697c46d" : "<!--\ntitle: Wie verwalte ich öffentliche IP-Adressen?\ncontext: [networking,public-ip]\n-->\n<p>Sie können öffentliche IP-Adressen anfordern, die Arbeitslast-VMs zugewiesen werden, um den Zugriff auf diese VMs über das Internet zu gestatten. VMware Cloud on AWS stellt die IP-Adressen über AWS bereit. Bevor Sie eine öffentliche IP-Adresse erstellen, sollten Sie Ihrer VM eine statische IP-Adresse aus dem logischen Netzwerk, mit dem sie verbunden ist, zuweisen. </p>\n<ol class=\"list\">\n    <li>Klicken Sie auf der Registerkarte „Netzwerk“ Ihres SDDC unter <b>Computing-Gateway</b> auf <b>Öffentliche IPs</b>.</li>\n    <li>Klicken Sie auf <b>Öffentliche IP anfordern</b>.</li>\n    <li>Geben Sie Hinweise zu dieser IP-Adresse ein und klicken Sie auf <b>Speichern</b>.</li>\n</ol>\n<p>Gehen Sie wie folgt vor, um diese öffentliche IP-Adresse zu verwenden:</p>\n<ul class=\"list\">\n    <li>Konfigurieren Sie eine NAT-Regel, um die öffentliche IP-Adresse mit der internen IP-Adresse einer VM zu verbinden.</li>\n    <li>Fügen Sie eine Computing-Gateway-Firewallregel hinzu, um Datenverkehr zwischen der öffentlichen IP-Adresse und dem logischen Netzwerk, mit dem die VM verbunden ist, zuzulassen.</li>\n</ul>\n",
    "choose-management-ip" : "<!--\ntitle: Wie wähle ich den IP-Adressbereich für das Verwaltungsnetzwerk?\ncontext: [networking]\n-->\n<p>\n    Nachdem das SDDC erstellt wurde, können Sie die für das Verwaltungsnetzwerk angegebenen Werte nicht mehr ändern.\n    Beachten Sie bei der Auswahl dieser Werte Folgendes:\n</p>\n<ul class=\"list\">\n    <li>Wählen Sie einen IP-Adressbereich, der sich mit dem AWS-Subnetz, zu dem Sie eine Verbindung herstellen, nicht überschneidet. Wenn Sie planen,\n        Ihr SDDC mit einem lokalen Datencenter zu verbinden, müssen sich die von Ihnen für das Verwaltungsnetzwerk gewählten IP-Adressen\n        von denjenigen in Ihrem lokalen Datencenter unterscheiden, damit keine IP-Adressenkonflikte auftreten.</li>\n    <li>\n        CIDR-Blöcke der Größe 16, 20 oder 23 werden unterstützt. Die maximale Anzahl an Hosts, die Ihr SDDC enthalten kann, hängt für CIDR-Blöcke der Größe 20 oder 23\n        von der von Ihnen angegebenen CIDR-Blockgröße und davon ab, ob das SDDC eine einzelne\n        Verfügbarkeitszone (Availability Zone – AZ) oder mehrere AZs einnimmt.\n        <dl class=\"list\">\n            <dt>CIDR-Blockgröße 23</dt>\n            <dd>Bis zu 27 Hosts (einzelne AZ). Bis zu 22 Hosts (mehrere AZs).</dd>\n            <dt>CIDR-Blockgröße 20 oder 16</dt>\n            <dd>Bis zu 160 Hosts, unabhängig von der Anzahl der Verfügbarkeitszonen.</dd>\n        </dl>\n    </li>\n</ul>",
    "compute-firewall-rules" : "<!--\ntitle: Wie richte ich Firewallregeln für das Computing-Gateway ein?\ncontext: [networking,firewall]\n-->\n<p>\n    Die standardmäßigen Firewallregeln für das Computing-Gateway blockieren sämtlichen eingehenden und ausgehenden Datenverkehr. Bevor Sie ein neues Computing-\n    Gateway verwenden können, müssen Sie Firewallregeln erstellen, die Datenverkehr nach Bedarf zulassen. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0E66C9C8-C260-4056-8511-44818431110C.html\"\n        target=\"_blank\"\n    >Festlegen von Firewallregeln für das Computing-Gateway</a>.\n</p>\n",
    "compute-ipsec-vpn-connection" : "<!--\ntitle: Wie richte ich eine IPsec-VPN-Verbindung zum Computing-Gateway ein?\ncontext: [networking,vpn]\n-->\n<p>\n    Das Computing-Gateway bietet Zugriff auf Ihre Arbeitslast-VMs. Ein IPsec-VPN bietet Konnektivität zwischen dem Computing-\n    Gateway und dem Computing-Netzwerk in Ihrem SDDC. Befolgen Sie zum Erstellen einer IPsec-VPN-Verbindung zum Computing-Gateway die\n    Schritte unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-93C55532-5734-4B70-8745-C3E779512869.html\"\n        target=\"_blank\"\n    >Erstellen eines Computing-VPN</a>.\n</p>\n",
    "compute-ipsec-vpn-connection-err" : "<!--\ntitle: Wie behebe ich IPsec-VPN-Verbindungsfehler?\ncontext: [networking,vpn]\n-->\n<p>Nachdem Sie eine VPN-Verbindung zwischen dem Computing-Gateway\n    Ihres SDDC und einem lokalen Computing-Netzwerk erstellt haben, können Sie auf der Registerkarte „Netzwerk“\n    anhand des VPN-Status überprüfen, ob der VPN-Tunnel ordnungsgemäß verbunden ist.\n    Die VPN-Erstellung kann aufgrund einer fehlerhaften Konfiguration auf der Seite des SDDC\n    oder des lokalen Netzwerks fehlschlagen. Klicken Sie auf „VPN-Statusdetails“, um weitere Informationen zum\n    VPN-Status, einschließlich Kanal- und Tunnel-Fehlermeldungen, zu erhalten.\n    Die Liste der VPN-Fehlermeldungen enthält empfohlene Korrekturen für die Hauptursache des Fehlers.</p>\n\n<p>\n    Kanalmeldung:\n    <kbd>Policy does not allow OAKLEY_RSA_SIG authentication...</kbd>\n    <br>Tunnelmeldung:\n    <kbd> No acceptable Oakley Transform, sending notification...</kbd>\n    <br> <strong>Vorgeschlagene Korrektur:</strong> Legen Sie den lokalen VPN-\n    Authentifizierungsmodus auf PSK fest.\n</p>\n<p>\n    Kanalmeldung:\n    <kbd>peer is NATed...</kbd>\n    <br>Tunnelmeldung:\n    <kbd>peer is NATed...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Überprüfen Sie, ob die lokale\n    Firewall Port 4500 für UDP-Datenverkehr zwischen dem lokalen VPN\n    und der öffentlichen IP-Adresse des SDDC-VPN öffnet.\n<p>\n    Kanalmeldung:\n    <kbd> sending notification NO_PROPOSAL_CHOSEN ...</kbd>\n    <br>Tunnelmeldung:\n    <kbd> NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Laden Sie die SDDC-VPN-\n    Konfiguration herunter und überprüfen Sie, ob das lokale VPN über die gleiche Phase-1-\n    IPsec_configuration verfügt.\n</p>\n<p>\n    Kanalmeldung: keine<br> Tunnelmeldung:\n    <kbd> NO_PROPOSAL_CHOSEN msgid=00000000 ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Laden Sie die SDDC-VPN-\n    Konfiguration herunter und überprüfen Sie, ob das lokale VPN über die gleiche Phase-2-\n    IPsec_configuration verfügt.\n</p>\n<p>\n    Kanalmeldung: keine<br> Tunnelmeldung:\n    <kbd> cannot respond to IPsec SA request because no connection is\n        known for ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Laden Sie die SDDC-VPN-\n    Konfiguration herunter und überprüfen Sie, ob das lokale VPN unter der\n    lokalen Adresse erreichbar ist, die unter den lokalen Konfigurationsadressen angezeigt wird, und die SDDC-\n    VPN-Benutzeroberfläche diese Adresse für <b>Remote-Gateway-IP</b> anzeigt.\n</p>\n<p>\n    Kanalmeldung:\n    <kbd>initiating Main Mode, STATE_MAIN_I1: initiate, deleting\n        state (STATE_MAIN_I1) ...</kbd>\n    <br>Tunnelmeldung:\n    <kbd>deleting state (STATE_MAIN_I1), STATE_MAIN_I1: initiate,\n        initiating Main Mode ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Überprüfen Sie, ob die lokalen\n    Firewallregeln für das Verwaltungs-Gateway ICMP-Ping-Datenverkehr zum\n    SDDC-VPN zulassen.\n</p>\n<p>\n    Kanalmeldung:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., we require peer to have ID '208.91.1.25', but peer declares\n        '10.146.97.30'...</kbd>\n    <br>Tunnelmeldung:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., deleting state (STATE_MAIN_R2), deleting state (STATE_QUICK_R2),\n        Main mode peer ID is ID_IPV4_ADDR: '10.146.97.30' ...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Der Wert, der in der SDDC-IPsec-VPN-Benutzeroberfläche für <b>Öffentliche IP des Remote-Gateways</b> konfiguriert ist (208.91.1.25 in diesem Beispiel), entspricht nicht dem Wert, den das lokale VPN für seine Identität bereitstellt (10.146.97.30 in diesem Beispiel). Bearbeiten Sie den Wert von <b>Öffentliche IP des Remote-Gateways</b> in der SDDC-IPsec-VPN-Benutzeroberfläche oder aktualisieren Sie das lokale Netzwerk unter Verwendung einer lokalen ID, die mit dem Wert <b>Öffentliche IP des Remote-Gateways</b> in der SDDC-IPsec-VPN-Benutzeroberfläche übereinstimmt.\n\n</p>\n<p>\n    Kanalmeldung:\n    <kbd>received 1 malformed payload notifies, ...</kbd>\n    <br>Tunnelmeldung:\n    <kbd>sending notification PAYLOAD_MALFORMED to ..., probable\n        authentication failure (mismatch of preshared secrets?)...</kbd>\n    <br> <strong>Vorgeschlagene Behebung:</strong> Überprüfen Sie, ob der vorinstallierte Schlüssel,\n    der für das lokale Ende des VPN konfiguriert wurde, mit dem vorinstallierten\n    Schlüssel übereinstimmt, der in der SDDC-IPsec-VPN-Benutzeroberfläche konfiguriert wurde.\n</p>\n\n<p>\n    Weitere Informationen zur Fehlerbehebung bei Problemen mit VPN-Verbindungen finden Sie unter <a\n    href=\"https://docs.vmware.com/de/VMware-NSX-for-vSphere/6.4/com.vmware.nsx.troubleshooting.doc/GUID-3E4D0B69-B7E7-4C8B-BC78-A3FB3EE5E8BA.html\">Fehlerbehebung\n    für virtuelle private Netzwerke (VPN)</a> in der NSX for vSphere-Dokumentation.\n</p>\n",
    "compute-l2-vpn-connection" : "<!--\ntitle: Wie richte ich eine L2-VPN-Verbindung zum Computing-Gateway ein?\ncontext: [networking,l2vpn]\n-->\n<p>\n    Das Computing-Gateway verwendet ein L2-VPN, um Zugriff auf in Ihrem SDDC ausgeführte Arbeitslast-VMs zu gewähren. Das Einrichten eines L2-\n    VPN ist Teil der Konfiguration eines erweiterten Netzwerks. Ein erweitertes Netzwerk hat einen einzelnen IP-Adressbereich, der\n    sich über Ihre lokale und Ihre SDDC-Umgebung erstreckt. Hierdurch wird die Migration von Arbeitslast-VMs zu und von Ihrem Cloud-SDDC vereinfacht.\n    Zum Erstellen eines L2VPN in einem SDDC mit einem von VMware NSX for vSphere gestützten Netzwerk führen Sie die folgenden Schritte aus:\n<ol class=\"list\">\n    <li>\n        <a\n            href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-B447CF8B-8A5F-4189-8E12-078E0FD62320.html\"\n            target=\"_blank\"\n        >Konfigurieren Sie den L2-VPN-Server in Ihrem SDDC.</a> Das Computing-Gateway in Ihrem Cloud-SDDC fungiert als L2-VPN-Server\n        und stellt die SDDC-Seite des L2-VPN bereit, das ein erweitertes Netzwerk stützt. Verwenden Sie die VMC Console zum Konfigurieren des\n        Servers.\n    </li>\n    <li>\n        <a\n            href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-027ECB6F-78D7-4089-8E71-3FEE6F327D72.html\"\n            target=\"_blank\"\n        >Konfigurieren und aktivieren Sie Ihren lokalen L2-VPN-Client.</a> Nachdem die SDDC-Seite des L2-VPN konfiguriert ist, werden Sie vom\n        System dazu aufgefordert, die Remote-Seite (lokale NSX-Seite) des L2-VPN zu konfigurieren. Sie können dazu Ihr vorhandenes\n        lokales NSX verwenden, oder Sie können eine eigenständige NSX-Appliance herunterladen.\n    </li>\n    <li>\n        <a\n            href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-AFC96BF4-DBE4-4AFC-85E3-749C09289758.html\"\n            target=\"_blank\"\n        >Erstellen Sie ein erweitertes Netzwerk in Ihrem SDDC.</a> Geben Sie die IDs der von Ihnen in Schritt 1 und Schritt 2 erstellten Tunnels an.\n        Nachdem das erweiterte Netzwerk konfiguriert ist, können Sie den L2-VPN-Tunnel hochfahren. Um sich zu vergewissern, dass der L2-VPN-\n        Tunnel ordnungsgemäß verbunden ist, öffnen Sie die Zeile <b>L2-VPNs</b> unter <b>Computing-Gateway</b> und aktualisieren Sie den\n        Status.\n    </li>\n</ol>\n</p>\n",
    "configure-IPFIX" : "<!--\ntitle: Wie konfiguriere ich den IPFIX-Collector und die Sitzung?\ncontext: [networking, tools, toolsipfix]\nfeature: enableNsxtDeployment\n-->\n<p>IPFIX (Internet Protocol Flow Information Export) ist ein Standard für das Format und den Export der Netzwerk-Flow-Informationen zur Fehlerbehebung, zum Überwachen oder zum Erfassen von Analyseinformationen. Sie können die Flow-Überwachung auf einem logischen Segment konfigurieren. Alle Flows aus den VMs, die mit diesem logischen Segment verbunden sind, werden erfasst und an den IPFIX-Collector gesendet. Der IPFIX-Collector kann sich im lokalen Datencenter auf einem der logischen Segmente befinden.</p>\n<p>\n   <strong>Voraussetzung</strong>\n</p>\n<p>\n   Stellen Sie sicher, dass ein logisches Segment konfiguriert ist. Weitere Informationen hierzu finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-267DEADB-BD01-46B7-82D5-B9AA210CA9EE.html\"\n   >Erstellen oder Ändern eines Netzwerksegments</a>.\n</p>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>IPFIX &gt; COLLECTOREN &gt; NEUEN COLLECTOR HINZUFÜGEN</strong> und geben Sie dem Collector einen <strong>Namen</strong>.\n   </li>\n   <li>Geben Sie die IP-Adresse und den Port des Collectors ein. <br> Der Standardport für UDP ist 4739. Sie können bis zu vier IPFIX-Collectoren hinzufügen.\n   </li>\n   <li>Klicken Sie auf <strong>SPEICHERN</strong>.\n   </li>\n   <li>Klicken Sie auf <strong>SWITCH-IPFIX-PROFILE</strong>, um ein Switch-IPFIX-Profil zu erstellen oder zu bearbeiten. <br>\n      Weitere Informationen zu den Profilparametern für NSX-T-Switch-IPFIX finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-NSX-T-Data-Center/2.5/administration/GUID-3458F2B3-089E-4BFC-8348-705172F2B802.html\"\n   >Konfigurieren von Switch-IPFIX-Profilen</a>.\n   </li>\n   <li>(Optional) Markieren Sie das Profil.</li>\n   <li>Klicken Sie auf <strong>SPEICHERN</strong>, um das Profil zu erstellen.\n   </li>\n</ol>",
    "configure-nat" : "<!--\ntitle: Wie erstelle oder ändere ich NAT-Regeln?\ncontext: [networking, nat, nat_nsx]\nfeature: enableNsxtDeployment\n-->\n<p>Die Netzwerkadressübersetzung (NAT) ordnet interne IP-Adressen in Ihrem Computing-Netzwerk den Adressen zu, die dem öffentlichen Internet ausgesetzt sind. Um eine NAT-Regel zu erstellen, geben Sie die interne Adresse und die Portnummer einer\n   Arbeitslast-VM oder eines Dienstes sowie eine öffentliche IP-Adresse und Portnummer an, die Sie vom System bezogen haben.</p>\n<p>Die NAT-Regeln müssen auf der Internetschnittstelle des SDDC ausgeführt werden. Dies ist der Ort, an dem die öffentlichen Adressen\n   der Arbeitslast-VMs angezeigt werden. Firewallregeln, die Paketquellen und -ziele untersuchen, werden auf dem Computing-\n   Gateway ausgeführt und verarbeiten den Datenverkehr, nachdem er durch alle anwendbaren NAT-Regeln umgewandelt wurde. Beim Erstellen einer\n   NAT-Regel können Sie angeben, ob die interne oder die externe IP-Adresse und die Portnummer einer VM\n   Firewallregeln ausgesetzt sind, die den Netzwerkdatenverkehr zu und von dieser VM betreffen.</p>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>NAT &gt; NAT-REGEL HINZUFÜGEN</strong> und geben Sie der Regel einen <strong>Namen</strong>.\n   </li>\n   <li>Geben Sie die NAT-Regelparameter ein. <br> Weitere Informationen zu den NAT-Regel-Parametern und dem entsprechenden Vorgang finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_024\" target=\"_blank\"\n   >Erstellen oder Ändern von NAT-Regeln</a>.\n   </li>\n   <li>(Optional) Wechseln Sie zu <strong>Protokollieren</strong>, um Regelaktionen zu protokollieren.\n   </li>\n   <li>Die neue Regel ist standardmäßig aktiviert. Wechseln Sie zu <strong> Aktivieren</strong>, um sie zu deaktivieren.\n   </li>\n   <li>Klicken Sie auf <strong>SPEICHERN</strong>, um die Regel zu erstellen.\n   </li>\n</ol>",
    "configure-portmirroring" : "<!--\ntitle: Wie konfiguriere ich eine Portspiegelungssitzung?\ncontext: [networking, tools, toolsportmirroring]\nfeature: enableNsxtDeployment\n-->\n<p>Mit der Portspiegelung können Sie den gesamten Datenverkehr, der aus einer Quelle stammt, replizieren und umleiten. Der gespiegelte\n   Datenverkehr wird in einem Generic Routing Encapsulation(GRE)-Tunnel an einen Collector gesendet, sodass alle\n   der Originalpaketinformationen während des Durchlaufens des Netzwerks zu einem Remoteziel beibehalten werden.</p>\n<p>Die Portspiegelung wird in folgenden Fällen verwendet:</p>\n<ul>\n   <li>Fehlerbehebung – Analysieren Sie den Datenverkehr, um Eindringlinge zu erkennen und Fehler in einem Netzwerk zu diagnostizieren und zu beheben.</li>\n   <li>Übereinstimmung und Überwachung – Leiten Sie den gesamten überwachten Datenverkehr zur Analyse und Behebung an eine Network Appliance weiter.</li>\n</ul>\n<p>Die Portspiegelung umfasst eine Quellgruppe, in der die Daten überwacht werden, und eine Zielgruppe, in die die\n   erfassten Daten kopiert werden. Die Kriterien für die Mitgliedschaft in der Quellgruppe erfordern die Gruppierung von VMs basierend auf der\n   Arbeitslast wie Webgruppe oder Anwendungsgruppe. Die Kriterien für die Mitgliedschaft in der Zielgruppe erfordern die Gruppierung von VMs basierend auf den IP-Adressen.</p>\n<P>Die Portspiegelung verfügt über einen Erzwingungspunkt, an dem Sie Richtlinienregeln auf Ihre SDDC-Umgebung anwenden können.</p>\n<P>\n   <strong>Voraussetzung</strong>\n</p>\n<p>Stellen Sie sicher, dass Arbeitslastgruppen mit IP-Adresse und VM-Mitgliedschaftskriterien verfügbar sind.\n</li>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>Portspiegelung &gt; PROFIL HINZUFÜGEN</strong> und geben Sie dem Profil einen <strong>Namen</strong> und eine optionale <strong>Beschreibung</strong>.\n   </li>\n   <li>Geben Sie die Profilparameter an. <br> Weitere Informationen zu Portspiegelungsparametern finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_028\" target=\"_blank\"\n   >Konfigurieren der Portspiegelung</a>.\n   </li>\n   <li>Klicken Sie auf <strong>SPEICHERN</strong>, um die Sitzung zu erstellen.\n   </li>\n   <li>(Optional) Klicken Sie auf die Optionsschaltfläche neben einer Portspiegelungssitzung und wählen Sie <strong>Bearbeiten</strong> aus, um Änderungen an der Konfiguration vorzunehmen.\n   </li>\n</ol>",
    "configure-vcenter-fqdn" : "<!--\ntitle: Wie sollte ich den vCenter Server-FQDN konfigurieren?\ncontext: [networking,dns]\n-->\n<p>\n    Sie können eine Verbindung mit dem SDDC-vCenter Server entweder über eine öffentliche oder eine private IP-Adresse herstellen.\n    Eine private IP-Adresse kann über ein SDDC-VPN aufgelöst werden. Eine öffentliche IP-Adresse kann \n    über das Internet aufgelöst werden.\n</p>\n<p>Weitere Informationen finden Sie \n    unter <a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_015\">Festlegen der vCenter Server FQDN-Auflösungsadresse</a>.</p>\n",
    "connect-powercli" : "<!--\ntitle: Wie stelle ich mithilfe von PowerCLI eine Verbindung zu meinem SDDC her?\ncontext: [connection-info]\n-->\n<p>\n    Bevor Sie mithilfe von PowerCLI eine Verbindung herstellen können, müssen Sie eine Firewallregel erstellen, um den Zugriff auf vCenter Server zuzulassen. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_013\"\n        target=\"_blank\"\n    >Hinzufügen oder Ändern von Firewallregeln für das Verwaltungs-Gateway</a>.\n</p>\n<ol class=\"list\">\n    <li>Starten Sie PowerCLI auf Ihrem Clientcomputer.</li>\n    <li>\n        Kopieren Sie auf der Registerkarte <strong>Einstellungen</strong> in der VMC Console den Befehl unter <strong>PowerCLI\n            Connect</strong>, indem Sie auf die Schaltfläche zum Kopieren klicken.\n    </li>\n    <li>Fügen Sie den Befehl in das PowerCLI-Fenster ein.</li>\n    <li>\n        Ersetzen Sie das <tt>&lt;Kennwort&gt;</tt> durch das unter <strong>Standard-vCenter-\n            Benutzerkonto</strong> angezeigte Kennwort. Wenn das Kennwort Sonderzeichen enthält, schließen Sie es in einfache Anführungszeichen ein.\n    </li>\n</ol>\n",
    "connect-vsphere-client" : "<!--\ntitle: Wie greife ich auf den vSphere Client zu?\ncontext: [connection-info]\n-->\n<p>\n    Bevor Sie auf den vSphere Client zugreifen können, müssen Sie eine VPN-Verbindung oder eine Firewallregel konfigurieren, um den Zugriff auf\n    vCenter Server zuzulassen. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_013\"\n        target=\"_blank\"\n    >Hinzufügen oder Ändern von Firewallregeln für das Verwaltungs-Gateway</a>.\n</p>\n<p>\n    Klicken Sie auf der Karte „SDDC-Details“ auf <strong>VCENTER ÖFFNEN</strong> und verwenden Sie die Standard-vCenter-Anmeldeinformationen zum Anmelden. Klicken Sie zum\n    Anzeigen dieser Anmeldeinformationen im Dialogfeld <strong>VCENTER ÖFFNEN</strong> auf <strong>ANMELDEDATEN ANZEIGEN</strong>. Sie finden die\n    Anmeldedaten auch unter <strong>Standard-vCenter-Benutzerkonto</strong> auf der Registerkarte <strong>Einstellungen</strong> des SDDC.\n</p>\n",
    "cpu-running-out" : "<!--\ntitle: Die CPU-Kapazität wird knapp. Was kann ich tun?\ncontext: [summary]\n-->\n<p>\n    Wenn die Möglichkeit besteht, Hosts hinzuzufügen, und bei Ihrem SDDC die maximale Anzahl Hosts noch nicht erreicht ist, können Sie einen Host hinzufügen,\n    um die verfügbare CPU-Kapazität zu erhöhen. Andernfalls müssen Sie Arbeitslasten herunterfahren oder aus dem SDDC migrieren.\n</p>",
    "create-distributed-firewall-rule" : "<!--\ntitle: Wie richte ich die Regeln für verteilte Firewalls ein?\ncontext: [networking, distributedfirewall]\nfeature: enableNsxtDeployment\n-->\n<p>\n   Regeln für verteilte Firewalls werden auf der Ebene der VM angewendet und steuern den Ost-West-Datenverkehr innerhalb des SDDC. Der gesamte Datenverkehr,\n   der versucht, die verteilte Firewall zu passieren, unterliegt den Regeln in der in der Regeltabelle angezeigten Reihenfolge, beginnend im oberen Bereich. Ein Paket, das von der ersten Regel zugelassen wurde, wird an die zweite Regel übergeben usw. über nachfolgende Regeln, bis das Paket abgelegt oder abgelehnt wird bzw. die Standardregel trifft, die\n   den gesamten Datenverkehr zulässt. Regeln für verteilte Firewalls werden in Richtlinien gruppiert. Richtlinien sind nach Kategorien geordnet. Kategorien dienen nur zum Gruppieren und haben keine operativen Eigenschaften. Weitere Informationen zu Regelkategorien für verteilte Firewalls finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_017\" target=\"_blank\"\n   >Hinzufügen oder Ändern von Regeln für verteilte Firewalls</a>.\n</p>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>Netzwerk &amp; Sicherheit &gt; Verteilte Firewall</strong>.<br>Klicken Sie auf <strong>KATEGORIESPEZIFISCHE REGELN</strong> und wählen Sie eine Kategorie aus, um die Richtlinien und Regeln in dieser Kategorie anzuzeigen und zu ändern. Sie können aber auch auf <strong>ALLE REGELN</strong> klicken, um Regeln in allen Richtlinien und Kategorien anzuzeigen (aber nicht zu ändern).\n   </li>\n   <li>(Optional) Ändern Sie die Standardkonnektivitätsstrategie.<br>Standardmäßig enthält die verteilte Firewall\n      eine implizite Zulassen-Regel für den gesamten Datenverkehr. Diese Regel, die in keiner Regelliste angezeigt wird,\n      wird nach allen anderen Regeln ausgewertet und lässt zu, dass Datenverkehr, der nicht mit einer vorstehenden Regel übereinstimmt, die Firewall durchläuft. Klicken Sie auf das Symbol „Konnektivitätsstrategie“, um eine Liste der verfügbaren Strategien anzuzeigen. Um\n      die aktuelle Strategie zu ändern, wählen Sie eine andere aus und klicken Sie auf <strong>SPEICHERN</strong>.\n   </li>\n   <li>Um eine Richtlinie oben in der Liste hinzuzufügen, klicken Sie auf <strong>RICHTLINIE HINZUFÜGEN</strong> und geben Sie der neuen Richtlinie\n      einen <strong>Namen</strong>.<br> Um eine Richtlinie vor oder nach einer vorhandenen Richtlinie hinzuzufügen, klicken Sie auf die vertikale\n      Optionsschaltfläche am Anfang der Richtlinienzeile, um das Menü „Richtlinieneinstellungen“ zu starten. Klicken Sie dann auf <strong>Richtlinie hinzufügen vor</strong> oder <strong>Richtlinie hinzufügen nach</strong>. Standardmäßig gilt eine neue Richtlinie für die verteilte\n      Firewall (DFW), aber Sie können eine oder mehrere Bestandsgruppen angeben, auf die sie stattdessen angewendet werden soll.\n      Der Wert <strong>ANGEWENDET AUF</strong> der Richtlinie wird an alle Regeln in der Richtlinie weitergegeben.\n   </li>\n   <li>Wählen Sie zum Hinzufügen einer Regel eine Richtlinie aus, klicken Sie auf <strong>NEUE REGEL HINZUFÜGEN</strong> und geben Sie unter <strong>Name</strong> einen Namen für die Regel ein.\n   </li>\n   <li>Geben Sie die Parameter für die neue Regel ein. <br> Parameter werden auf ihre Standardwerte initialisiert\n      (Beispiel: <strong>Alle</strong> für <strong>Quellen</strong> und <strong>Ziele</strong>). Um\n      einen Parameter zu bearbeiten, bewegen Sie den Mauszeiger über dem Parameterwert und klicken Sie auf das Bleistiftsymbol, um den parameterspezifischen Editor zu öffnen. Weitere Informationen zu Parametern von Regeln für verteilte Firewalls finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_017\" target=\"_blank\"\n   >Hinzufügen oder Ändern von Regeln für verteilte Firewalls</a>.\n   </li>\n   <li>Klicken Sie auf „VERÖFFENTLICHEN“, um die Regel zu erstellen.</li> \n</ol>",
    "create-edge-compute-firewall" : "<!--\ntitle: Wie erstelle ich eine Firewallregel für das NSX Edge-Computing-Gateway?\ncontext: [networking, security]\nfeature: enableNsxtDeployment\n-->\n<p>Standardmäßig blockiert das Computing-Gateway den Datenverkehr zu allen Uplinks. Fügen Sie Firewallregeln für das Computing-Gateway hinzu, um Datenverkehr nach Bedarf zuzulassen.</p>\n<p>\n   Firewallregeln für das Computing-Gateway geben Aktionen an, um den Netzwerkdatenverkehr von einer angegebenen Quelle zu einem\n   angegebenen Ziel anzunehmen. Aktionen können entweder „Zulassen“ (Datenverkehr zulassen) oder „Ablegen“ (alle Pakete, die mit der angegebenen Quelle und dem angegebenen Ziel übereinstimmen, ablegen) sein. Quellen und Ziele können aus einer Liste physischer Netzwerkschnittstellen ausgewählt werden. Sie können auch aus einer generischen Spezifikation von <strong>Alle Uplinks</strong> ausgewählt werden, die sich auf den gesamten Datenverkehr bezieht, der das Gateway verlässt und zur VPC-Schnittstelle, Internetschnittstelle oder Direct Connect-Schnittstelle geleitet wird. Eine Firewallregel, die auf <strong>Alle Uplinks</strong> angewendet wird, gilt nicht für die <strong>VPN-Tunnel-Schnittstelle</strong> (VPN Tunnel\n      Interface, VTI), bei der es sich um eine virtuelle Schnittstelle und nicht um einen physischen Uplink handelt. Die <strong>VPN-Tunnel-Schnittstelle</strong> muss explizit im Parameter <strong>Angewendet auf</strong> einer beliebigen Firewallregel festgelegt werden, die die Kommunikation der Arbeitslast-VM über ein routenbasiertes VPN verwaltet. Das Computing-Gateway enthält eine <strong>standardmäßige VTI-Regel</strong>, die den gesamten Datenverkehr in der VTI ablegt. Um die Kommunikation von Arbeitslast-VMs über die VTI zu aktivieren, ändern Sie diese Regel oder verschieben Sie sie auf eine niedrigere Rangfolge in der Regelhierarchie, nach weniger restriktiven Regeln.\n</p>\n<p>Der gesamte Datenverkehr, der versucht, die Firewall zu passieren, unterliegt den Regeln in der in der Regeltabelle angezeigten Reihenfolge, beginnend im oberen Bereich. Ein Paket, das von der ersten Regel zugelassen wurde, wird an die zweite Regel übergeben usw. über nachfolgende Regeln, bis das Paket abgelegt oder abgelehnt wird bzw. die Standardregel trifft, die den gesamten Datenverkehr zulässt.</p>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>Gateway-Firewall</strong>, um die Seite <strong>GATEWAY-FIREWALL</strong> zu öffnen.\n   </li>\n   <li>Klicken Sie auf der Seite <strong>GATEWAY-FIREWALL</strong> auf <strong>Computing-Gateway</strong>.\n   </li>\n   <li>Klicken Sie zum Hinzufügen einer Regel auf <strong>REGEL HINZUFÜGEN</strong> und geben Sie unter <strong>Name</strong> einen neuen Namen für die Regel ein.\n   </li>\n   <li>Geben Sie die Parameter für die neue Regel ein. <br> Parameter werden auf ihre Standardwerte initialisiert\n      (Beispiel: <strong>Alle</strong> für <strong>Quellen</strong> und <strong>Ziele</strong>). Um\n      einen Parameter zu bearbeiten, bewegen Sie den Mauszeiger über dem Parameterwert und klicken Sie auf das Bleistiftsymbol, um den parameterspezifischen Editor zu öffnen. Weitere Informationen zu Firewallregel-Parametern für das Computing-Gateway finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_020\" target=\"_blank\"\n   >Hinzufügen oder Ändern von Firewallregeln für das Computing-Gateway</a>.\n   </li>\n   <li>Klicken Sie auf <strong>VERÖFFENTLICHEN</strong>, um die Regel zu erstellen.\n   </li>\n</ol>\n<p>\n   Weitere Informationen zum Bearbeiten von Regelprotokollierungseinstellungen und Anzeigen von Regelstatistiken finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_020\" target=\"_blank\"\n   >Hinzufügen oder Ändern von Firewallregeln für das Computing-Gateway</a>.\n</p>",
    "create-edge-management-firewall" : "<!--\ntitle: Wie erstelle ich NSX Edge-Firewallregeln für das Verwaltungs-Gateway?\ncontext: [networking, security]\nfeature: enableNsxtDeployment\n-->\n<p>Standardmäßig blockiert das Verwaltungs-Gateway den Datenverkehr zu allen Zielen aus allen Quellen. Fügen Sie Firewallregeln für das Verwaltungs-Gateway hinzu, um Datenverkehr nach Bedarf zuzulassen.</p>\n<ol class=\"list\">\n   <li>Klicken Sie auf <strong>Gateway-Firewall</strong>, um die Seite <strong> GATEWAY-FIREWALL</strong> zu öffnen.\n   </li>\n   <li>Klicken Sie auf der Seite <strong>GATEWAY-FIREWALL</strong> auf <strong>Verwaltungs-Gateway</strong>.\n   </li>\n   <li>Klicken Sie zum Hinzufügen einer Regel auf <strong>REGEL HINZUFÜGEN</strong> und geben Sie unter <strong>Name</strong> einen neuen Namen für die Regel ein.\n   </li>\n   <li>Geben Sie die Parameter für die neue Regel ein.<br> Parameter werden auf ihre Standardwerte initialisiert\n      (Beispiel: <strong>Alle</strong> für <strong>Quellen</strong> und <strong> Ziele</strong>). Um\n      einen Parameter zu bearbeiten, bewegen Sie den Mauszeiger über dem Parameterwert und klicken Sie auf das Bleistiftsymbol,\n      um einen parameterspezifischen Editor zu öffnen. Weitere Informationen zu Firewallregel-Parametern für das Computing-Gateway finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_013\" target=\"_blank\"\n   >Hinzufügen oder Ändern von Firewallregeln für das Verwaltungs-Gateway</a>.\n   </li>\n   <li>Klicken Sie auf <strong>VERÖFFENTLICHEN</strong>, um die Regel zu erstellen. <br> Firewallregeln werden in der Reihenfolge von oben nach unten angewendet. Da im unteren Bereich eine Standard-Ablegeregel vorhanden ist und es sich bei den obigen Regeln immer um\n      Zulassungsregeln handelt, hat die Reihenfolge der Firewallregeln für das Verwaltungs-Gateway keinen Einfluss auf den Datenverkehrsfluss.\n   </li>\n</ol>\n<p>\n   Weitere Informationen zum Bearbeiten der Regel-Protokollierungseinstellungen und Anzeigen von Regelstatistiken sowie ein Beispiel finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_013\" target=\"_blank\"\n   >Hinzufügen oder Ändern der Firewallregeln für das Verwaltungs-Gateway</a>.\n</p>",
    "create-l2vpn" : "<!--\ntitle: Wie erstelle ich ein Layer 2-VPN?\ncontext: [networking, vpn, layer2]\nfeature: enableNsxtDeployment\n-->\n<p>Ein erweitertes VMware Cloud on AWS-Netzwerk verwendet ein Layer 2 Virtual Private Network (L2VPN) zum Erweitern eines\n   lokalen Netzwerks auf mehrere VLAN-basierte Netzwerke, die mit unterschiedlichen Tunnel-IDs im selben\n   L2VPN-Tunnel erweitert werden können. Bei diesem erweiterten Netzwerk handelt es sich um ein einziges Subnetz mit einer einzelnen Broadcast-Domäne.\n   Daher können Sie VMs zu und aus Ihrem Cloud-SDDC migrieren, ohne ihre IP-Adressen ändern zu müssen.</p>\n<ol class=\"list\">\n   <li>\n      Klicken Sie auf <strong>VPN &gt; Layer 2</strong>.\n   </li>\n   <li>\n      Klicken Sie auf <strong>VPN-TUNNEL HINZUFÜGEN</strong>.\n   </li>\n   <li>\n      Konfigurieren Sie die Parameter für den VPN-Tunnel.\n      <br>\n      Weitere Informationen zu Tunnelparametern finden Sie unter <a\n         href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_027\" target=\"_blank\"\n      >Konfigurieren eines Layer 2-VPN-Tunnels im SDDC</a>.\n   </li>\n   <li>(Optional) Markieren Sie den Tunnel.</li>\n   <li>\n      Klicken Sie auf <strong>SPEICHERN </strong>, um den Tunnel zu erstellen.\n      <br>\n      Die Tunnelerstellung kann einige Minuten in Anspruch nehmen. Wenn der Tunnel verfügbar wird, ändert sich der Status zu „Aktiv“.\n   </li>\n</ol>\n<p>\n   Nachdem der Tunnel aktiv ist, müssen Sie ein Netzwerksegment erstellen, das an die Tunnel-ID des neuen Tunnels gebunden ist.\n   Weitere Informationen zum Erstellen des Segments und zum Einrichten der lokalen Seite des VPN finden Sie unter <a\n      href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_006\" target=\"_blank\"\n   >Konfigurieren des erweiterten Segments des Layer 2-VPN</a>.\n</p>",
    "create-logical-segment" : "<!--\ntitle: Wie erstelle ich ein logisches Netzwerksegment?\ncontext: [networking, network, segment]\nfeature: enableNsxtDeployment\n-->\n<p>VMware Cloud on AWS unterstützt drei Arten von logischen Netzwerksegmenten:</p>\n<li>Ein geroutetes Netzwerksegment (der Standardtyp) weist eine Konnektivität zu anderen logischen Netzwerken im SDDC auf\n   und, über die SDDC-Firewall, zu externen Netzwerken. Ein Einzelhost-Starter-SDDC wird mit einem einzelnen gerouteten Netzwerksegment\n   mit dem Namen „sddc-cgw-network-1“ erstellt.</li>\n<li>Ein erweitertes Netzwerksegment erweitert einen vorhandenen L2VPN-Tunnel und bietet einen einzelnen IP-Adressbereich, der sich über das SDDC und ein lokales Netzwerk erstreckt.</li>\n<li>Ein getrenntes Netzwerksegment hat keinen Uplink und bietet ein isoliertes Netzwerk, auf das nur VMs zugreifen können, die mit ihm verbunden sind.</li>\n<ol class=\"list\">\n   <li>\n      Um ein Segment zu erstellen, klicken Sie auf <strong>Segmente &gt; SEGMENT HINZUFÜGEN</strong> und geben Sie dem neuen Segment einen <strong>Namen</strong>.\n      <br>\n      Um die Konfiguration eines vorhandenen Segments zu ändern, klicken Sie auf die Optionsschaltfläche und wählen Sie <strong>Bearbeiten</strong> aus.\n   </li>\n   <li>\n      Geben Sie einen <strong>Typ</strong> des Segments an und geben Sie die erforderlichen Konfigurationsparameter ein.\n      <br>\n      Die Parameteranforderungen richten sich nach dem Segmenttyp. Weitere Informationen zu Segmentkonfigurationsparametern finden Sie unter <a\n         href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_001\" target=\"_blank\"\n      >Erstellen oder Ändern eines Netzwerksegments</a>.\n   <li>\n      Klicken Sie auf <strong>SPEICHERN</strong>, um das Segment zu erstellen oder zu aktualisieren.<br>\n      \n      Dieser Vorgang kann bis zu 15 Sekunden in Anspruch nehmen. Wenn sich der <strong>Status</strong> des Segments zu <strong>Aktiv</strong> ändert, ist das Segment zur Verwendung bereit. Wenn der <strong>Status</strong>  des Segments <strong>Inaktiv</strong> ist, können Sie auf das Informationssymbol klicken, um Statusdetails anzuzeigen.\n   </li> \n</ol>",
    "create-policy-based-vpn" : "<!--\ntitle: Wie erstelle ich ein richtlinienbasiertes VPN?\ncontext: [networking, vpn, policy-based]\nfeature: enableNsxtDeployment\n-->\n<p>Ein richtlinienbasiertes VPN erstellt einen IPsec-Tunnel und eine Richtlinie, die angibt, wie der Datenverkehr ihn verwendet. Wenn Sie\n   ein richtlinienbasiertes VPN verwenden, müssen Sie die Routingtabellen auf beiden Enden des Netzwerks aktualisieren, wenn neue Routen hinzugefügt werden.</p>\n<p>Richtlinienbasierte VPNs in Ihrem VMware Cloud on AWS-SDDC verwenden ein IPsec-Protokoll, um den Datenverkehr zu sichern. Um ein\n   richtlinienbasiertes VPN zu erstellen, konfigurieren Sie den lokalen (SDDC) Endpoint und konfigurieren dann einen übereinstimmenden Remote-Endpoint (intern).\n   Da jedes richtlinienbasierte VPN eine neue IPsec-Sicherheitsverbindung für jedes Netzwerk erstellen muss, muss ein Administrator die Routinginformationen lokal und im SDDC aktualisieren, wenn ein neues richtlinienbasiertes VPN erstellt wird. Ein richtlinienbasiertes VPN kann eine geeignete Wahl sein, wenn Sie nur wenige Netzwerke an beiden Enden des VPN haben oder wenn Ihre lokale Netzwerkhardware BGP nicht unterstützt (was für routenbasierte VPNs erforderlich ist).</p>\n<ol class=\"list\">\n   <li>\n      Klicken Sie auf <strong> VPN &gt; Richtlinienbasiert</strong>.\n   </li>\n   <li>Klicken Sie auf „VPN HINZUFÜGEN“ und geben Sie dem neuen VPN einen Namen.</li>\n   <li>\n      Wählen Sie aus dem Dropdown-Menü eine <strong>lokale IP-Adresse</strong> aus.\n      <br>\n      Wenn Sie AWS Direct Connect für dieses SDDC konfiguriert haben und das VPN es verwenden soll, wählen Sie die private\n      IP-Adresse aus. Beachten Sie, dass der VPN-Datenverkehr über Direct Connect auf die standardmäßige MTU von 1500 Byte beschränkt ist, selbst\n      wenn der Link eine höhere MTU unterstützt. Wählen Sie die öffentliche IP-Adresse aus, wenn das VPN eine Verbindung über das Internet herstellen soll.\n   </li>\n   <li>\n      Geben Sie für <strong>Öffentliche Remote-IP</strong> die Adresse Ihres lokalen VPN-Endpoints ein.   \n<br> Weitere Informationen zu wichtigen Einschränkungen für die Werte der Remote-IP und der lokalen IP finden Sie unter <a\n         href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_029\" target=\"_blank\"\n      >Erstellen eines richtlinienbasierten VPN</a>.\n   </li>\n   <li>\n      (Optional) Wenn sich Ihr lokales Gateway hinter einem NAT-Gerät befindet, geben Sie die Gateway-Adresse als <strong>Private Remote-IP</strong> ein.\n      <br>\n      Diese IP-Adresse muss der lokalen Identität (IKE-ID) entsprechen, die das lokale-VPN Gateway gesendet hat. Falls dieses Feld leer ist, wird das Feld <strong>Öffentliche Remote-IP</strong> verwendet, um der lokalen Identität des lokalen VPN-Gateways zu entsprechen.\n   </li>\n   <li>\n      Geben Sie die <strong>Remote-Netzwerke</strong> an, mit denen dieses VPN eine Verbindung herstellen kann.\n      <br>\n      Diese Liste muss alle Netzwerke enthalten, die vom lokalen VPN-Gateway als lokal definiert sind. Geben Sie jedes Netzwerk im CIDR-Format ein. Trennen Sie mehrere CIDR-Blöcke durch Kommas.\n   </li>\n   <li>\n      Geben Sie die <strong>lokalen Netzwerke</strong> an, mit denen dieses VPN eine Verbindung herstellen kann.\n      <br>\n      Diese Liste umfasst alle gerouteten Computing-Netzwerke im SDDC sowie das gesamte Verwaltungsnetzwerk und\n      das Subnetz der Appliance (eine Teilmenge des Verwaltungsnetzwerks, das vCenter und andere Verwaltungs-Appliances umfasst, aber nicht die ESXi-Hosts). Sie enthält auch das CGW-DNS-Netzwerk, eine einzelne IP-Adresse, mit der vom CGW-DNS-Service weitergeleitete Anforderungen bezogen werden.\n   </li>\n   <li>\n      Konfigurieren Sie <strong>Erweiterte Tunnelparameter</strong>.\n      <br>\n      Weitere Informationen zu vorgeschlagenen Parameterwerten finden Sie unter <a\n         href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_029\" target=\"_blank\"\n      >Erstellen eines richtlinienbasierten VPN</a>.\n   </li>\n   <li>(Optional) Markieren Sie das VPN.</li>\n   <li>\n      Klicken Sie auf <strong>SPEICHERN</strong>.\n   </li>\n</ol>\n<p>Der Prozess zur VPN-Erstellung kann einige Minuten in Anspruch nehmen. Wenn das richtlinienbasierte VPN verfügbar wird, werden der \n   Tunnelstatus und BGP-Sitzungsstatus angezeigt. Die folgenden Aktionen sind verfügbar, um Sie bei der\n   Fehlerbehebung und Konfiguration des lokalen Endes des VPN zu unterstützen:</p>\n<ul>\n   <li>\n      Klicken Sie auf <strong>KONFIGURATION HERUNTERLADEN</strong>, um eine Datei mit den Details zur VPN-Verbindung herunterzuladen. Sie\n      können diese Details verwenden, um das lokale Ende dieses VPN zu konfigurieren.\n   </li>\n   <li>\n      Klicken Sie auf <strong>STATISTIK ANZEIGEN</strong>, um die Statistiken zum Paketdatenverkehr für dieses VPN anzuzeigen. Weitere Informationen hierzu finden Sie unter <a\n         href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_026\" target=\"_blank\"\n      >VPN-Tunnelstatus und Statistiken anzeigen</a>.\n   </li>\n</ul>",
    "create-public-vif" : "<!--\ntitle: Wie erstelle ich eine öffentliche virtuelle Schnittstelle?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    Eine öffentliche virtuelle Schnittstelle (VIF) ermöglicht den Zugriff Ihres SDDC auf AWS-Dienste, die sich außerhalb Ihrer VPC befinden, wie etwa S3,\n    über AWS Direct Connect. Eine öffentliche VIF verwendet einen öffentlichen IP-Adressbereich und stellt eine private dedizierte Verbindung zum\n    AWS-Netzwerk-Backbone bereit, die in einer bestimmten AWS-Region endet. Informationen zum Erstellen einer öffentlichen virtuellen Schnittstelle in einem SDDC finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_016\"\n        target=\"_blank\"\n    >Erstellen einer öffentlichen virtuellen Schnittstelle für den Zugriff auf AWS-Dienste</a>.\n</p>\n",
    "create-route-based-vpn" : "<!--\ntitle: Wie erstelle ich ein routenbasiertes VPN?\ncontext: [networking, vpn, route-based]\nfeature: enableNsxtDeployment\n-->\n<p>Ein routenbasiertes VPN erstellt eine IPsec-Tunnelschnittstelle und leitet den Datenverkehr über sie, wie von der SDDC-Routing-Tabelle vorgeschrieben. VMware Cloud on AWS verwendet dieselbe öffentliche IP für alle VPN-Verbindungen, sodass nur eine einzige\n   VPN-Verbindung (routenbasiert, richtlinienbasiert oder L2VPN) für eine bestimmte öffentliche Remote-IP erstellt werden kann. Routenbasierte VPNs in Ihrem VMware Cloud on AWS-SDDC verwenden ein IPsec-Protokoll, um den Datenverkehr und das Border Gateway Protocol (BGP) zu sichern sowie Routen zu erkennen und weiterzugeben, wenn neue Netzwerke erstellt werden. Um ein routenbasiertes VPN zu erstellen, konfigurieren Sie die BGP-Informationen für den lokalen Endpoint (SDDC) und den Remote-Endpoint (intern)  und geben Sie dann die Tunnelsicherheitsparameter für das SDDC-Ende des Tunnels an.</p>\n<ol class=\"list\">\n   <li>\n      Klicken Sie auf <strong>VPN &gt; Routenbasiert</strong>.\n   </li>\n   <li>\n      (Optional) Ändern Sie die Standardeinstellung für die lokale autonome Systemnummer (ASN).\n      <br>\n      Alle routenbasierten VPNs im SDDC sind standardmäßig auf ASN 65000 festgelegt. Wenn die Remote-ASN für eine konfigurierte VPN-Verbindung ebenfalls diesen Wert hat, klicken Sie auf <strong>LOKALE ASN BEARBEITEN</strong>, geben einen neuen Wert im Bereich 64521 bis 65535 ein und klicken auf <strong>ANWENDEN</strong>.\n   </li>\n   <li>\n      Wählen Sie aus dem Dropdown-Menü eine <strong>lokale IP-Adresse</strong> aus.\n      <br>\n      Wenn Sie AWS Direct Connect für dieses SDDC konfiguriert haben und das VPN es verwenden soll, wählen Sie die private\n      IP-Adresse aus. Beachten Sie, dass der VPN-Datenverkehr über Direct Connect auf die standardmäßige MTU von 1500 Byte beschränkt ist, selbst\n      wenn der Link eine höhere MTU unterstützt. Wählen Sie die öffentliche IP-Adresse aus, wenn das VPN eine Verbindung über das Internet herstellen soll.\n   </li>\n   <li>\n      Geben Sie für <strong>Öffentliche Remote-IP</strong> die Adresse Ihres lokalen VPN-Endpoints ein.\n      <br>\n      Weitere Informationen zu wichtigen Einschränkungen für die Werte der Remote-IP und der lokalen IP finden Sie unter <a\n         href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_030\" target=\"_blank\"\n      >Erstellen eines routenbasierten VPN</a>.\n   </li>\n   <li>\n      Geben Sie für <strong>Lokale BGP-IP/Präfixlänge</strong> die IP-Adresse im CIDR-Format des lokalen VPN-Tunnels ein.\n   </li>\n   <li>\n      Geben Sie als <strong>Remote-BGP-IP</strong> die BGP-Schnittstellenadresse Ihres lokalen VPN-Gateways ein.\n   </li>\n   <li>\n      Geben Sie als <strong>Remote-BGP-ASN</strong> die ASN Ihres lokalen VPN-Gateways ein.\n   </li>\n   <li>\n      Konfigurieren Sie <strong>Erweiterte Tunnelparameter</strong>.\n      <br>\n      Weitere Informationen zu vorgeschlagenen Parameterwerten finden Sie unter <a\n         href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_030\" target=\"_blank\"\n      >Erstellen eines routenbasierten VPN</a>.\n   </li>\n   <li>\n      (Optional) Geben Sie unter <strong>Erweiterte BGP-Parameter</strong> einen <strong>Geheimen Schlüssel</strong> für BGP ein, der mit dem vom lokalen Gateway verwendeten Schlüssel übereinstimmt.\n   </li>\n   <li>(Optional) Markieren Sie das VPN.</li>\n   <li>\n      Klicken Sie auf <strong>SPEICHERN</strong>.\n   </li>\n</ol>\n<p>Der Prozess zur VPN-Erstellung kann einige Minuten in Anspruch nehmen. Wenn das routenbasierte VPN verfügbar wird, werden der\n   Tunnelstatus und BGP-Sitzungsstatus angezeigt. Die folgenden Aktionen sind verfügbar, um Sie bei der\n   Fehlerbehebung und Konfiguration des lokalen Endes des VPN zu unterstützen:</p>\n<ul>\n   <li>\n      Klicken Sie auf <strong>KONFIGURATION HERUNTERLADEN</strong>, um eine Datei mit den Details zur VPN-Verbindung herunterzuladen. Sie\n      können diese Details verwenden, um das lokale Ende dieses VPN zu konfigurieren.\n   </li>\n   <li>\n      Klicken Sie auf <strong>STATISTIK ANZEIGEN</strong>, um die Statistiken zum Paketdatenverkehr für dieses VPN anzuzeigen. Weitere Informationen hierzu finden Sie unter <a\n         href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_026\" target=\"_blank\"\n      >VPN-Tunnelstatus und Statistiken anzeigen</a>.\n   </li>\n   <li>\n      Klicken Sie auf <strong>ROUTEN ANZEIGEN</strong>, um eine Darstellung der von diesem VPN angekündigten und erlernten Routen zu öffnen.\n   </li>\n   <li>\n      Klicken Sie auf <strong>ROUTEN HERUNTERLADEN</strong>, um eine Liste der <strong>Angekündigten Routen</strong> oder <strong>Erlernten Routen</strong> im CSV-Format anzuzeigen.\n   </li>\n</ul>",
    "create-sddc" : "<!--\ntitle: Wie erstelle ich ein neues SDDC?\ncontext: [dashboard,create-sddc]\n-->\n<p>Wählen Sie zum Erstellen eines SDDC einen AWS-Bereich aus, in dem das SDDC gehostet werden soll, benennen Sie das SDDC und geben Sie an, wie viele ESXi-Hosts\n    es enthalten soll. Wenn Sie noch kein AWS-Konto haben, können Sie ein Startkonfigurations-\n    SDDC erstellen, das einen einzigen ESXi-Host enthält. Es liegt eine 1:1-Beziehung zwischen SDDCs und AWS-Kundenkonten vor.\n    Sie können ein SDDC mit einem einzelnen AWS-Kundenkonto und einer Amazon-VPC verbinden.</p>\n<p>\n    Klicken Sie im Dashboard auf <b>SDDC erstellen</b>, um den Assistenten <strong>Software-Defined Data Center (SDDC)\n        erstellen</strong> zu starten. Weitere Informationen zu diesem Vorgang finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_008\"\n        target=\"_blank\"\n    >Bereitstellen eines SDDC von der VMC-Konsole</a>. Der Status der SDDC-Bereitstellung wird\n    im Dashboard angezeigt.\n</p>\n",
    "delete-sddc" : "<!--\ntitle: Wie lösche ich ein SDDC?\ncontext: [dashboard]\n-->\n<p>\n    Suchen Sie im Dashboard die Karte für das SDDC und klicken Sie auf <strong>AKTIONEN</strong> &gt; <strong>SDDC löschen</strong>.\n    Bestätigen Sie, dass Sie verstehen, welche Auswirkungen diese nicht rückgängig machbare Aktion hat, und klicken Sie anschließend auf <strong>SDDC\n        LÖSCHEN</strong>.\n</p>\n",
    "e1cba85551988a87c1139e690d5997ad" : "<!--\ntitle: Wie konfiguriere ich NAT?\ncontext: [networking,nat]\n-->\n<p>Die ausgehende Netzwerkadressübersetzung (Network Address Translation, NAT) ist standardmäßig für das Computing-Gateway konfiguriert. Sie können die eingehende Netzwerkadressübersetzung konfigurieren. </p>\n<ol class=\"list\">\n    <li>Klicken Sie auf der Registerkarte „Netzwerk“ Ihres SDDC auf <b>NAT</b>.</li>\n    <li>Geben Sie die NAT-Parameter ein:\n        <ul class=\"list\">\n            <li><b>Beschreibung:</b> Geben Sie eine Beschreibung für die NAT-Regel ein.</li>\n            <li><b>Öffentliche IP:</b> Wählen Sie die öffentliche IP-Adresse aus. Weitere Informationen zur Bereitstellung einer öffentlichen IP-Adresse finden Sie in der Hilfe.</li>\n            <li><b>Dienst:</b> Wählen Sie eine der folgenden Optionen aus:\n                <ul class=\"list\">\n                    <li><b>Beliebig:</b> Die Regel gilt für den gesamten Datenverkehr.</li>\n                    <li>Ein bestimmter Dienst: Die Regel gilt für den Datenverkehr von dem ausgewählten Dienst und Port.</li>\n                    <li><b>ICMP (Gesamt)</b>: Die Regel gilt für ICMP-Datenverkehr, beispielsweise Ping-Pakete.</li>\n                    <li><b>Benutzerdefiniertes TCP</b> oder <b>Benutzerdefiniertes UDP</b>: Hiermit werden ein benutzerdefinierter Dienst und ein Port definiert, auf die die Regel angewendet wird.</li>\n                </ul>\n            </li>\n            \n            <li><b>Öffentliche Ports:</b> Wenn Sie einen benutzerdefinierten TCP- oder UDP-Dienst ausgewählt haben, geben Sie den Port oder den Portbereich ein, von dem die Weiterleitung erfolgen soll.</li>\n            <li><b>Interne IP:</b> Geben Sie die interne IP-Adresse oder den Block der IP-Adressen ein, an die die öffentliche IP-Adresse geleitet werden soll. </li>\n             <li><b>Interne Ports:</b> Wenn Sie einen benutzerdefinierten TCP- oder UDP-Dienst ausgewählt haben, geben Sie den Port oder Portbereich an, zu dem die Weiterleitung erfolgen soll.</li>\n        </ul>\n    </li>\n</ol>\n",
    "e87aff2a3ca94aca6476294af0962f5a" : "<!--\ntitle: Welche Aktionen kann ich auf der Seite „Verbindungsinformationen“ ausführen?\ncontext: [connection-info]\n-->\n<p>Auf der Seite „Verbindungsinformationen“ finden Sie Links für den Zugriff auf den vSphere Client und vCenter Server für Ihr SDDC. Außerdem wird hier das anfänglich für das Konto „cloudadmin@vmc.local“ generierte Kennwort angezeigt, mit dem Sie sich beim vCenter Server authentifizieren können. </p>\n<p>Wenn Sie das Kennwort für das Konto „cloudadmin@vmc.local“ ändern, wird es auf dieser Seite nicht aktualisiert. </p>",
    "ef1277c930de7bd02f7937fb7b49d446" : "<!--\ntitle: Der Arbeitsspeicher wird knapp. Was kann ich tun?\ncontext: [summary]\n-->\n<p>Wenn die Möglichkeit besteht, Hosts hinzuzufügen, und bei Ihrem SDDC die maximale Anzahl Hosts noch nicht erreicht ist, können Sie einen Host hinzufügen, um die verfügbare Arbeitsspeicherkapazität zu erhöhen. Andernfalls müssen Sie Arbeitslasten herunterfahren oder aus dem SDDC migrieren.</p>",
    "ef936d7192ea7455d6def600da0c3062" : "<!--\ntitle: Welche Rollen kann ich einem neuen Benutzer zuweisen?\ncontext: [dashboard, invite]\n-->\n\n<p>Wenn Sie neue Benutzer einladen, können Sie ihnen die folgenden Rollen zuweisen:</p>\n<ul class=\"list\">\n    <li>Besitzer der Organisation: Nur Organisationsbesitzer können andere Benutzer zu dem Konto einladen.</li>\n    <li>Mitglied der Organisation: Organisationsmitglieder können zu der Organisation gehörende Cloud-Datencenter erstellen und verwalten sowie darauf zugreifen. Sie können jedoch keine neuen Benutzer einladen.</li>\n</ul>\n",
    "f162582a2057d3497784dd2a7579ba69" : "<!--\ntitle: Wie viele Hosts sind in meinem SDDC zulässig?\ncontext: [create-sddc]\n-->\n<p>Zurzeit können Sie ein SDDC mit mindestens 4 und höchstens 16 Hosts bereitstellen.</p>\n",
    "f1744e41db8ba4a4ec281f5c63a3df29" : "<!--\ntitle: Wie richte ich Firewallregeln für das Computing-Gateway ein?\ncontext: [networking,firewall]\n-->\n<p>Die standardmäßigen Firewallregeln für das Verwaltungs-Gateway und das Computing-Gateway blockieren den gesamten eingehenden und ausgehenden Datenverkehr. Bevor Sie diese Gateways verwenden können, müssen Sie Firewallregeln hinzufügen, die je nach Bedarf Datenverkehr erlauben.</p>\n<ol class=\"list\">\n    <li>Navigieren Sie zur Registerkarte <b>Netzwerk</b> für das SDDC.</li>\n    <li>Zur Erstellung eines vordefinierten Satzes von Firewallregeln für das Verwaltungs-Gateway erweitern Sie <b>Firewall Rule Accelerator</b> unter <b>Verwaltungs-Gateway</b> und klicken Sie auf \n\n    <b>FIREWALLREGELN ERSTELLEN</b>, um Regeln in der ausgewählten <b>Regelgruppe</b> und im ausgewählten <b>VPN</b> zu erstellen.\n    </li>\n    <li>Um Firewallregeln manuell zu erstellen oder von Firewall Rule Accelerator erstellte Regeln zu bearbeiten, erweitern Sie <b>Firewallregeln</b> unter <b>Verwaltungs-Gateway</b> oder <b>Computing-Gateway</b>.</li>\n    <li>Klicken Sie auf <b>Regel hinzufügen</b>.</li>\n    <li>Geben Sie die Regelparameter ein:\n        <ul class=\"list\">\n            <li><b>Regelname:</b> Geben Sie einen Namen für die Regel ein.</li>\n            <li><b>Aktion:</b> Wählen Sie <b>Zulassen</b> oder <b>Verweigern</b> aus.</li>\n            <li><b>Quelle:</b> Geben Sie Folgendes ein oder wählen Sie eine der folgenden Optionen aus:\n                <ul class=\"list\">\n                <li>Wählen Sie <b>Gesamtes Internet und VPN</b> aus, um die Regel auf den gesamten Datenverkehr aus dem Internet und VPN anzuwenden.</li>\n                <li>Wählen Sie <b>Gesamte verbundene Amazon-VPC</b> aus, um die Regel auf den gesamten Datenverkehr von der verbundenen Amazon-VPC anzuwenden.</li>    \n                <li>Geben Sie <b>Beliebig</b> ein, um die Regel auf Datenverkehr von allen Quellen anzuwenden.</li>\n                <li>Geben Sie eine(n) oder mehrere IP-Adressen oder IP-Adressbereiche getrennt durch Kommas ein, um die Regel auf Datenverkehr von diesen bestimmten IP-Adressen anzuwenden. </li>    \n                </ul>\n            </li>\n            <li><b>Ziel:</b> </b> Geben Sie Folgendes ein oder wählen Sie eine der folgenden Optionen aus:\n                <ul class=\"list\">\n                <li>Wählen Sie <b>Gesamtes Internet und VPN</b> aus, um die Regel auf den gesamten Datenverkehr zum Internet und VPN anzuwenden.</li>\n                <li>Wählen Sie <b>Gesamte verbundene Amazon-VPC</b> aus, um die Regel auf den gesamten Datenverkehr zu der verbundenen Amazon-VPC anzuwenden.</li>    \n                <li>Geben Sie <b>Beliebig</b> ein, um die Regel auf den Datenverkehr zu allen Quellen anzuwenden.</li>\n                <li>Geben Sie eine(n) oder mehrere IP-Adressen oder IP-Adressbereiche getrennt durch Kommas ein, um die Regel auf Datenverkehr zu diesen bestimmten IP-Adressen anzuwenden. </li>    \n                </ul></li>\n            <li><b>Dienst:</b> Wählen Sie eine der folgenden Optionen aus:\n                <ul class=\"list\">\n                    <li><b>Beliebig (Gesamter Datenverkehr):</b> Die Regel gilt für den gesamten Datenverkehr.</li>\n                    <li>Ein bestimmter Dienst: Die Regel gilt für den Datenverkehr von dem ausgewählten Dienst und Port.</li>\n                    <li><b>ICMP (Gesamtes ICMP)</b>: Die Regel gilt für den gesamten ICMP-Datenverkehr</li>\n                    <li><b>Benutzerdefiniertes TCP</b> oder <b>Benutzerdefiniertes UDP</b>: Hiermit werden ein benutzerdefinierter Dienst und ein Port definiert, auf die die Regel angewendet wird.</li>\n                </ul>\n            </li>\n            <li><b>Ports:</b> Wenn Sie einen benutzerdefinierten TCP- oder UDP-Dienst ausgewählt haben, geben Sie hier die Portnummer ein.</li>\n        </ul>\n    </li>\n</ol>\n<p>Firewallregeln werden in der Reihenfolge von oben nach unten angewendet. Verschieben Sie die Firewallregeln mit den nach oben bzw. unten weisenden Pfeilen.</p>\n",
    "f44b2dc3154413e99b0427e8f9cd4d72" : "<!--\ntitle: Die CPU-Kapazität wird knapp. Was kann ich tun?\ncontext: [summary]\n-->\n<p>Wenn die Möglichkeit besteht, Hosts hinzuzufügen, und bei Ihrem SDDC die maximale Anzahl Hosts noch nicht erreicht ist, können Sie einen Host hinzufügen, um die verfügbare CPU-Kapazität zu erhöhen. Andernfalls müssen Sie Arbeitslasten herunterfahren oder aus dem SDDC migrieren.</p>",
    "fe666a0d29b8c867ff39f4b94392a748" : "<!--\ntitle: Was sind Verwaltungs- und Computing-Gateways?\ncontext: [networking]\n-->\n<p>Wenn Sie ein SDDC mithilfe von VMware Cloud on AWS bereitstellen, wird es mit zwei Netzwerken konfiguriert: einem Verwaltungsnetzwerk und einem Computing-Netzwerk. </p>\n<p>Über das Verwaltungsnetzwerk werden der Netzwerkdatenverkehr für die SDDC-Hosts, für vCenter Server und NSX Manager sowie weitere Verwaltungsfunktionen abgewickelt.</p>\n<p>Über das Computing-Netzwerk wird der Netzwerkdatenverkehr für Ihre Arbeitslast-VMs verarbeitet.</p>\n",
    "firewall-rules" : "<!--\ntitle: Welche Firewallregeln benötige ich für Site Recovery?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n<p>Sie müssen die folgenden Firewallregeln für das Verwaltungs-Gateway erstellen, um Verwaltungs- und vom VMware Site Recovery-Dienst\n    angeforderten Replizierungsdatenverkehr zuzulassen.</p>\n<p>So aktivieren Sie den Verwaltungs- und API-Zugriff:</p>\n<ol class=\"list\">\n    <li>Eingehenden Dienst zulassen – HTTPS (TCP 443) zu vCenter</li>\n    <li>Eingehenden Dienst zulassen – SRM Server Management (TCP 9086) zu Site Recovery Manager</li>\n    <li>Eingehenden Dienst zulassen – VR Server Management (TCP 8043) zu vSphere Replication</li>\n    <li>Ausgehenden Dienst zulassen – „Beliebig (Gesamter Datenverkehr)“ von vCenter, Site Recovery Manager und vSphere Replication</li>\n</ol>\n<p>So aktivieren Sie den Replizierungsdatenverkehr:</p>\n<ol class=\"list\">\n    <li>Eingehenden Dienst zulassen – VM-Replizierung (TCP 31031, 44046) zu vSphere Replication</li>\n    <li>Ausgehenden Dienst zulassen – „Beliebig (Gesamter Datenverkehr)“ von „Nur ESXi-Verwaltung“</li>\n</ol>\n<p>So aktivieren Sie den Zugriff auf die Site Recovery-Konsole:</p>\n<ol class=\"list\">\n    <li>Eingehenden Datenverkehr zulassen – HTTPS (TCP 443) zu vSphere Replication</li>\n</ol>\n",
    "hcx" : "<!--\ntitle: Was ist das HCX-Add-On?\ncontext: [hcx,addons]\n-->\n<p>\n    VMware HCX abstrahiert lokale und Cloud-Ressourcen und stellt sie den Arbeitslasten als Hybrid-Cloud zur Verfügung. Dadurch wird die Mobilität von Arbeitslasten zwischen dem lokalen Datencenter und dem Cloud-SDDC ermöglicht. HCX ist ein Bestandteil Ihres VMC on AWS-Diensts. Weitere Informationen zum Installieren und Konfigurieren von HCX finden Sie in der <a\n        href=\"https://docs.vmware.com/de/VMware-HCX/index.html\" target=\"_blank\"\n    >Dokumentation zu VMware HCX</a> und in der <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_011\"\n        target=\"_blank\"\n    >Checkliste für Hybrid-Migration mit HCX</a>.\n</p>\n",
    "how-dns" : "<!--\ntitle: Wie konfiguriere ich DNS?\ncontext: [networking,dns]\n-->\n<p>\n    Sie müssen einen DNS-Server auf den Verwaltungs- und Computing-Gateways angeben, damit Hosts und VMs\n    vollqualifizierte Domänennamen (FQDNs) in IP-Adressen in den Verwaltungs- und Computing-Netzwerken auflösen können. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-12DA448A-9CFC-49CD-B765-3CB8A0B91BAB.html\"\n        target=\"_blank\"\n    >Festlegen des Verwaltungs-Gateway-DNS</a> und <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-09E0A733-E621-4A53-9061-A409860F5011.html\"\n        target=\"_blank\"\n    >Einrichten des Computing-Gateway-DNS</a>.\n</p>\n<p>\n    DNS muss für Verwaltungs- und Computing-Gateways separat konfiguriert werden.\n</p>\n",
    "how-invite-user" : "<!--\ntitle: Wie lade ich einen anderen Benutzer ein?\ncontext: [dashboard]\n-->\n<p>\n    Der Organisationsbesitzer kann Benutzer zum Beitritt zur Organisation einladen. Befolgen Sie hierzu die Schritte unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_009\"\n        target=\"_blank\"\n    >Einladen eines neuen Benutzers</a>.",
    "how-remove-user" : "<!--\ntitle: Wie entferne ich einen anderen Benutzer?\ncontext: [dashboard]\n-->\n<p>Um einen Benutzer aus einer Organisation zu entfernen, müssen Sie der Organisationsbesitzer sein.</p>\n<ol class=\"list\">\n    <li>\n        Klicken Sie im Dashboard der VMC Console oben rechts im Fenster auf das Symbol für Dienste und wählen Sie <strong>Identitäts-\n            und Zugriffsverwaltung</strong> aus.\n    </li>\n    <li>Wählen Sie den oder die Benutzer aus, den bzw. die Sie entfernen möchten.</li>\n    <li>\n        Klicken Sie auf <strong>Benutzer entfernen</strong>.\n    </li>\n    <li>\n        Klicken Sie auf <strong>Entfernen</strong>, um das Entfernen zu bestätigen.\n    </li>\n</ol>\n<p>Der Benutzer wird aus der Organisation entfernt und kann nicht mehr auf die Ressourcen der Organisation zugreifen.</p>",
    "how-set-default-org" : "<!--\ntitle: Wie lege ich meine Standardorganisation fest?\ncontext: [dashboard]\n-->\n<p>Wenn Sie Mitglied mehrerer Organisationen sind, können Sie eine Standardorganisation festlegen.\n    Diese Organisation wird dann angezeigt, wenn Sie sich anmelden.</p>\n<ol class=\"list\">\n    <li>Klicken Sie im VMC Console-Dashboard in der Symbolleiste auf Ihren Benutzernamen und die Organisation.</li>\n    <li>\n        Klicken Sie auf <strong>Standardorganisation festlegen</strong> und wählen Sie die Organisation aus, die als Standardorganisation festgelegt werden soll.\n    </li>\n</ol>",
    "how-switch-language" : "<!--\ntitle: Wie ändere ich die von der VMC Console verwendete Sprache?\ncontext: [dashboard]\nfeature: uiEnableLocalization\n-->\n<p>Um die von VMware Cloud on AWS oder jedem anderen VMware Cloud Service angezeigte Sprache zu ändern, legen Sie\n    die Spracheinstellung für Ihr Konto fest.</p>\n<ol class=\"list\">\n    <li>\n        Klicken Sie in der VMware Cloud Services-Konsole in der Symbolleiste auf Ihren Benutzernamen und Ihre Organisation und wählen Sie <strong>Mein\n            Konto</strong> aus.\n    </li>\n    <li>\n        Klicken Sie auf <strong>Einstellungen</strong>.\n    </li>\n    <li>\n        Bearbeiten Sie die Einstellungen <strong>Sprache</strong> und <strong>Regionales Format</strong>.\n    </li>\n</ol>",
    "invite-no-myvmware" : "<!--\ntitle: Kann ich einen Benutzer einladen, der nicht über ein MyVMware-Konto verfügt?\ncontext: [dashboard, invite]\n-->\n\n<p>Ja. Im Verlauf des Registrierungsprozesses wird der Benutzer aufgefordert, ein My VMware-Konto zu erstellen.</p>",
    "ipsec-vpn-connection" : "<!--\ntitle: Wie richte ich eine IPsec-VPN-Verbindung zum Verwaltungs-Gateway ein?\ncontext: [networking,vpn]\n-->\n<p>\n    Das Verwaltungs-Gateway bietet Zugriff auf die SDDC-Verwaltungsinfrastruktur, einschließlich vCenter Server, NSX und ESXi-\n    Hosts. Ein IPsec-VPN bietet Verwaltungsnetzwerkkonnektivität zwischen dem Verwaltungs-Gateway und einem Netzwerk in Ihrem\n    SDDC. Befolgen Sie zum Erstellen einer IPsec-VPN-Verbindung die Schritte unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-3A7090C5-836C-4DBA-9E69-A4A1D9B6F139.html\"\n        target=\"_blank\"\n    >Verwenden des Assistenten zum Konfigurieren von MGW-VPN, um ein Verwaltungs-VPN und -Gateway zu konfigurieren</a>.\n</li>\n",
    "log-intelligence" : "<!--\ntitle: Was ist das VMware vRealize Log Insight Cloud-Add-On?\ncontext: [log-intelligence,addons]\nfeature: uiEnableLintAddon\n-->\n<p>\n    VMware vRealize Log Insight Cloud ermöglicht Ihnen das Erfassen und Analysieren von in Ihrem SDDC generierten Protokollen. Eine Testversion des\n    Diensts wird in einem neuen SDDC standardmäßig aktiviert. Ein Testzeitraum von dreißig Tagen beginnt, wenn ein Benutzer in Ihrer Organisation\n    auf den Dienst zugreift. Nach Ablauf des Testzeitraums haben Sie die Möglichkeit, diesen Dienst zu abonnieren oder einen\n    Teil der Dienstfunktionen ohne zusätzliche Kosten zu verwenden. Informationen zum Verwenden von VMware vRealize Log Insight\n    Cloud finden Sie in der <a\n        href=\"https://docs.vmware.com/de/VMware-Log-Intelligence/index.html\"\n        target=\"_blank\"\n    >Dokumentation zu vRealize Log Insight Cloud</a>.\n</p>\n",
    "logical-network" : "<!--\ntitle: Wie erstelle ich ein logisches Netzwerk?\ncontext: [networking,logical-network]\n-->\n<p>\n    Logische Netzwerke bieten Netzwerkzugriff auf Arbeitslast-VMs. Ihr SDDC beginnt mit einem einzelnen logischen Standardnetzwerk,\n    sddc-cgw-network-1. Sie können den HTML5-vSphere Client zum Erstellen weiterer logischer Netzwerke verwenden. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_017\"\n        target=\"_blank\"\n    >Erstellen oder Ändern eines Netzwerksegments</a>.",
    "manage-vcenter-access" : "<!--\ntitle: Wie verwalte ich den Zugriff auf vCenter Server?\ncontext: [networking,firewall,vpn]\n-->\n<p>\n    Standardmäßig ist kein externer Zugriff auf das vCenter Server-System in Ihrem SDDC möglich. Aktivieren Sie den Zugriff auf das\n    vCenter Server-System, indem Sie Folgendes durchführen:\n</p>\n<ul class=\"list\">\n    <li>Konfigurieren einer Firewallregel für den Zugriff auf das vCenter Server-System.</li>\n    <li>Konfigurieren eines IPsec-VPNs zwischen dem lokalen Datencenter und dem SDDC.</li>\n</ul>\n<p>\n    Wenn Sie eine dieser Optionen konfiguriert haben, klicken Sie auf die Registerkarte <b>Einstellungen</b>, um zu ermitteln, wie mithilfe von vSphere Client und PowerCLI eine\n    Verbindung zu vCenter Server hergestellt werden kann.\n</p>\n",
    "management-compute-gateways" : "<!--\r\ntitle: Was sind Verwaltungs- und Computing-Gateways?\r\ncontext: [networking]\r\n-->\r\n<p>\n    Wenn Sie ein SDDC mithilfe von VMware Cloud on AWS bereitstellen, wird es mit zwei Netzwerken konfiguriert: einem Verwaltungsnetzwerk\n    und einem Computing-Netzwerk. Über das Verwaltungsnetzwerk werden der Netzwerkdatenverkehr für die SDDC-Hosts, für vCenter Server und NSX\n    Manager sowie weitere Verwaltungsfunktionen abgewickelt. Über das Computing-Netzwerk wird der Netzwerkdatenverkehr für Ihre Arbeitslast-VMs verarbeitet.\n</p>\r\n",
    "memory-running-out" : "<!--\ntitle: Der Arbeitsspeicher wird knapp. Was kann ich tun?\ncontext: [summary]\n-->\n<p>\n    Wenn die Möglichkeit besteht, Hosts hinzuzufügen, und bei Ihrem SDDC die maximale Anzahl Hosts noch nicht erreicht ist, können Sie einen Host hinzufügen,\n    um die verfügbare Arbeitsspeicherkapazität zu erhöhen. Andernfalls müssen Sie Arbeitslasten herunterfahren oder aus dem SDDC migrieren.\n</p>",
    "nat" : "<!--\ntitle: Wie konfiguriere ich NAT?\ncontext: [networking,nat]\n-->\n<p>\n    Die ausgehende Netzwerkadressübersetzung (Network Address Translation, NAT) ist standardmäßig für das Computing-Gateway konfiguriert. Mit der eingehenden NAT können Sie\n    Internetdatenverkehr von einer öffentlich zugänglichen IP-Adresse und einem entsprechenden Port einer privaten IP-Adresse und einem entsprechenden Port\n    innerhalb des Computing-Netzwerks Ihres SDDC zuordnen. Informationen zum Konfigurieren der eingehenden NAT finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0C04B8A4-A880-4A8E-85A5-4720D3A30235.html\"\n        target=\"_blank\"\n    >Konfigurieren der NAT-Einstellungen</a>.\n</p>\n",
    "preshared-key" : "<!--\r\ntitle: Was ist ein vorinstallierter Schlüssel?\r\ncontext: [networking,vpn]\r\n-->\r\n<p>\n    Der vorinstallierte Schlüssel wird von den beiden Enden des Verwaltungs-Gateway-VPN-Tunnels zur gegenseitigen\n    Authentifizierung verwendet. Daher müssen das SDDC-Gateway und das lokale Gateway denselben Schlüssel verwenden. Der Schlüssel hat eine maximale Länge von\n    128 Zeichen. Behandeln Sie den vorinstallierten Schlüssel wie ein Kennwort: Halten Sie ihn geheim und teilen Sie den Schlüssel\n    anderen Personen nicht per E-Mail oder über andere unsichere Verfahren mit.\n</p>\r\n",
    "public-ip" : "<!--\ntitle: Wie verwalte ich öffentliche IP-Adressen?\ncontext: [networking,public-ip]\n-->\n<p>\n    Wenn Sie eine Arbeitslast-VM haben, auf die Sie über das öffentliche Internet zugreifen müssen, fordern Sie eine öffentliche IP-Adresse dafür an. Weitere Informationen finden Sie unter\n    <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_018\"\n        target=\"_blank\"\n    >Anfordern oder Freigeben einer öffentlichen IP-Adresse</a>.\n</p>",
    "recommended-cryptography" : "<!--\ntitle: Wie lauten die empfohlenen Kryptografieeinstellungen für IPsec-VPNs?\ncontext: [networking,vpn]\n-->\n<p>\n    Das lokale Ende eines IPsec-VPN muss so konfiguriert werden, dass es mit den Einstellungen übereinstimmt, die Sie für das SDDC-Ende dieses\n    VPN angegeben haben. Informationen zu verfügbaren Einstellungen und empfohlenen Werten finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_019\"\n        target=\"_blank\"\n    >IPsec-VPN-Einstellungen – Referenz</a>.\n</p>",
    "remove-host" : "<!--\ntitle: Wie entferne ich Hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>\n    Sie können einen Host aus Ihrem SDDC entfernen, solange dabei die erforderliche Mindestanzahl an Hosts nicht unterschritten wird. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_012\"\n        target=\"_blank\"\n    >Hosts entfernen</a>.\n</p>\n",
    "sddc-can-i-add-hosts" : "<!--\ntitle: Kann ich Hosts meinem SDDC später hinzufügen?\ncontext: [create-sddc]\n-->\n<p>\n    Sie können zu einem späteren Zeitpunkt weitere Hosts bereitstellen, wenn Ihr SDDC weniger Hosts enthält als die Ihrer\n    Organisation zugeteilte maximale Anzahl.\n</p>\n",
    "sddc-groups" : "<!--\ntitle: Was ist eine SDDC-Gruppe?\ncontext: [create-sddc]\nfeature: uiEnableSddcGroups\n-->\n<p>Eine SDDC-Bereitstellungsgruppe verbindet Ihre SDDCs und VPCs mithilfe von VMware Transit Connect zur Bereitstellung von Verbindungen mit einer hohen Bandbreite\nund niedriger Latenz zwischen SDDCs in der Gruppe und zu anderen VPCs in derselben Region. Sie können auch einen Direct Connect Gateway (DXGW)\nhinzufügen, um eine zentrale Konnektivität zu Ihren lokalen SDDCs bereitzustellen. Ein SDDC muss mehrere Kriterien\nerfüllen, damit es für Gruppenmitgliedschaften in Frage kommt:</p>\n<ul class=\"list\">\n    <li>Es muss sich im Besitz der Organisation befinden, der die Gruppe gehört.</li>\n    <li>Er muss sich in derselben AWS-Region wie die anderen Gruppenmitglieder befinden.</li>\n    <li>Der CIDR-Block seines Verwaltungsnetzwerks darf sich mit dem Verwaltungs-CIDR-Block keines anderen Gruppenmitglieds überlappen.</li>\n    <li>Es darf nicht Mitglied einer anderen SDDC-Bereitstellungsgruppe sein.</li>\n    <li>Es muss die SDDC-Version 1.11 oder höher aufweisen.</li>\n</ul>\n<p>Peer-Konnektivität zwischen SDDC-Gruppenmitgliedern erfordert ein VMware Managed Transit Gateway (VTGW). Dies ist eine AWS-\nRessource, die von VMware Transit Connect erstellt und von VMware verwaltet wird. Wenn einer SDDC-Gruppe\ndas erste Mitglied hinzugefügt wird, wird eine dieser Ressourcen erstellt und der Gruppe zugewiesen. Erstellung  und Betrieb eines VTGW verursacht zusätzliche\nGebühren auf Ihrer VMware Cloud on AWS-Rechnung.</p>\n<p>So erstellen Sie eine SDDC-Gruppe:\n<ol class=\"list\">\n    <li>\nKlicken Sie auf der Registerkarte „SDDC-Gruppen“ auf <strong>AKTIONEN</strong> und wählen Sie <strong>SDDC-Gruppe erstellen</strong> aus.\n    </li>\n    <li>\nGeben Sie der Gruppe einen <strong>Namen</strong>, fügen Sie optional eine <strong>Beschreibung</strong> hinzu und klicken Sie dann auf <strong>WEITER</strong>.\n    </li>\n    <li>\nWählen Sie im Raster <strong>Mitgliedschaft</strong> die SDDCs aus, die als Gruppenmitglieder berücksichtigt werden sollen. Wenn Sie fertig sind,\nwählen Sie die Mitglieder aus und klicken Sie auf <strong>WEITER</strong>.\n    </li>\n    <li>\nBestätigen Sie, dass Sie die Kosten, die Ihnen beim Erstellen einer SDDC-Gruppe entstehen, verstehen und die Verantwortung dafür übernehmen.\nKlicken Sie dann auf <strong>GRUPPE ERSTELLEN</strong>, um die SDDC-Gruppe und ihr VMware Managed Transit Gateway zu erstellen.\n    </li>\n</ol>\n<p>\nDie Berechnung von Gebühren beginnt, wenn Sie auf <strong>GRUPPE ERSTELLEN</strong> klicken. Sie können den Prozess nach dessen Start nicht mehr anhalten oder abbrechen.\nGruppenmitglieder können VMware Transit Connect oder sein VTGW erst nach Abschluss der Bereitstellung verwenden. Die Bereitstellung\ndauert in der Regel etwa 15 Minuten.\n</p>",
    "sddc-how-many-hosts" : "<!--\ntitle: Wie viele Hosts sind in meinem SDDC zulässig?\ncontext: [create-sddc]\n-->\n<p>Ein Einzelhost-Starter-SDDC ist auf einen einzelnen Host beschränkt, bis Sie vertikal hochskalieren. Andere SDDCs beginnen mit mindestens zwei\n    Hosts und können auf maximal 16 Hosts vertikal hochskaliert werden.</p>\n",
    "set-compute-dns" : "<!--\ntitle: Wie richte ich DNS für meine Verwaltungs- und Computing-Netzwerke ein?\ncontext: [networking, dns, system]\nfeature: enableNsxtDeployment\n-->\n<p>\n    Ihr SDDC enthält standardmäßige DNS-Zonen für das Verwaltungs-Gateway und das Computing-Gateway. Jede Zone enthält einen\n    vorkonfigurierten DNS-Weiterleitungsdienst. Verwenden Sie die Registerkarte <strong>DNS-Dienste</strong> auf der Seite „DNS-Dienste“, um bestimmte Einstellungen der DNS-Weiterleitungsdienste für die Standardzonen zu deaktivieren,\n    aktivieren oder aktualisieren. Um weitere DNS-Zonen\n    zu erstellen oder zusätzliche Eigenschaften von DNS-Weiterleitungen in jeder beliebigen Zone zu konfigurieren, verwenden Sie die Registerkarte <strong>DNS-Zonen</strong>. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_002\" target=\"_blank\"\n    >Hinzufügen einer DNS-Zone</a>.\n</p>\n<ol class=\"list\">\n    <li>\n        Klicken Sie auf <strong>DNS</strong>.\n    </li>\n    <li>\n        Klicken Sie auf DNS-Dienste, um die Registerkarte „DNS-Dienste“ zu öffnen.\n        <br>\n        Weitere Informationen zu den DNS-Dienstparametern finden Sie unter <a\n            href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_025\" target=\"_blank\"\n        >Konfigurieren von DNS-Diensten</a>.\n    </li>\n    <li>\n        Klicken Sie auf <b>SPEICHERN</b>.\n    </li>\n</ol>",
    "srm" : "<!--\ntitle: Was ist ein Site Recovery-Add-On?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n<p>\n    VMware Site Recovery ermöglicht die Durchführung der automatischen Notfallwiederherstellung virtueller Maschinen aus\n    dem lokalen Datencenter zu Ihrem SDDC. Weitere Informationen finden Sie in der <a\n        href=\"https://docs.vmware.com/de/VMware-Site-Recovery/index.html\"\n        target=\"_blank\"\n    >Dokumentation zu VMware Site Recovery</a>.\n</p>\n",
    "storage-running-out" : "<!--\ntitle: Der Speicherplatz wird knapp. Was kann ich tun?\ncontext: [summary]\n-->\n<p>\n    Wenn die Möglichkeit besteht, Hosts hinzuzufügen, und die maximale Anzahl Hosts in Ihrem SDDC noch nicht erreicht ist, können Sie einen Host hinzufügen,\n    um die verfügbare Speicherkapazität zu erhöhen. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_010\"\n        target=\"_blank\"\n    >Hosts hinzufügen</a>. Andernfalls müssen Sie Arbeitslasten herunterfahren oder aus dem SDDC migrieren.\n</p>",
    "undefined" : "<!--\ntitle: Wie füge ich zusätzliche Hosts hinzu?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Sie können einen Host hinzufügen, wenn das SDDC weniger Hosts als die maximal zulässige Anzahl enthält. Wird die Option <b>Hosts hinzufügen</b> im Menü <b>Aktionen</b> nicht angezeigt, wenden Sie sich an VMware.</p>\n    \n<p>So fügen Sie einen Host hinzu:</p>\n<ol class=\"list\">\n    <li>Navigieren Sie zur Registerkarte <b>Übersicht</b> für Ihr SDDC.</li>\n    <li>Wählen Sie <b>Aktionen</b> &gt; <b>Hosts hinzufügen</b> aus.</li>\n    <li>Wählen Sie die Anzahl der hinzuzufügenden Hosts aus.</li>\n    <li>Klicken Sie auf <b>Hosts hinzufügen</b>.</li>\n</ol>\n<p>Die Größe des SDDC zu ändern, kann mehrere Minuten dauern. Während die Hosts hinzugefügt werden, werden Ihre Arbeitslasten und vCenter Server weiterhin wie gewohnt ausgeführt. Sie können jedoch keine weiteren Aktionen zum Hinzufügen oder Entfernen von Hosts starten.</p>\n",
    "vms-cant-reach-internet" : "<!--\ntitle: Warum haben virtuelle Maschinen keinen Zugang zum Internet?\ncontext: [networking,firewall]\n-->\n<p>\n    Die standardmäßigen Computing-Gateway-Firewallregeln hindern den gesamten Datenverkehr von VMs daran, das Internet zu erreichen. Damit die virtuellen Maschinen\n    Zugang zum Internet erhalten, müssen Sie eine Computing-Gateway-Firewallregel erstellen, die ausgehenden Datenverkehr\n    in dem logischen Netzwerk zulässt, mit dem die VM verbunden ist. Weitere Informationen finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_020\"\n        target=\"_blank\"\n    >Hinzufügen oder Ändern von Firewallregeln für das Computing-Gateway</a>.\n</p>",
    "what-can-i-do" : "<!--\ntitle: Welche Aktionen kann ich im Launchpad ausführen?\ncontext: [launchpad]\n-->\n<p>Das VMware Cloud-Launchpad ist ein konsolidierter Startpunkt für alle Hybrid Cloud-Infrastruktur- und\nzugehörigen Lösungen von VMware. Sie können die Links auf dieser Seite verwenden, um die ersten Schritte mit Migrationslösungen durchzuführen, VMware Tanzu\nKubernetes Grid zu erkunden oder um mit der Erstellung der Infrastruktur zu beginnen, die Sie für die nächsten Schritte auf dem Weg zu einer Cloud-Lösung benötigen.</p>\n<p>\nWeitere Informationen zum Launchpad finden Sie unter <a\n        href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_036\" target=\"_blank\"\n    >VMware Docs</a>.\n</p>",
    "what-happens-when-i-delete" : "<!--\ntitle: Was passiert, wenn ich ein SDDC lösche?\ncontext: [dashboard]\n-->\n<p>Wenn Sie ein SDDC löschen, geschieht Folgendes:</p>\n<ul class=\"list\">\n    <li>Alle Arbeitslasten im SDDC werden beendet.</li>\n    <li>Alle Daten- und Konfigurationseinstellungen im SDDC werden gelöscht.</li>\n    <li>Alle UI- und API-Zugriffe auf das SDDC werden beendet.</li>\n    <li>Alle öffentlichen IP-Adressen für das SDDC werden freigegeben.</li>\n    <li>Alle virtuellen Direct Connect-Schnittstellen im SDDC werden gelöscht.</li>\n</ul>\n<p>Sichern oder migrieren Sie wichtige Daten und Arbeitslast-VMs, bevor Sie ein SDDC löschen.</p>\n",
    "what-is-connected-amazon-vpc" : "<!--\ntitle: Was ist eine verbundenene Amazon-VPC?\ncontext: [networking]\n-->\n<p>\n    Während der SDDC-Erstellung können Sie Ihr SDDC mit einem AWS-Konto verbinden und eine VPC und ein Subnetz in diesem\n    Konto auswählen. VMware Cloud on AWS erstellt mithilfe einer CloudFormation-Vorlage eine AWS Elastic Network Interface (ENI),\n    über die Ihr SDDC und die Dienste in der Amazon-VPC und dem Subnetz in Ihrem AWS-Konto kommunizieren können, ohne Datenverkehr\n    über das Internet-Gateway weiterleiten zu müssen. Sie können ein SDDC nur mit einer einzigen Amazon-VPC verbinden.\n</p>\n<p>\n    Sie können Details Ihrer verbundenen Amazon-VPC anzeigen (beispielsweise die Konto-ID, die VPC-ID und das Subnetz), indem Sie auf\n     der Registerkarte <b>Netzwerk und Sicherheit</b> in der Kategorie <b>System</b> auf <b>Verbundene VPC</b> klicken.\n</p>\n",
    "what-is-direct-connect" : "<!--\ntitle: Was ist Amazon Direct Connect?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    <a href=\"https://aws.amazon.com/directconnect/\">AWS Direct Connect</a> ist ein von AWS bereitgestellter Dienst, der es Ihnen ermöglicht,\n    eine Hochgeschwindigkeitsverbindung mit geringer Latenz zwischen Ihrem lokalen Datencenter und einem AWS Direct\n    Connect-Standort·zu·erstellen.·Sie·können·über·eine·private·virtuelle·Schnittstelle,·die·Sie·in·der·AWS-Konsole·erstellen,\n    auf·Direct·Connect·zugreifen.·In·einem·SDDC·mit·einem·von·NSX-T·gestützten·Netzwerk·wird für den gesamten Direct Connect-Datenverkehr, einschließlich vMotion-,\n    Verwaltungs- und Computing-Gateway-Datenverkehr, eine private virtuelle Schnittstelle verwendet.\n</p>\n",
    "what-is-preview" : "<!--\ntitle: Worin bestehen Vorschaufeatures?\ncontext: [dashboard]\n-->\n<p>\n    Die Freigabe von Funktionen in der Vorschau dient dazu, Feedback zu diesen Funktionen zu sammeln. Derartige Funktionen sind auf der Benutzeroberfläche durch das Symbol <b>Vorschau</b> gekennzeichnet. Diese Funktionen stehen möglicherweise nicht allen Kunden oder nicht in allen AWS-Regionen zur Verfügung. Es kann nicht gewährleistet werden, dass die Funktionen in der „Vorschau“ innerhalb eines bestimmten Zeitraums verfügbar sind. Möglicherweise werden sie auch gar nicht erhältlich sein. Treffen Sie Ihre Kaufentscheidung nur anhand verfügbarer Funktionen.\n</p>",
    "what-is-traffic-group" : "<!--\ntitle: Was ist eine Datenverkehrsgruppe?\ncontext: [networking, virtual-interfaces]\nfeature: uiEnableSddcGroups\n-->\n<p>\n    In der Standardkonfiguration verfügt Ihr SDDC-Netzwerk über einen einzelnen Edge-Router, über den der gesamte vertikale Datenverkehr fließt. Um zusätzliche Bandbreite für eine Teilmenge dieses Datenverkehrs bereitzustellen, können Sie eine oder mehrere Datenverkehrsgruppen erstellen, die jeweils einen zusätzlichen Edge-Router erstellen, und dann eine Liste der CIDR-Blöcke erstellen, die über den neuen Edge-Router weitergeleitet werden sollen. Weitere Informationen zum Erstellen und Verwalten von Datenverkehrsgruppen finden Sie unter <a href=\"https://docs.vmware.com/de/VMware-Cloud-on-AWS/services/context?id=vmc_037\"\n        target=\"_blank\"\n    >Datenverkehrsgruppen hinzufügen, um die Edge-Bandbreite zu erhöhen</a>.\n</p>\n",
    "what-languages" : "<!--\ntitle: Welche Sprachen werden in der VMC Console-Benutzeroberfläche unterstützt?\ncontext: [dashboard]\nfeature: uiEnableLocalization\n-->\n<p>Die VMware Cloud on AWS-Konsole unterstützt Englisch, Französisch, Deutsch, Japanisch, Koreanisch, Spanisch, vereinfachtes Chinesisch\n    und traditionelles Chinesisch.</p>\n<p>Um die von VMware Cloud on AWS oder jedem anderen VMware Cloud Service angezeigte Sprache zu ändern, legen Sie\n    die Spracheinstellung für Ihr Konto fest.</p>\n<ol class=\"list\">\n    <li>\n        Klicken Sie in der VMware Cloud Services-Konsole in der Symbolleiste auf Ihren Benutzernamen und Ihre Organisation und wählen Sie <strong>Mein\n            Konto</strong> aus.\n    </li>\n    <li>\n        Klicken Sie auf <strong>Einstellungen</strong>.\n    </li>\n    <li>\n        Bearbeiten Sie die Einstellungen <strong>Sprache</strong> und <strong>Regionales Format</strong>.\n    </li>\n</ol>\n"
  }
}