{
  "component" : "docs",
  "locale" : "latest",
  "messages" : {
    "0004be8f6b3629f0e708d1ec68ed0e10" : "<!--\ntitle: Why can't my virtual machines reach the internet?\ncontext: [networking,firewall]\n-->\n<p>The default compute gateway firewall rules prevent all traffic from VMs from reaching the internet. To allow your virtual machines to reach the internet, you need to create a compute gateway firewall rule to allow outbound traffic on the logical network that your VM is connected to.</p>\n<ol class=\"list\">\n <li>Go to the <b>Network</b> tab for the SDDC.</li>\n    <li>Under either <b>Compute Gateway</b>, expand the <b>Firewall Rules</b> section.</li>\n    <li>Click <b>Add Rule</b>.</li>\n    <li>Enter the rule parameters:\n        <ul class=\"list\">\n            <li><b>Rule Name:</b> Enter a name for the rule.</li>\n            <li><b>Action:</b> Select <b>Allow</b>.</li>\n            <li><b>Source:</b> Enter the CIDR block IP address range assigned to the logical network for the VM.</li>\n            <li><b>Destination:</b> Enter <b>Any</b>.</li>\n            <li><b>Service:</b> Select <b>Any (All Traffic)</b>.</li>\n        </ul>\n    </li>\n\n</ol>",
    "0bedef5eb3bf011102af4dde2ffd30f3" : "<!--\ntitle: What are Preview features?\ncontext: [dashboard]\n-->\n<p>Features released in preview have been released to gather feedback. These features are marked with a <b>Preview</b> icon in the UI. These features might not be available to all customers or in all AWS regions. We cannot guarantee that features that are in \"Preview\" will become available within any particular time frame or at all. Make your purchase decisions only on the basis of features that are available.</p>",
    "0f673b9345c9b2d37731c1bc20ea21d7" : "<!--\ntitle: How do I remove hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>You can remove a host as long as you remain above the minimum of 3 hosts in an SDDC cluster:</p>\n<ol class=\"list\">\n    <li>Go to the <b>Summary</b> tab for your SDDC.</li>\n    <li>Select <b>Actions</b> &gt; <b>Remove Hosts</b>.</li>\n    <li>Select the number of hosts to remove.</li>\n    <li>Select <b>I understand that this action cannot be undone</b>.</li>\n    <li>Click <b>Remove</b>.</li>\n</ol>\n<p>It might take up to a few hours to resize the SDDC. While the hosts are being removed, your workloads and vCenter Server continue to run as normal, but you are not able to start additional add or remove host actions.</p>\n",
    "1041670326db849c3331e1879416f57a" : "<!--\ntitle: How do I set my default organization?\ncontext: [dashboard]\n-->\n\n<p>If you are a member of more than one organization, you can set a default organization. This organization will be the one displayed when you log in.</p>\n<ol class=\"list\">\n    <li>From the VMC Console dashboard, click your username and organization in the tool bar.</li>\n    <li>Click <b>Set Default Organization</b> and select the organization you want as the default.</li>\n</ol>",
    "147a7e2ad24bb56ec548c1540fcb6fe8" : "<!--\ntitle: What can I do on the dashboard page?\ncontext: [dashboard]\n-->\n<p>From the Dashboard, you can:</p>\n<ul class=\"list\">\n    <li>View all of the SDDCs created in the current organization. You can click on an individual SDDC to open vCenter Server, view details, or delete the SDDC.</li>\n    <li>Monitor the progress of ongoing SDDC deployments.</li>\n    <li>Click <b>Create SDDC</b> to create a new SDDC.</li>\n    <li>Click <b>Invite Users</b> to  invite other users to your organization.</li>\n    <li>Click your username at the top right to switch organizations (if you are a member of multiple organizations), view your profile, generate an OAuth Token, and set your default organization.</li>\n</ul>\n",
    "1611103ba0feffd85e1a9f1d8c264a91" : "<!--\ntitle: How do I configure DNS?\ncontext: [networking,dns]\n-->\n<p>Configure DNS to allow machines in your SDDC to resolve fully-qualified domain names (FQDNs) to IP addresses. When configuring DNS, do not configure one public DNS server and one private (on-premises) DNS server. Doing so leads to unpredictable DNS results. </p>\n<ol class=\"list\">\n    <li>On the Network tab for your SDDC, expand <b>DNS</b> under either <b>Management Gateway</b> or <b>Compute Gateway</b>. </li>\n    <li>Click <b>Edit</b>.</li>\n    <li>Enter IP addresses for <b>DNS Server 1</b> and (optionally) <b>DNS Server 2</b>.</li>\n    <li>If you are configuring DNS for the management gateway, select how the fully-qualified domain name (FQDN) for vCenter Server should be resolved.\n        <ul class=\"list\">\n            <li>If you access vCenter Server from the internet, select <b>Public IP</b>.</li>\n            <li>If you have configured a VPN and use the VPN to access vCenter Server, select <b>Private IP</b>.</li>\n        </ul>\n    </li>\n    <li>If you are configuring DNS for the compute gateway, and you have configured private DNS servers, ensure that you have configured your VPN to allow DNS requests over the compute gateway VPN by selecting <b>cgw-dns-network</b> as one of the local networks for VPN. See \"How do I set up an IPsec VPN connection to the Compute Gateway?\" for more information. </li>\n</ol>\n",
    "1e7fa90bb4da44fd3a9411ebf9db3435" : "<!--\ntitle: What are the recommended cryptography settings for IPsec VPNs?\ncontext: [networking,vpn]\n-->\n<p>Unless otherwise indicated, these settings cannot be edited in the VMC Console. If you choose other values for the editable settings, ensure that your on-premises gateway is set to match what you have set in the VMC Console. </p>\n<h4>Phase 1 Internet Key Exchange (IKE) Settings</h4>\n<ul class=\"list\">\n    <li>Protocol: IKEv1</li>\n    <li>ISAKMP mode: Main mode (Disable aggressive mode)</li>\n    <li>ISAKMP/IKE SA lifetime: 28800 seconds (8 hours)</li>\n    <li>Encryption (editable): AED-256</li>\n    <li>Hashing: SHA-1</li>\n    <li>Diffie Hellman (editable): DH Group 2</li>\n    <li>IPsec Mode: Tunnel</li>\n    <li>IKE Authentication: Pre-shared Key</li>\n</ul>\n<h4>Phase 2 Settings</h4>\n<ul class=\"list\">\n    <li>Encryption (editable): AES-256</li>\n    <li>Hashing: SHA-1</li>\n    <li>Tunnel Mode: Encapsulating Security Payload (ESP) Tunnel Mode</li>\n    <li>Diffie Hellman (editable): DH Group 2</li>\n    <li>SA lifetime: 3600 seconds (1 hour)</li>\n    <li>Perfect forward secrecy (PFS): Enabled</li>\n</ul>\n",
    "2283807a9964ef305873059103b3049b" : "<!--\ntitle: What is the pre-shared key?\ncontext: [networking,vpn]\n-->\n<p>The pre-shared key is used by the two ends of the management gateway VPN tunnel to authenticate with each other, so both the SDDC gateway and your on-premises gateway must use the same key. The key has a maximum length of 128 characters. Treat the pre-shared key as you would a password: keep it confidential, and don't use email or other insecure methods to communicate the key to others.</p>\n",
    "2c1ba2f7d865746fd731ed552a7f0b2e" : "<!--\ntitle: How do I access the vSphere Client?\ncontext: [connection-info]\n-->\n<p>Before you can access the vSphere Client, you must configure a VPN connection or firewall rule to permit access to vCenter Server. See <a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Set Management Gateway Firewall Rules</a>.</p>\n<p>Click the hyperlink under <b>vSphere Client (HTML5)</b> and use the username and password displayed on the Connection Info page to log in.</p>\n",
    "30b59ac2bbc24fc5bbec7cbb1e9a495f" : "<!--\ntitle: How do I create a public virtual interface?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>You can configure a public virtual interface to access AWS public services such as S3 to travel over the Direct Connect connection. You can also establish the management and compute gateway VPN tunnels over the Direct Connect public virtual interface.</p>\n<p>Before you create a public virtual interface, ensure that you meet the <a href=\"http://docs.aws.amazon.com/directconnect/latest/UserGuide/WorkingWithVirtualInterfaces.html#vif-prerequisites\">Prerequisites for Virtual Interfaces</a>.</p>\n<ol class=\"list\">\n    \n    <li>Log in to the AWS Console.</li>\n    <li>Click <b>Direct Connect</b> and then click <b>Virtual Interfaces</b>.</li>\n    <li>Click <b>Create Virtual Interface</b>.</li>\n    <li>Select <b>Public</b> to create a public virtual interface, and then select <b>My AWS Account</b> as the virtual interface owner.</li>\n</ol>\n<p>After the public virtual interface is created, configure your management and compute gateway IPsec VPNs so that the remote gateway IP and remote networks correspond to the device that terminates your Direct Connect connection in your on-premises data center.</p>",
    "368b83feade4e30006d029979ca09467" : "<!--\ntitle: I'm running out of Storage. What can I do?\ncontext: [summary]\n-->\n<p>If you have the ability to add hosts, and your SDDC isn't at its maximum number of hosts, you can add a host to increase the available storage capacity. Otherwise, shut down workloads or migrate them off of your SDDC.</p>",
    "371bacda2d54ffb6283b3c1ba319749f" : "<!--\ntitle: What is the connected Amazon VPC?\ncontext: [networking]\n-->\n<p>During the SDDC creation, you connect your SDDC to an AWS account, and select a VPC and subnet within that account. Using a CloudFormation template, VMware Cloud™ on AWS creates an Elastic Network Interface (ENI), allowing your SDDC and services in the Amazon VPC and subnet in your AWS account to communicate without needing to route traffic through the internet gateway. You can only connect an SDDC to a single Amazon VPC.</p>\n\n<p>You can view details of your connected Amazon VPC, such as the account ID, VPC ID, and subnet by clicking <b>Connected Amazon VPC</b> on the <b>Networking</b> tab.</p>\n",
    "399fb082e659bd059c329d47187b2c9b" : "<!--\ntitle: How do I access the vSphere Client?\ncontext: [connection-info]\n-->\n<p>Before you can access the vSphere Client, you must configure either a VPN connection or a firewall rule to permit access to vCenter Server. See <a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Set Management Gateway Firewall Rules</a>.</p>\n<p>Click the hyperlink under <b>vSphere Client (HTML5)</b> and use the username and password displayed on the Connection Info page to log in.</p>\n",
    "48964c31fdfaa31e73dd1678ae622e6d" : "<!--\ntitle: How do I set up an IPsec VPN connection to the Compute Gateway?\ncontext: [networking,vpn]\n-->\n<p>You can create a VPN connection from the compute gateway of your SDDC to an on-premises compute network.</p>\n<ol class=\"list\">\n    <li>On the Networking tab for your SDDC, complete the Compute Gateway VPN configuration.\n        <ul class=\"list\">\n            <li><b>VPN Name:</b> Enter a name for the VPN.</li>\n            <li><b>Remote Gateway Public IP:</b> Enter the IP address of your on-premises gateway.</li>\n            <li><b>Remote Gateway Private IP:</b> If your on-premises gateway is behind NAT, enter the private IP address of your on-premises gateway.</li>\n            <li><b>Remote Networks:</b> Enter the address of your on-premises compute networks.</li>\n            <li><b>Local Gateway IP:</b> Displays the IP address of the SDDC compute gateway. This is not an editable field.</li>\n            <li><b>Local Network:</b> Select the logical network to connect to using this VPN.  If the logical network uses DHCP and you have configured an on-premises DNS server, also select the <b>cgw-dns-network</b> to allow DNS requests to travel over the VPN. </li>\n            <li><b>Encryption:</b> Select <b>AES-256</b>.</li>\n            <li><b>Perfect Forward Secrecy:</b> Select <b>Enabled</b>.</li>\n            <li><b>Diffie Hellman:</b> Select a Diffie Hellman group. This must match with what is configured for your on-premises gateway.</li>\n            <li><b>Pre-Shared Key:</b> Enter a key string with a maximum length of 128 characters.</li>\n        </ul>\n    </li>\n    <li>Configure the on-premises side of the VPN tunnel using the recommended cryptography settings. See the <i>VMware Cloud on AWS Getting Started Guide</i> for more information on configuring specific gateway devices. </li>\n  \n</ol>\n<p>You can verify that the VPN tunnel is successfully connected by\n   looking at the VPN status on the Networking tab.</p>\n",
    "48a5b54af2520255a60f1aeb8acc32fc" : "<!--\ntitle: How do I set up an IPsec VPN connection to the Compute Gateway?\ncontext: [networking,vpn]\n-->\n<p>You can create a VPN connection from the compute gateway of your SDDC to an on-premises compute network.</p>\n<ol class=\"list\">\n    <li>On the Networking tab for your SDDC, complete the Compute Gateway VPN configuration.\n        <ul class=\"list\">\n            <li><b>VPN Name:</b> Enter a name for the VPN.</li>\n            <li><b>Remote Gateway Public IP:</b> Enter the IP address of your on-premises gateway.</li>\n            <li><b>Remote Gateway Private IP:</b> If your on-premises gateway is behind NAT, enter the private IP address of your on-premises gateway.</li>\n            <li><b>Remote Networks:</b> Enter the address of your on-premises compute networks.</li>\n            <li><b>Local Gateway IP:</b> Displays the IP address of the SDDC compute gateway. This is not an editable field.</li>\n            <li><b>Local Network:</b> Select the logical network to connect to using this VPN.  If the logical network uses DHCP and you have configured an on-premises DNS server, also select the <b>cgw-dns-network</b> to allow DNS requests to travel over the VPN. </li>\n            <li><b>Encryption:</b> Select <b>AES-256</b>.</li>\n            <li><b>Perfect Forward Secrecy:</b> Select <b>Enabled</b>.</li>\n            <li><b>Diffie Hellman:</b> Select a Diffie Hellman group. This must match with what is configured for your on-premises gateway.</li>\n            <li><b>Pre-Shared Key:</b> Enter a key string with a maximum length of 128 characters.</li>\n        </ul>\n    </li>\n    <li>Configure the on-premises side of the VPN tunnel using the recommended cryptography settings. See the <i>VMware Cloud on AWS Getting Started Guide</i> for more information on configuring specific gateway devices. </li>\n  \n</ol>\n<p>You can verify that the VPN tunnel is successfully connected by looking at the VPN status on the Networking page.</p>\n",
    "4b1343d42dce723ba29e55b781b412ac" : "<!--\ntitle: How do I attach a private virtual interface to my cloud SDDC?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>A private virtual interface allows ESXi management traffic and vMotion traffic to flow over the Direct Connect connection between your on-premises environment and your SDDC.</p>\n<p>Before you create a private virtual interface, ensure that you meet the <a href=\"http://docs.aws.amazon.com/directconnect/latest/UserGuide/WorkingWithVirtualInterfaces.html#vif-prerequisites\">Prerequisites for Virtual Interfaces</a>.</p>\n<ol class=\"list\">\n    <li>Determine the account ID for your VMC AWS account. This is displayed under the <b>Direct Connect</b> section of the <b>Networking</b> tab of your SDDC.</li>\n    <li>Log in to the AWS Console.</li>\n    <li>Click <b>Direct Connect</b> adn then click <b>Virtual Interfaces</b>.</li>\n    <li>Click <b>Create Virtual Interface</b>.</li>\n    <li>Select <b>Private</b> to create a private virtual interface. Select <b>Another AWS Account</b> as the account owner, and enter the account ID of your VMC AWS account.</li>\n    <li>Log in to VMC Console and navigate to the <b>Networking</b> tab of your SDDC.</li>\n    <li>Under <b>Direct Connect</b>, expand <b>Virtual Interfaces</b> and click <b>Attach</b> next to the virtual interface you created.</li>\n    <li>Select <b>I understand that I will be responsible for data transfer charges incurred for the interface</b> and click <b>Accept Virtual Interface</b>.</li>\n    <li>If you have an IPsec VPN configured, update your VPN settings.\n        <ol class=\"list\">\n            <li>In the VMC Console, refresh the management IPsec VPN settings. The network topology diagram shows the management appliance subnet address in the <b>Appliance Subnet</b> field.</li>\n            <li>Update the remote network setting in your on-premises gateway to use the management appliance subnet address.</li>\n        </ol>\n    </li>\n</ol>\n",
    "4f87a32661f5b7d16a44c3302de7d26f" : "<!--\ntitle: How do I choose the IP address range for the management network?\ncontext: [networking]\n-->\n<p>You can't change the values specified for the management network after the SDDC has been created. Consider the following when you choose these values:</p>\n<ul class=\"list\">\n    <li>The only supported sizes for the CIDR block range are /23, /20, and /16.</li>\n\t<li>If you plan to connect your SDDC to an on-premises data center, the IP addresses you choose for your SDDC must be different from those in your on-premises data center, to avoid IP address conflicts.</li>\n\t<li>The maximum number of hosts your SDDC can contain depends on the size of the CIDR block you specify. If the CIDR block is specified in the form XXX.XXX.XXX.XXX/YY, then the maximum number of hosts the SDDC can contain will be (2 ^(27 - YY)) - 3. For example, if you specify the CIDR block 192.0.2.0/23, the maximum number of hosts is (2 ^(27 - 24)) - 3, or 13.</li>\n</ul>\n<p><b>Note:</b> Although the number of host IP addresses available in a /16 CIDR block is 2045, the maximimum number of hosts in the SDDC is limited by other factors to 160.</p>",
    "504c453076570eee108f676037cdb3fd" : "<!--\ntitle: How do I invite another user?\ncontext: [dashboard]\n-->\n\n<p>To invite another user, you need to be an Organization Owner.</p>\n<ol class=\"list\">\n    <li>From the VMC Console dashboard, click <b>Invite Users</b>.</li>\n    <li>Enter the email addresses for the users you want to invite.</li>\n    <li>Select the role for the users you are inviting. You can select <b>Organization Owner</b> or <b>Organization Member</b>.</li>\n    <li>Click <b>Add</b>.</li>\n</ol>\n<p>The users you invite will receive an email with a link and additional instructions allowing them to sign up for VMware Cloud on AWS.</p>",
    "512168942276546150ab4591791d2c97" : "<!--\ntitle: How do I set up an IPsec VPN connection to the Management Gateway?\ncontext: [networking,vpn]\n-->\n<p>You can create a VPN connection from the management gateway of your SDDC to your on-premises management network.</p>\n<ol class=\"list\">\n    <li>On the Networking tab for your SDDC, complete either the Management Gateway VPN configuration.\n        <ul class=\"list\">\n            <li><b>VPN Name:</b> Enter a name for the VPN.</li>\n            <li><b>Remote Gateway Public IP:</b> Enter the public IP address of your on-premises gateway.</li>\n            <li><b>Remote Gateway Private IP:</b> If your on-premises gateway is behind NAT, enter the private IP address of your on-premises gateway.</li>\n            <li><b>Remote Networks:</b> Enter the address of your on-premises management networks.</li>\n            <li><b>Local Gateway IP:</b> Displays the IP address of the SDDC management gateway. This is not an editable field.</li>\n            <li><b>Local Network:</b>  Displays the CIDR block of the management subnet for the management gateway. This is not an editable field.</li>\n            <li><b>Encryption:</b> Select <b>AES-256</b>.</li>\n            <li><b>Perfect Forward Secrecy:</b> Select <b>Enabled</b>.</li>\n            <li><b>Diffie Hellman:</b> Select a Diffie Hellman group. This must match what you configure for your on-premises gateway.</li>\n            <li><b>Pre-Shared Key:</b> Enter a key string with a maximum length of 128 characters.</li>\n        </ul>\n    </li>\n    <li>Configure the on-premises side of the VPN tunnel using the recommended cryptography settings. See the <i>VMware Cloud on AWS Getting Started Guide</i> for more information on configuring specific gateway devices. </li>\n\n</ol>\n<p>You can verify that the VPN tunnel is successfully connected by looking at the VPN status on the Networking page.</p>\n",
    "51e82d2f893994cad4a0435b6704fa8a" : "<!--\ntitle: What firewall rules do I need for Site Recovery?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n\n<p>\n    You must create several firewall rules to enable management and replication traffic,\n    and the VMware Site Recovery service.\n</p>\n\n<p>\n    To enable management and API access:\n</p>\n\n<ol>\n    <li>Allow inbound service HTTPS (TCP 433) to vCenter</li>\n    <li>Allow inbound service SRM Server Management (TCP 9086) to Site Recovery Manager</li>\n    <li>Allow inbound service VR Server Management (TCP 8043) to vSphere Replication</li>\n    <li>Allow outbound service Any (All Traffic) from vCenter, Site Recovery Manager, and vSphere Replication</li>\n</ol>\n\n<p>\n    To enable replication traffic:\n</p>\n\n<ol>\n    <li>Allow inbound service VM Replication (TCP 31031, 44046) to vSphere Replication</li>\n    <li>Allow outbound service Any (All Traffic) from ESXi Management Only</li>\n</ol>\n\n<p>\n    To enable access to the Site Recovery console\n</p>\n\n<ol>\n    <li>Allow inbound HTTPS (TCP 443) to vSphere Replication</li>\n</ol>\n",
    "52939d0bf7f6e015fc43b762e1fe79b0" : "<!--\ntitle: Can I add hosts to my SDDC later?\ncontext: [create-sddc]\n-->\n<p>You can deploy additional hosts later if your SDDC contains fewer hosts than the maximum allocated to your organization.</p>\n\n    \n\n",
    "52b8f73acf9935a10aed190f248e5a6c" : "<!--\ntitle: How do I remove another user?\ncontext: [dashboard]\n-->\n\n<p>To remove another user from an organization, you need to be an Organization Owner.</p>\n<ol class=\"list\">\n    <li>From the VMC Console dashboard, click the services icon at the top right of the window, and select <b>Identity and Access Management</b>.</li>\n    <li>Select the user or users you want to remove.</li>\n    <li>Click <b>Remove Users</b>.</li>\n    <li>Click <b>Remove</b> to confirm the removal.</li>\n</ol>\n<p>The user is removed from the organization and will no longer be able to access the organization's resources.</p>",
    "5ba0833e46158bb895f9a8776f02fb99" : "<!--\ntitle: What is the Site Recovery Add-on?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n\n<p>VMware Site Recovery Manager allows you to perform automatic disaster recovery of virtual machines from your on-prem datacenter to your SDDC in the cloud.</p>\n",
    "5c4cd561f50297e3eb2c5783b9405139" : "<!--\ntitle: How do I create a new SDDC?\ncontext: [dashboard,create-sddc]\n-->\n<p>During the SDDC creation, you connect your SDDC to an AWS account, and select a VPC and subnet within that account. Using a CloudFormation template, VMware Cloud™ on AWS creates an Elastic Network Interface (ENI), allowing your SDDC and services in the Amazon VPC to communicate without needing to route traffic through the internet gateway. You can only connect an SDDC to a single Amazon VPC.</p>\n<p>Ensure that you have an AWS account and suitable VPC before you create an SDDC. Create the VPC in the same region that you intend to use for your SDDC, and create a subnet with at least 64 IP addresses (a /27 CIDR block) in each availability zone (AZ) in your VPC.</p>\n<p>To create a new SDDC:</p>\n<ol class=\"list\">\n    <li>From the Dashboard, click <b>Create SDDC</b>.</li>\n    <li>Follow the steps to connect your AWS account, set SDDC properties, and select the subnet. See <a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-EF198D55-03E3-44D1-AC48-6E2ABA31FF02.html\" target=\"_blank\">Deploy an SDDC from the VMC console</a> for more details.</li>\n</ol>\n<p>The status of the SDDC deployment is displayed on the Dashboard.</p>\n",
    "6ced784d9c5e00071eff86b77b849f2e" : "<!--\ntitle: What can I do on the Networking page?\ncontext: [networking]\n-->\n<p>On the networking page, you can:</p>\n<ul class=\"list\">\n    <li>View a topology diagram showing the status of network connections to and from your SDDC.</li>\n    <li>Create firewall rules for the management and compute gateways.</li>\n    <li>Configure VPN settings for IPsec VPN connections between your SDDC and an on-premises data center.</li>\n    <li>Configure DNS settings for the management and compute gateways.</li>\n    <li>View logical networks. (To configure logical networks, use the vSphere Client.)</li>\n    <li>Configure inbound NAT for your compute gateway.</li>\n    <li>Create public IP addresses for your compute gateway.</li>\n    <li>View information about your connected Amazon VPC.</li>\n    <li>Attach AWS Direct Connect private virtual interfaces to your SDDC.</li>\n</ul>\n",
    "7f1e7006f73bb6f25bf233669f10341a" : "<!--\ntitle: How do I set up compute gateway firewall rules?\ncontext: [networking,firewall]\n-->\n<p>By default, the firewall for the compute gateway is set to deny all inbound and outbound traffic. Add additional firewall rules to allow traffic as needed.</p>\n<ol class=\"list\">\n    <li>Go to the <b>Network</b> tab for the SDDC.</li>\n    <li>Under either <b>Compute Gateway</b>, expand the <b>Firewall Rules</b> section.</li>\n    <li>Click <b>Add Rule</b>.</li>\n    <li>Enter the rule parameters:\n        <ul class=\"list\">\n            <li><b>Rule Name:</b> Enter a name for the rule.</li>\n            <li><b>Action:</b> Select <b>Allow</b> or <b>Deny</b>.</li>\n            <li><b>Source:</b> Enter or select one of the following.\n                <ul class=\"list\">\n                <li>Select <b>All Internet and VPN</b> to apply the rule to all traffic from the Internet and VPN.</li>\n                <li>Select <b>All Connected Amazon VPC</b> to apply the rule to all traffic from the connected Amazon VPC.</li>    \n                <li>Enter <b>Any</b> to apply the rule to traffic from all sources.</li>\n                <li>Enter one or more IP addresses or IP adress ranges, separated by commas to apply the rule to traffic from those specific IP addresses. </li>    \n                </ul>\n            </li>\n            <li><b>Destination:</b> </b> Enter or select one of the following.\n                <ul class=\"list\">\n                <li>Select <b>All Internet and VPN</b> to apply the rule to all traffic to the Internet and VPN.</li>\n                <li>Select <b>All Connected Amazon VPC</b> to apply the rule to all traffic to the connected Amazon VPC.</li>    \n                <li>Enter <b>Any</b> to apply the rule to traffic to all sources.</li>\n                <li>Enter one or more IP addresses or IP adress ranges, separated by commas to apply the rule to traffic to those specific IP addresses. </li>    \n                </ul></li>\n            <li><b>Service:</b>Select one of the following:\n                <ul class=\"list\">\n                    <li><b>Any (All Traffic):</b> The rule applies to all traffic.</li>\n                    <li>A specific service: The rule applies to traffic from the selected service and port.</li>\n                    <li><b>ICMP (All ICMP)</b>: The rule applies to all ICMP traffic</li>\n                    <li><b>Custom TCP</b> or <b>Custom UDP</b>: To define a custom service and port to apply the rule to.</li>\n                </ul>\n            </li>\n            <li><b>Ports:</b> If you selected a custom TCP or UDP service, enter the port number.</li>\n        </ul>\n    </li>\n</ol>\n<p>Firewall rules are applied in order from top to bottom. Use the up and down arrow icons to move firewall rules</p>\n",
    "815b9b868cca3fed897e848acddbf460" : "<!--\ntitle: What is the Hybrid Cloud Extension Add-on?\ncontext: [hcx,addons]\n-->\n\n<p>VMware Hybrid Cloud Extension (HCX) abstracts on-premises and cloud resources and presents them to \nworkloads as a hybrid cloud. This allows workload mobility between your on-premises data center and \ncloud SDDC.</p>\n<p>HCX is included as part of your VMC on AWS service. For additional information on installing and \nconfiguring HCX, see <a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws\n.getting-started/GUID-DAE9B318-294A-4422-BBF4-82AE9DDFF043.html\">Hybrid Migration with HCX Checklist</a>.</p>",
    "8779212284284274601fb331ab4033a1" : "<!--\ntitle: How do I create a logical network?\ncontext: [networking,logical-network]\n-->\n<p>Logical networks are displayed in the VMC Console, but you use the vSphere Client to create them. </p>\n<ol class=\"list\">\n    <li>On the <b>Connection Info</b> tab for your SDDC, click the link under <b>vSphere Client (HTML5)</b> and log in with your vCenter Server credentials.</li>\n    <li>Select <b>Menu</b> &gt; <b>Global Inventory Lists</b> and select <b>Logical Networks</b></li>\n    <li>Click the add button.</li>\n    <li>In the <b>Name</b> text field, enter a name for the logical network.</li>\n    <li>In the <b>CIDR Block</b> text field, enter a CIDR block in xxx.xxx.xxx.0/YY format. <p>Prefix length should be between 22 and 30, because your logical network must have no more than 1000 ports.</p></li>\n    <li>(Optional) Select <b>Enabled</b> to enable DHCP. <p>If you enable DHCP on a logical network and you have configured an on-premises DNS server, you must edit your compute gateway VPN to enable DNS queries to be correctly forwarded over the VPN by selecting <b>cgw-dns-network</b> as one of the local networks for VPN.</p></li>\n    <li>Click <b>OK</b>.</li>\n</ol>\n",
    "8c9c25e613fcceef9f17aab074171d86" : "<!--\ntitle: What can I do on the Summary page?\ncontext: [summary]\n-->\n<p>The Summary page displays the current CPU, Memory, and Storage utilization of your SDDC. You can also add and remove hosts from your SDDC from this page.</p>",
    "8e142af13e14fd0858db11652a4f6a91" : "<!--\ntitle: How do I manage access to vCenter Server?\ncontext: [networking,firewall,vpn]\n-->\n<p>By default, there is no external access to the vCenter Server system in your SDDC. Open access to your vCenter Server system by:</p>\n<ul class=\"list\">\n    <li>Configuring a firewall rule to allow access to the vCenter Server system.</li>\n    <li>Configuring an IPsec VPN between your on-premises data center and your SDDC.</li>\n</ul>\n<p>When you have configured one of these options, click the <b>Connection Info</b> tab to see how to connect to vCenter Server using the vSphere Client and PowerCLI.</p>\n",
    "907e29f426a0e6cfe310ca3065113696" : "<!--\ntitle: What happens when I delete an SDDC?\ncontext: [dashboard]\n-->\n<p>When you delete an SDDC, your VMs and data are deleted and the hosts and other resources allocated to the SDDC are released for use in other SDDCs. Back up or migrate off any essential data and VMs before deleting an SDDC.</p>\n",
    "9473fdd0d880a43c21b7778d34872157" : "test content",
    "99a1f78f70ee152574b1f192a311da43" : "<!--\ntitle: How do I delete an SDDC?\ncontext: [dashboard]\n-->\n<p>On the Dashboard, locate the card for the SDDC and click <b>Actions</b> &gt; <b>Delete SDDC</b>.</p>\n",
    "9a5c79ad338ec95353d9a47570c368bc" : "<!--\ntitle: Can I invite a user who does not have a MyVMware account?\ncontext: [dashboard, invite]\n-->\n\n<p>Yes. The user will be prompted to create a MyVMware account during the sign up process.</p>",
    "9a876507c260d5e28f7888e94b34c30b" : "<!--\ntitle: How do I set up management gateway firewall rules?\ncontext: [networking,firewall]\n-->\n<p>By default, the firewall for the management gateway is set to deny all inbound and outbound traffic. Add additional firewall rules to allow you to reach vCenter Server and allow other traffic as needed.</p>\n<ol class=\"list\">\n    <li>Go to the <b>Network</b> tab for the SDDC.</li>\n    <li>Under either <b>Management Gateway</b>, expand the <b>Firewall Rules</b> section.</li>\n    <li>Click <b>Add Rule</b>.</li>\n    <li>Enter the rule parameters:\n        <ul class=\"list\">\n            <li><b>Rule Name:</b> Enter a descriptive name for the rule.</li>\n              <li><b>Action:</b> Only the <b>Allow</b> action is available for management gateway firewall rules.</li>\n            <li><b>Source:</b> Enter one of the following:\n                <ul class=\"list\">\n                    <li>an IP address, IP address range, or <b>Any</b> to allow traffic from that address or address range.</li>\n                    <li><b>vCenter</b> to allow traffic from your SDDC's vCenter Server.</li>\n                    <li><b>ESXi Management Only</b> to allow traffic from your SDDC's ESXi management.</li>\n                </ul>\n            </li>\n            <li><b>Destination:</b>Enter one of the following:\n                <ul class=\"list\">\n                    <li>an IP address, IP address range, or <b>Any</b> to allow traffic to that address or address range.</li>\n                    <li><b>vCenter</b> to allow traffic to your SDDC's vCenter Server.</li>\n                    <li><b>ESXi Management Only</b> to allow traffic to your SDDC's ESXi management.</li>\n                </ul>\n            </li>\n            <li><b>Service</b>: Select one of the following:\n                <ul class=\"list\">\n                    <li><b>Any (All Traffic)</b></li>\n                    <li><b>HTTPS (TCP 443)</b>: applies only to vCenter Server as a destination.</li>\n                    <li><b>Provisioning (TCP 902)</b>: applies only to ESXi Management as a destination.</li>\n                    <li><b>Remote Console (TCP 903)</b>: applies only to ESXi Management as a destination.</li>\n                    <li><b>ICMP (All ICMP)</b></li>\n                </ul>\n            </li>  \n            <li><b>Port</b>: This is a non-editable parameter showing the port for the service selected.</li>\n        </ul>\n    </li>\n</ol>\n<p>Firewall rules are applied in order from top to bottom. Use the up and down arrow icons to move firewall rules</p>\n",
    "9fee73eeba958dca24974ae6e88a6c55" : "<!--\ntitle: What is Amazon Direct Connect?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>AWS Direct Connect is a service provided by AWS that allows you to create a high-speed, low-latency connection between your on-premises data center and AWS services.</p>\n\n<p>Direct Connect is accessed through a private or public virtual interface. You can use a private virtual interface for ESXi management and vMotion traffic between your on-premises data center and your cloud SDDC. You can use a public virtual interface to access public AWS services and route management gateway IPsec VPN traffic over Direct Connect.</p>\n",
    "a82311223952969b5c0c177b512d9a90" : "<!--\ntitle: About VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>Copyright © 2017-2018 VMware, Inc. All rights reserved. This product is protected by copyright and intellectual property laws in the United States and other countries as well as by international treaties. VMware products are covered by one or more patents listed at <a href=\"http://www.vmware.com/go/patents\" target=\"_blank\">http://www.vmware.com/go/patents</a>.</p>\n<p>VMware is a registered trademark or trademark of VMware, Inc. in the United States and other jurisdictions. All other marks and names mentioned herein may be trademarks of their respective companies.</p>\n",
    "about-vmc-on-aws" : "<!--\ntitle: About VMware Cloud on AWS\ncontext: [settings, create-sddc, dashboard, networking, summary]\n-->\n<p>\n    Copyright © 2017-2020 VMware, Inc. All rights reserved. This product is protected by copyright and intellectual\n    property laws in the United States and other countries as well as by international treaties. VMware products are\n    covered by one or more patents listed at <a\n        href=\"http://www.vmware.com/go/patents\"\n        target=\"_blank\"\n    >http://www.vmware.com/go/patents</a>.\n</p>\n<p>VMware is a registered trademark or trademark of VMware, Inc. in the United States and other jurisdictions. All\n    other marks and names mentioned herein may be trademarks of their respective companies.</p>\n",
    "ad24817552198eb1a923aebd467e0274" : "<!--\ntitle: How do I Troubleshoot IPsec VPN Connection Errors?\ncontext: [networking,vpn]\n-->\n<p>After you create a VPN connection between the compute gateway of\n    your SDDC and an on-premises compute network, you can verify that the\n    VPN tunnel is successfully connected by looking at the VPN status on\n    the Networking tab. VPN creation can fail due to misconfiguration of\n    the SDDC or on-premises end of the network. Click VPN Status Detail for\n    more information about VPN status, including channel and tunnel error\n    messages. This list of VPN error messages includes suggested fixes for\n    the root cause of the error.</p>\n\n<p>\n    Channel Message:\n    <kbd>Policy does not allow OAKLEY_RSA_SIG authentication...</kbd>\n    <br>Tunnel Message:\n    <kbd> No acceptable Oakley Transform, sending notification...</kbd>\n    <br> <strong>Suggested Fix:</strong> Set the on-premises VPN\n    authentication mode to PSK.\n</p>\n<p>\n    Channel Message:\n    <kbd>peer is NATed...</kbd>\n    <br>Tunnel Message:\n    <kbd>peer is NATed...</kbd>\n    <br> <strong>Suggested Fix:</strong> Verify that the on-premises\n    firewall opens port 4500 for UDP traffic between the on-premises VPN\n    and the public IP of the SDDC VPN.\n<p>\n    Channel Message:\n    <kbd> sending notification NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> Tunnel Message:\n    <kbd> NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> <strong>Suggested Fix:</strong> Download the SDDC VPN\n    configuration and verify that the on-premises VPN has the same Phase 1\n    IPsec_configuration.\n</p>\n<p>\n    Channel Message: none<br> Tunnel Message:\n    <kbd> NO_PROPOSAL_CHOSEN msgid=00000000 ...</kbd>\n    <br> <strong>Suggested Fix:</strong> Download the SDDC VPN\n    configuration and verify that the on-premises VPN has the same Phase 2\n    IPsec_configuration.\n</p>\n<p>\n    Channel Message: none<br>Tunnel Message:\n    <kbd> cannot respond to IPsec SA request because no connection is\n        known for ...</kbd>\n    <br> <strong>Suggested Fix:</strong> Download the SDDC VPN\n    configuration and verify that the on-premises VPN is reachable at the\n    Local address shown under Local configuration addresses and the SDDC\n    VPN UI shows that address for <b>Remote Gateway IP</b>.\n</p>\n<p>\n    Channel Message:\n    <kbd>initiating Main Mode, STATE_MAIN_I1: initiate, deleting\n        state (STATE_MAIN_I1) ...</kbd>\n    <br>Tunnel Message:\n    <kbd>deleting state (STATE_MAIN_I1), STATE_MAIN_I1: initiate,\n        initiating Main Mode ...</kbd>\n    <br> <strong>Suggested Fix:</strong>Verify that the on-premises\n    management gateway firewall rules allow ICMP ping traffic to the SDDC\n    VPN.\n</p>\n<p>\n    Channel Message:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., we require peer to have ID '208.91.1.25', but peer declares\n        '10.146.97.30'...</kbd>\n    <br>Tunnel Message:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., deleting state (STATE_MAIN_R2), deleting state (STATE_QUICK_R2),\n        Main mode peer ID is ID_IPV4_ADDR: '10.146.97.30' ...</kbd>\n    <br> <strong>Suggested Fix:</strong> The value configured in the\n    SDDC IPsec VPN UI for <b>Remote Gateway Public IP</b> (208.91.1.25 in\n    this example) does not match the value that the on-premises VPN is\n    supplying for its identity (10.146.97.30 in this example). Edit the <b>Remote\n    Gateway Public IP</b> value in the SDDC IPsec VPN UI or update the\n    on-premises network to use a Local id that matches the <b>Remote\n    Gateway Public IP</b> value in the SDDC IPsec VPN UI.\n\n</p>\n<p>\n    Channel Message:\n    <kbd>received 1 malformed payload notifies, ...</kbd>\n    <br>Tunnel Message:\n    <kbd>sending notification PAYLOAD_MALFORMED to ..., probable\n        authentication failure (mismatch of preshared secrets?)...</kbd>\n    <br> <strong>Suggested Fix:</strong> Verify that pre-shared key\n    configured for the on-premises end of the VPN matches the Pre-shared\n    key configured in in the SDDC IPsec VPN UI.\n</p>\n\n<p>\n    For more information about troubleshooting VPN connection issues, see <a\n    href=\"https://docs.vmware.com/en/VMware-NSX-for-vSphere/6.4/com.vmware.nsx.troubleshooting.doc/GUID-3E4D0B69-B7E7-4C8B-BC78-A3FB3EE5E8BA.html\">Troubleshooting\n    Virtual Private Networks</a> in the NSX for vSphere documentation.\n</p>\n",
    "add-custom-service" : "<!--\ntitle: How do I add a custom service?\ncontext: [networking, inventory]\nfeature: enableNsxtDeployment\n-->\n<P>When you create a firewall rule, you can specify that it applies to network traffic from one or more of\n   the services defined in your SDDC's Services inventory. The default list includes VMware services such as\n   remote console and provisioning, standard services such as IKE, ICMP, and TCP, and many well-known third\n   party services. You can add services to this list by selecting values, typically ports and protocols, from\n   a list of service types and additional service properties.</p>\n<ol class=\"list\">\n   <li>Click <strong>Services &gt; ADD NEW SERVICE</strong> and give the new service a Name.\n   </li>\n   <li>Click <strong>Set Service Entries</strong> to open the Set Service Entries page.\n   </li>\n   <li>On the Set Service Entries page, click <strong>ADD NEW SERVICE ENTRY</strong>. <br> To view\n      the list of known services, use the drop-down controls to scroll through the <strong>Service\n         Type</strong> and <strong>Additional Properties</strong> lists. To add a service, select a <strong>Service\n         Type</strong> from the drop-down menu and specify <strong>Additional Properties</strong> such as Source or\n      Destination Ports of the service, then click <strong>APPLY</strong>.\n   </li>\n   <li>(Optional) Provide a service <strong>Description</strong> and tag the service.\n   </li>\n   <li>Click <strong>SAVE</strong> to create the service definition.\n   </li>\n</ol>",
    "add-host" : "<!--\ntitle: How do I add additional hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>\n    <b></b>You can add a host if your SDDC contains fewer hosts than the maximum allowed. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_010\"\n        target=\"_blank\"\n    >Add Hosts</a>.",
    "add-management-group" : "<!--\ntitle: How do I add management groups?\ncontext: [networking, inventory]\nfeature: enableNsxtDeployment\n-->\n<p>Pre-defined management inventory groups are created automatically for SDDC infrastructure components\n   such as vCenter and NSX Manager. You cannot modify a pre-defined management group, but you can create\n   additional management inventory groups by specifying the CIDR blocks to which group members are connected.</p>\n<ol class=\"list\">\n   <li>Click <strong>Inventory &gt; Groups</strong>.\n   </li>\n   <li>On the Groups page, click <strong>MANAGEMENT GROUPS</strong>, then click <strong>ADD\n         GROUP</strong> and give the group a <strong>Name</strong> and an optional <strong>Description</strong>.\n   </li>\n   <li>Click <strong>Set Members</strong> to open the <strong>Select Members</strong> page. Enter one or\n      more IP addresses of management VMs in CIDR format.\n   </li>\n   <li>(Optional) Tag the group.</li>\n   <li>Click <strong>SAVE</strong> to create the group.\n   </li>\n</ol>",
    "add-workload-groups" : "<!--\ntitle: How do I add workload or compute groups?\ncontext: [networking,inventory]\n-->\n<p>Because compute inventory groups are made up of the compute VMs you deploy on your compute network\n   segments. VMware Cloud on AWS cannot create them for you. You'll need to create them yourself before you\n   can develop compute gateway firewall rules.</p>\n<ol class=\"list\">\n   <li>Click <strong>Inventory &gt; Groups</strong>.\n   </li>\n   <li>On the Groups page, click <strong>COMPUTE GROUPS</strong>, then click <strong>ADD GROUP</strong>\n      and give the group a <strong>Name</strong> and an optional <strong>Description</strong>.\n   </li>\n   <li>Click <strong>Set Members</strong> to open the <strong>Select Members</strong> page. See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_023\" target=\"_blank\"\n   >Add or Modify a Compute Group</a> for more information about ways to designate membership in a compute group.\n   </li>\n   <li>(Optional) Tag the group.</li>\n   <li>Click <strong>SAVE</strong> to create the group. \n   </li>\n</ol>",
    "advanced-security" : "<!--\ntitle: What is the NSX Advanced Security Add-on?\ncontext: [networking,addons]\nfeature: uiEnableNsxtAddon\n-->\n<p>\n    NSX Advanced Security for VMware Cloud on AWS gives your SDDC access to NSX application security features, including\n    <a\n        href=\"https://docs.vmware.com/en/VMware-NSX-T-Data-Center/3.0/administration/GUID-967EA04D-EA5A-4E0C-ACC3-D05B282C7FAF.html\"\n        target=\"_blank\"\n    > Context Profiles </a>.\n</p>\n",
    "ae317d4d23c887da92794b8baed1d765" : "<!--\ntitle: About VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>Copyright © 2017 VMware, Inc. All rights reserved. This product is protected by copyright and intellectual property laws in the United States and other countries as well as by international treaties. VMware products are covered by one or more patents listed at <a href=\"http://www.vmware.com/go/patents\" target=\"_blank\">http://www.vmware.com/go/patents</a>.</p>\n<p>VMware is a registered trademark or trademark of VMware, Inc. in the United States and other jurisdictions. All other marks and names mentioned herein may be trademarks of their respective companies.</p>",
    "attach-private-vif" : "<!--\ntitle: How do I attach a private virtual interface to my cloud SDDC?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    An AWS private virtual interface (VIF) uses a private IP address space and provides a private dedicated connection\n    to the AWS network backbone, terminating at your VPC. Log in to the AWS\n    console to create the private VIF, then log in to your SDDC console to attach the VIF. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_014\"\n        target=\"_blank\"\n    >Create a Private Virtual Interface for vMotion and ESXi Management Traffic</a>. Note that your organization must\n    accept responsibility for data transfer charges incurred for this interface before you can begin using it to connect\n    an on-premises data center to your SDDC.\n</p>\n",
    "available-roles" : "<!--\ntitle: What roles can I assign to a new user?\ncontext: [dashboard, invite]\n-->\n<p>An organization owner must assign each organization member one of the following roles:</p>\n<ul class=\"list\">\n    <li>Organization Owner: Only Organization Owners can invite other users to join the organization.</li>\n    <li>Organization Member: Organization Members can create, manage, and access cloud data centers belonging to\n        the Organization, but cannot invite new users.</li>\n</ul>\n<p>\n    For more information, see <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_021\"\n        target=\"_blank\"\n    >Assign a VMC Service Role to an Organization Member</a>.\n</p>",
    "bb4bd2b0bac3cadb60ded3460a132c6c" : "<!--\ntitle: What can I do on the Networking page?\ncontext: [networking]\n-->\n<p>On the nextworking page, you can:</p>\n<ul class=\"list\">\n    <li>View a topology diagram showing the status of network connections to and from your SDDC.</li>\n    <li>Create firewall rules for the management and compute gateways.</li>\n    <li>Configure VPN settings for IPsec VPN connections between your SDDC and an on-premises data center.</li>\n    <li>Configure DNS settings for the management and compute gateways.</li>\n    <li>View logical networks. (To configure logical networks, use the vSphere Client.)</li>\n    <li>Configure inbound NAT for your compute gateway.</li>\n    <li>Create public IP addresses for your compute gateway.</li>\n    <li>View information about your connected Amazon VPC.</li>\n    <li>Attach AWS Direct Connect private virtual interfaces to your SDDC.</li>\n</ul>\n",
    "bb6d9d33a0a0560a5eaa7ba985b8fceb" : "<!--\ntitle: How do I connect to my SDDC using PowerCLI?\ncontext: [connection-info]\n-->\n\n<p>Before you can connect using PowerCLI, you must create a firewall rule to allow access to vCenter Server. See <a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Set Management Gateway Firewall Rules</a>.</p>\n<ol class=\"list\">\n    <li>Launch PowerCLI on your client machine.</li>\n    <li>On the Connection Info page in the VMC Console, copy the command under <b>PowerCLI Connect</b> by clicking the copy button.</li>\n    <li>Paste the command in the PowerCLI window.</li>\n    <li>Replace the <tt>&lt;password&gt;</tt> with the password shown under <b>Authentication</b>.If the password contains special characters, enclose it in single quotes.</li>\n</ol>\n",
    "c0ecc7ac8dc10d134d859bd7c95f90e0" : "<!--\ntitle: How do I add additional hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>You can add a host if your SDDC contains fewer hosts than its maximum. If you don't see the <b>Add Hosts</b> option in the <b>Actions</b> menu, contact VMware.</p>\n    \n<p>To add a host:</p>\n<ol class=\"list\">\n    <li>Go to the <b>Summary</b> tab for your SDDC.</li>\n    <li>Select <b>Actions</b> &gt; <b>Add Hosts</b>.</li>\n    <li>Select the number of hosts to add.</li>\n    <li>Click <b>Add Hosts</b>.</li>\n</ol>\n<p>It might take up to a few minutes to resize the SDDC. While the hosts are being added, your workloads and vCenter Server continue to run as normal, but you are not able to start additional add or remove host actions.</p>\n",
    "c1dcdcbe735c6e47a057611d5c3ed1f9" : "<!--\ntitle: How do I set up an L2 VPN connection to the Compute Gateway?\ncontext: [networking,l2vpn]\n-->\n<p>\n\tSetting up an L2 VPN is part of the configuration of an extended network. An extended network has a single IP address space that spans your on-premises and SDDC\n\tenvironments. This simplifies migration of workload VMs to and from your cloud SDDC.\n</p>\n<ol class=\"list\">\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-B447CF8B-8A5F-4189-8E12-078E0FD62320.html\">Configure the L2\n\t\t\tVPN Server in your SDDC.</a>\n\t\tThe Compute Gateway in your cloud SDDC acts as the L2 VPN server and provides the SDDC side of the L2 VPN that backs an extended network. Use the VMC Console to configure the\n\t\tserver.\n\t</li>\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-027ECB6F-78D7-4089-8E71-3FEE6F327D72.html\">Configure and\n\t\t\tenable your on-premises L2 VPN Client.</a>\n\t\tAfter the SDDC side of the L2 VPN is configured, the system prompts you to configure the remote (on-premises) side of the L2 VPN. You can use your existing on-premises NSX for\n\t\tthis, or you can download a standalone NSX appliance.\n\t</li>\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-AFC96BF4-DBE4-4AFC-85E3-749C09289758.html\">Create an Extended\n\t\t\tNetwork in Your SDDC.</a>\n\t\tSpecify the IDs of the tunnels you created in Step 1 and Step 2. When the extended network has been configured, you can bring up the L2 VPN tunnel.\n\t</li>\n</ol>\n<p>\n\tTo verify that the L2 VPN tunnel is successfully connected, open the <b>L2 VPNs</b> row under <b>Compute Gateway</b> and refresh the Status.\n</p>\n",
    "c4a6fedc7bfcfeb8f152266f21e8d145" : "<!--\ntitle: How should I configure the vCenter Server FQDN?\ncontext: [networking,dns]\n-->\n<p>As part of the Management Gateway DNS settings, you must configure how to resolve the vCenter Server fully-qualified domain name.</p>\n<ul class=\"list\">\n    <li>If you access vCenter Server from the internet, select <b>Public IP</b>.</li>\n    <li>If you have configured a VPN and use the VPN to access vCenter Server, select <b>Private IP</b>.</li>\n</ul>\n",
    "ccbad6ce65d351ae7236e3fd1697c46d" : "<!--\ntitle: How do I manage public IP addresses?\ncontext: [networking,public-ip]\n-->\n<p>You can request public IP addresses to assign to workload VMs to allow access to these VMs from the internet. VMware Cloud on AWS will provision the IP address from AWS. Before you you create a public IP address, you should assign your VM a static IP address from the logical network it is connected to. </p>\n<ol class=\"list\">\n    <li>On the Network tab of your SDDC, click <b>Public IPs</b> under <b>Compute Gateway</b>.</li>\n    <li>Click <b>Request Public IP</b>.</li>\n    <li>Enter notes about this IP address and click <b>Save</b>.</li>\n</ol>\n<p>To use this public IP address, do the following:</p>\n<ul class=\"list\">\n    <li>Configure a NAT rule to connect the public IP address to the internal IP address of a VM.</li>\n    <li>Add a compute gateway firewall rule to allow traffic between the public IP address and the logical network that the VM is attached to.</li>\n</ul>\n",
    "choose-management-ip" : "<!--\ntitle: How do I choose the IP address range for the management network?\ncontext: [networking]\n-->\n<p>\n    You can't change the values specified for the management network after the SDDC has been created. Consider\n    the following when you choose these values:\n</p>\n<ul class=\"list\">\n    <li>Choose an IP address range that does not overlap with the AWS subnet you are connecting to. If you plan to\n        connect your SDDC to an on-premises data center, the IP addresses you choose for the management network must be\n        different from the ones in your on-premises data center, to avoid IP address conflicts.</li>\n    <li>\n        CIDR blocks of size 16, 20, or 23 are supported. For CIDR blocks of size 20 or 23, the maximum number of hosts\n        your SDDC can contain depends on the CIDR block size you specify and whether the SDDC occupies a single\n        availability zone (AZ) or multiple AZs.\n        <dl class=\"list\">\n            <dt>CIDR block size 23</dt>\n            <dd>Up to 27 hosts (single AZ). Up to 22 hosts (multi-AZ).</dd>\n            <dt>CIDR block size 20 or 16</dt>\n            <dd>Up to 160 hosts, regardless of number of AZs.</dd>\n        </dl>\n    </li>\n</ul>",
    "compute-firewall-rules" : "<!--\ntitle: How do I set up compute gateway firewall rules?\ncontext: [networking,firewall]\n-->\n<p>\n    The default Compute Gateway firewall rules block all inbound and outbound traffic. Before you can use a new Compute\n    Gateway, you must create firewall rules that allow traffic as needed. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0E66C9C8-C260-4056-8511-44818431110C.html\"\n        target=\"_blank\"\n    >Set Compute Gateway Firewall Rules</a>.\n</p>\n",
    "compute-ipsec-vpn-connection" : "<!--\ntitle: How do I set up an IPsec VPN connection to the Compute Gateway?\ncontext: [networking,vpn]\n-->\n<p>\n    The Compute Gateway provides access to your workload VMs. An IPsec VPN provides connectivity between the Compute\n    Gateway and the compute network in your SDDC. To create an IPsec VPN connection to the Compute Gateway, follow the\n    steps in <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-93C55532-5734-4B70-8745-C3E779512869.html\"\n        target=\"_blank\"\n    >Create a Compute VPN </a>.\n</p>\n",
    "compute-ipsec-vpn-connection-err" : "<!--\ntitle: How do I Troubleshoot IPsec VPN Connection Errors?\ncontext: [networking,vpn]\n-->\n<p>After you create a VPN connection between the compute gateway of\n    your SDDC and an on-premises compute network, you can verify that the\n    VPN tunnel is successfully connected by looking at the VPN status on\n    the Networking tab. VPN creation can fail due to misconfiguration of\n    the SDDC or on-premises end of the network. Click VPN Status Detail for\n    more information about VPN status, including channel and tunnel error\n    messages. This list of VPN error messages includes suggested fixes for\n    the root cause of the error.</p>\n\n<p>\n    Channel Message:\n    <kbd>Policy does not allow OAKLEY_RSA_SIG authentication...</kbd>\n    <br>Tunnel Message:\n    <kbd> No acceptable Oakley Transform, sending notification...</kbd>\n    <br> <strong>Suggested Fix:</strong> Set the on-premises VPN\n    authentication mode to PSK.\n</p>\n<p>\n    Channel Message:\n    <kbd>peer is NATed...</kbd>\n    <br>Tunnel Message:\n    <kbd>peer is NATed...</kbd>\n    <br> <strong>Suggested Fix:</strong> Verify that the on-premises\n    firewall opens port 4500 for UDP traffic between the on-premises VPN\n    and the public IP of the SDDC VPN.\n<p>\n    Channel Message:\n    <kbd> sending notification NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> Tunnel Message:\n    <kbd> NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> <strong>Suggested Fix:</strong> Download the SDDC VPN\n    configuration and verify that the on-premises VPN has the same Phase 1\n    IPsec_configuration.\n</p>\n<p>\n    Channel Message: none<br> Tunnel Message:\n    <kbd> NO_PROPOSAL_CHOSEN msgid=00000000 ...</kbd>\n    <br> <strong>Suggested Fix:</strong> Download the SDDC VPN\n    configuration and verify that the on-premises VPN has the same Phase 2\n    IPsec_configuration.\n</p>\n<p>\n    Channel Message: none<br>Tunnel Message:\n    <kbd> cannot respond to IPsec SA request because no connection is\n        known for ...</kbd>\n    <br> <strong>Suggested Fix:</strong> Download the SDDC VPN\n    configuration and verify that the on-premises VPN is reachable at the\n    Local address shown under Local configuration addresses and the SDDC\n    VPN UI shows that address for <b>Remote Gateway IP</b>.\n</p>\n<p>\n    Channel Message:\n    <kbd>initiating Main Mode, STATE_MAIN_I1: initiate, deleting\n        state (STATE_MAIN_I1) ...</kbd>\n    <br>Tunnel Message:\n    <kbd>deleting state (STATE_MAIN_I1), STATE_MAIN_I1: initiate,\n        initiating Main Mode ...</kbd>\n    <br> <strong>Suggested Fix:</strong>Verify that the on-premises\n    management gateway firewall rules allow ICMP ping traffic to the SDDC\n    VPN.\n</p>\n<p>\n    Channel Message:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., we require peer to have ID '208.91.1.25', but peer declares\n        '10.146.97.30'...</kbd>\n    <br>Tunnel Message:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., deleting state (STATE_MAIN_R2), deleting state (STATE_QUICK_R2),\n        Main mode peer ID is ID_IPV4_ADDR: '10.146.97.30' ...</kbd>\n    <br> <strong>Suggested Fix:</strong> The value configured in the\n    SDDC IPsec VPN UI for <b>Remote Gateway Public IP</b> (208.91.1.25 in\n    this example) does not match the value that the on-premises VPN is\n    supplying for its identity (10.146.97.30 in this example). Edit the <b>Remote\n    Gateway Public IP</b> value in the SDDC IPsec VPN UI or update the\n    on-premises network to use a Local id that matches the <b>Remote\n    Gateway Public IP</b> value in the SDDC IPsec VPN UI.\n\n</p>\n<p>\n    Channel Message:\n    <kbd>received 1 malformed payload notifies, ...</kbd>\n    <br>Tunnel Message:\n    <kbd>sending notification PAYLOAD_MALFORMED to ..., probable\n        authentication failure (mismatch of preshared secrets?)...</kbd>\n    <br> <strong>Suggested Fix:</strong> Verify that pre-shared key\n    configured for the on-premises end of the VPN matches the Pre-shared\n    key configured in in the SDDC IPsec VPN UI.\n</p>\n\n<p>\n    For more information about troubleshooting VPN connection issues, see <a\n    href=\"https://docs.vmware.com/en/VMware-NSX-for-vSphere/6.4/com.vmware.nsx.troubleshooting.doc/GUID-3E4D0B69-B7E7-4C8B-BC78-A3FB3EE5E8BA.html\">Troubleshooting\n    Virtual Private Networks</a> in the NSX for vSphere documentation.\n</p>\n",
    "compute-l2-vpn-connection" : "<!--\ntitle: How do I set up an L2 VPN connection to the Compute Gateway?\ncontext: [networking,l2vpn]\n-->\n<p>\n    The Compute Gateway uses an L2 VPN to provide access to workload VMs running in your SDDC. Setting up an L2\n    VPN is part of the configuration of an extended network. An extended network has a single IP address space that\n    spans your on-premises and SDDC environments. This simplifies migration of workload VMs to and from your cloud SDDC.\n    To create an L2VPN in an SDDC with networking backed by VMware NSX for vSphere, follow these steps:\n<ol class=\"list\">\n    <li>\n        <a\n            href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-B447CF8B-8A5F-4189-8E12-078E0FD62320.html\"\n            target=\"_blank\"\n        >Configure the L2 VPN Server in your SDDC.</a> The Compute Gateway in your cloud SDDC acts as the L2 VPN server\n        and provides the SDDC side of the L2 VPN that backs an extended network. Use the VMC Console to configure the\n        server.\n    </li>\n    <li>\n        <a\n            href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-027ECB6F-78D7-4089-8E71-3FEE6F327D72.html\"\n            target=\"_blank\"\n        >Configure and enable your on-premises L2 VPN Client.</a> After the SDDC side of the L2 VPN is configured, the\n        system prompts you to configure the remote (on-premises NSX) side of the L2 VPN. You can use your existing\n        on-premises NSX for this, or you can download a standalone NSX appliance.\n    </li>\n    <li>\n        <a\n            href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-AFC96BF4-DBE4-4AFC-85E3-749C09289758.html\"\n            target=\"_blank\"\n        >Create an Extended Network in Your SDDC.</a> Specify the IDs of the tunnels you created in Step 1 and Step 2.\n        When the extended network has been configured, you can bring up the L2 VPN tunnel. To verify that the L2 VPN\n        tunnel is successfully connected, open the <b>L2 VPNs</b> row under <b>Compute Gateway</b> and refresh the\n        Status.\n    </li>\n</ol>\n</p>\n",
    "configure-IPFIX" : "<!--\ntitle: How do I configure IPFIX collector and session?\ncontext: [networking, tools, toolsipfix]\nfeature: enableNsxtDeployment\n-->\n<p>IPFIX (Internet Protocol Flow Information Export) is a standard for the format and export of network\n   flow information for troubleshooting, auditing, or collecting analytics information. You can configure flow\n   monitoring on a logical segment. All the flows from the VMs connected to that logical segment are captured\n   and sent to the IPFIX collector. The IPFIX collector can be in the on-premise data center on one of the\n   logical segment.</p>\n<p>\n   <strong>Prerequisite</strong>\n</p>\n<p>\n   Verify that a logical segment is configured. See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-267DEADB-BD01-46B7-82D5-B9AA210CA9EE.html\"\n   >Create or Modify a Network Segment</a> .\n</p>\n<ol class=\"list\">\n   <li>Click <strong>IPFIX &gt; COLLECTORS &gt; ADD NEW COLLECTOR</strong> and give the collector a <strong>Name</strong>.\n   </li>\n   <li>Enter the collector IP address and port. <br> The default UDP port is 4739. You can add up to\n      four IPFIX collectors.\n   </li>\n   <li>Click <strong>SAVE</strong>.\n   </li>\n   <li>Click <strong>SWITCH IPFIX PROFILES</strong> to create or edit a switch IPFIX profile. <br>\n      See <a\n      href=\"https://docs.vmware.com/en/VMware-NSX-T-Data-Center/2.5/administration/GUID-3458F2B3-089E-4BFC-8348-705172F2B802.html\"\n   >Configure Switch IPFIX Profiles </a> for more information about NSX-T switch IPFIX profile parameters.\n   </li>\n   <li>(Optional) Tag the profile.</li>\n   <li>Click�<strong>SAVE</strong> to create the profile.\n   </li>\n</ol>",
    "configure-nat" : "<!--\ntitle: How do I create or modify NAT rules?\ncontext: [networking, nat, nat_nsx]\nfeature: enableNsxtDeployment\n-->\n<p>Network Address Translation (NAT) maps internal IP addresses on your compute network to addresses\n   exposed on the public Internet. To create a NAT rule, you provide the internal address and port number of a\n   workload VM or service and a public IP address and port number that you have obtained from the system.</p>\n<p>NAT rules have to run on the SDDC's internet interface, since that's where workload VM public\n   addresses are exposed. Firewall rules, which examine packet sources and destinations, run on the Compute\n   Gateway, and process traffic after it has been transformed by any applicable NAT rules. When you create a\n   NAT rule, you can specify whether a VM's internal or external IP address and port number are exposed to\n   firewall rules that affect network traffic to and from that VM.</p>\n<ol class=\"list\">\n   <li>Click <strong>NAT &gt; ADD NAT RULE</strong> and give the rule a <strong>Name</strong>.\n   </li>\n   <li>Enter the NAT rule parameters. <br> See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_024\" target=\"_blank\"\n   >Create or Modify NAT Rules</a> for details about NAT rule parameters and operation.\n   </li>\n   <li>(Optional) Toggle <strong>Logging</strong> to log rule actions.\n   </li>\n   <li>The new rule is enabled by default. Toggle <strong>Enable</strong> to disable it.\n   </li>\n   <li>Click�<strong>SAVE</strong> to create the rule.\n   </li>\n</ol>",
    "configure-portmirroring" : "<!--\ntitle: How do I configure a port mirroring session?\ncontext: [networking, tools, toolsportmirroring]\nfeature: enableNsxtDeployment\n-->\n<p>Port mirroring lets you replicate and redirect all of the traffic coming from a source. The mirrored\n   traffic is sent encapsulated within a Generic Routing Encapsulation (GRE) tunnel to a collector so that all\n   of the original packet information is preserved while traversing the network to a remote destination.</p>\n<p>Port mirroring is used in the following scenarios:</p>\n<ul>\n   <li>Troubleshooting - Analyze the traffic to detect intrusion and debug and diagnose errors on a\n      network.</li>\n   <li>Compliance and monitoring - Forward all of the monitored traffic to a network appliance for\n      analysis and remediation.</li>\n</ul>\n<p>Port mirroring includes a source group where the data is monitored and a destination group where the\n   collected data is copied to. The source group membership criteria require VMs to be grouped based on the\n   workload such as web group or application group. The destination group membership criteria require VMs to\n   be grouped based on IP addresses.</p>\n<P>Port mirroring has one enforcement point, where you can apply policy rules to your SDDC environment.</p>\n<P>\n   <strong> Prerequisite </strong>\n</p>\n<p>Verify that workload groups with IP address and VM membership criteria are available.\n</li>\n<ol class=\"list\">\n   <li>Click <strong>Port Mirroring &gt; ADD PROFILE</strong> and give the profile a <strong>Name</strong>\n      and an optional <strong>Description</strong>.\n   </li>\n   <li>Specify profile parameters. <br> See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_028\" target=\"_blank\"\n   >Configure Port Mirroring</a> for details about port mirroring parameters.\n   </li>\n   <li>Click <strong>SAVE</strong> to create the session.\n   </li>\n   <li>(Optional) Click the ellipses button next to a port mirroring session and select <strong>Edit</strong>\n      to make configuration changes.\n   </li>\n</ol>",
    "configure-vcenter-fqdn" : "<!--\ntitle: How should I configure the vCenter Server FQDN?\ncontext: [networking,dns]\n-->\n<p>\n    You can connect to the SDDC vCenter Server at either a public or private IP address. \n    A private IP address can be resolved from an SDDC VPN. A public IP address can be \n    resolved from the Internet.\n</p>\n<p>For more information, \n    see <a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_015\">Set vCenter Server FQDN Resolution Address</a>.</p>\n",
    "connect-powercli" : "<!--\ntitle: How do I connect to my SDDC using PowerCLI?\ncontext: [settings]\n-->\n<p>\n    Before you can connect using PowerCLI, you must create a firewall rule to allow access to vCenter Server. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_013\"\n        target=\"_blank\"\n    >Add or Modify Management Gateway Firewall Rules</a>.\n</p>\n<ol class=\"list\">\n    <li>Launch PowerCLI on your client machine.</li>\n    <li>\n        On the <strong>Settings</strong> tab in the VMC Console, copy the command under <strong>PowerCLI\n            Connect</strong> by clicking the copy button.\n    </li>\n    <li>Paste the command in the PowerCLI window.</li>\n    <li>\n        Replace the <tt>&lt;password&gt;</tt> with the password shown under <strong>Default vCenter User\n            Account</strong>. If the password contains special characters, enclose it in single quotes.\n    </li>\n</ol>\n",
    "connect-vsphere-client" : "<!--\ntitle: How do I access the vSphere Client?\ncontext: [settings]\n-->\n<p>\n    Before you can access the vSphere Client, you must configure a VPN connection or firewall rule to permit access to\n    vCenter Server. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_013\"\n        target=\"_blank\"\n    >Add or Modify Management Gateway Firewall Rules</a>.\n</p>\n<p>\n    On the SDDC Details card, click <strong>OPEN VCENTER</strong> and use the Default vCenter Credentials to log in. To\n    see these credentials, click <strong>SHOW CREDENTIALS</strong> on the <strong>OPEN VCENTER</strong> dialog. You can\n    also find them under the <strong>Default vCenter User Account</strong> on the SDDC <strong>Settings</strong> tab.\n</p>\n",
    "cpu-running-out" : "<!--\ntitle: I'm running out of CPU. What can I do?\ncontext: [summary]\n-->\n<p>\n    If you have the ability to add hosts, and your SDDC isn't at its maximum number of hosts, you can add a host\n    to increase the available CPU capacity. Otherwise, shut down workloads or migrate them off of your SDDC.\n</p>",
    "create-distributed-firewall-rule" : "<!--\ntitle: How do I set distributed firewall rules?\ncontext: [networking, distributedfirewall]\nfeature: enableNsxtDeployment\n-->\n<p>\n   Distributed firewall rules apply at the VM level and control East-West traffic within the SDDC. All traffic\n   attempting to pass through the distributed firewall is subjected to the rules in the order shown in the\n   rules table, beginning at the top. A packet allowed by the first rule is passed on to the second rule, and\n   so on through subsequent rules until the packet is dropped, rejected, or hits the default rule, which\n   allows all traffic. Distributed firewall rules are grouped into policies. Policies are organized by\n   category. Categories are just grouping conveniences and have no operational properties. See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_017\" target=\"_blank\"\n   >Add or Modify Distributed Firewall Rules</a> for more information about distributed firewall rule categories.\n</p>\n<ol class=\"list\">\n   <li>Click <strong>Networking &amp; Security &gt; Distributed Firewall</strong>.<br>Click <strong>CATEGORY\n         SPECIFIC RULES</strong> and select a category to view and modify policies and rules in that category, or click\n      <strong>ALL RULES</strong> to view (but not modify) rules in all policies and categories.\n   </li>\n   <li>(Optional) Change the default connectivity strategy.<br>By default, the Distributed Firewall\n      includes an implicit Allow rule for all traffic. This rule, which does not appear in any list of rules,\n      is evaluated after all other rules, and allows traffic that doesn't match a preceding rule to pass\n      through the firewall. Click the connectivity strategy icon to see a list of available strategies. To\n      change the current strategy, select a different one and click <strong>SAVE</strong>.\n   </li>\n   <li>To add a policy at the top of the list, click <strong>ADD POLICY</strong> and give the new policy\n      a <strong>Name</strong>.<br> To add a policy before or after an existing policy, click the vertical\n      ellipsis button at the beginning of the policy row to open the policy settings menu, then click <strong>Add\n         Policy Above</strong> or <strong>Add Policy Below</strong>. By default a new policy applies to the distributed\n      firewall (DFW), but you can specify one or more inventory groups for it to apply to instead. The\n      policy's <strong>APPLIED TO</strong> value is propagated to all the rules in the policy.\n   </li>\n   <li>To add a rule, select a policy, click <strong>ADD NEW RULE</strong>, and give the rule a <strong>Name</strong>.\n   </li>\n   <li>Enter the parameters for the new rule.<br> Parameters are initialized to their default values\n      (for example, <strong>All</strong> for <strong>Sources</strong> and <strong>Destinations</strong>). To\n      edit a parameter, move the mouse cursor over the parameter value and click the pencil icon to open a\n      parameter-specific editor. See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_017\" target=\"_blank\"\n   >Add or Modify Distributed Firewall Rules</a> for more information about distributed firewall rule parameters.\n   </li>\n   <li>Click PUBLISH to create the rule.</li> \n</ol>",
    "create-edge-compute-firewall" : "<!--\ntitle: How do I create an NSX Edge compute gateway firewall rule?\ncontext: [networking, security]\nfeature: enableNsxtDeployment\n-->\n<p>By default, the Compute Gateway blocks traffic to all uplinks. Add Compute Gateway firewall rules to\n   allow traffic as needed.</p>\n<p>\n   Compute Gateway firewall rules specify actions to take on network traffic from a specified source to a\n   specified destination. Actions can be either allow (allow the traffic) or drop (drop all packets matching\n   the specified source and destination). Sources and destinations can be chosen from a list of a physical\n   network interfaces, or a generic specification of <strong>All Uplinks</strong> that refers to all traffic\n   leaving the gateway and going to the VPC interface, Internet Interface, or Direct Connect interface. A\n   firewall rule applied to <strong>All Uplinks</strong> does not apply to the <strong>VPN Tunnel\n      Interface</strong> (VTI), which is a virtual interface and not a physical uplink. The <strong>VPN Tunnel\n      Interface</strong> must be specified explicitly in the <strong>Applied To</strong> parameter of any firewall rule\n   that manages workload VM communications over a route-based VPN. The Compute Gateway includes a <strong>Default\n      VTI Rule</strong> that drops all traffic to the VTI. To enable workload VMs to communicate over the VTI, modify\n   this rule or move it to a lower rank in the rule hierarchy, after more permissive rules.\n</p>\n<p>All traffic attempting to pass through the firewall is subjected to the rules in the order shown in the\n   rules table, beginning at the top. A packet allowed by the first rule is passed on to the second rule, and\n   so on through subsequent rules until the packet is dropped, rejected, or hits the default rule, which\n   allows all traffic.</p>\n<ol class=\"list\">\n   <li>click <strong>Gateway Firewall</strong> to open the <strong>GATEWAY FIREWALL</strong> page.\n   </li>\n   <li>On the <strong>GATEWAY FIREWALL</strong> page, click <strong>Compute Gateway</strong>.\n   </li>\n   <li>To add a rule, click <strong>ADD RULE</strong> and give the new rule a <strong>Name</strong>.\n   </li>\n   <li>Enter the parameters for the new rule.<br>Parameters are initialized to their default values\n      (for example, <strong>Any</strong> for <strong>Sources</strong> and <strong>Destinations</strong>). To\n      edit a parameter, move the mouse cursor over the parameter value and click the pencil icon to open a\n      parameter-specific editor. See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_020\" target=\"_blank\"\n   >Add or Modify Compute Gateway Firewall Rules</a> for more information about compute gateway firewall rule\n      parameters.\n   </li>\n   <li>Click <strong>PUBLISH</strong> to create the rule.\n   </li>\n</ol>\n<p>\n   See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_020\" target=\"_blank\"\n   >Add or Modify Compute Gateway Firewall Rules</a> for more information about editing rule logging settings and\n   viewing rule statistics.\n</p>",
    "create-edge-management-firewall" : "<!--\ntitle: How do I create NSX Edge management gateway firewall rules?\ncontext: [networking, security]\nfeature: enableNsxtDeployment\n-->\n<p>By default, the management gateway blocks traffic to all destinations from all sources. Add Management\n   Gateway firewall rules to allow traffic as needed.</p>\n<ol class=\"list\">\n   <li>Click <strong>Gateway Firewall</strong> to open the <strong>GATEWAY FIREWALL</strong> page.\n   </li>\n   <li>On the <strong>GATEWAY FIREWALL</strong> page, click <strong>Management Gateway</strong>.\n   </li>\n   <li>To add a rule, click <strong>ADD RULE</strong> and give the new rule a <strong>Name</strong>.\n   </li>\n   <li>Enter the parameters for the new rule.<br> Parameters are initialized to their default values\n      (for example, <strong>Any</strong> for <strong>Sources</strong> and <strong>Destinations</strong>). To\n      edit a parameter, move the mouse cursor over the parameter value and click the pencil icon to open a\n      parameter-specific editor. See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_013\" target=\"_blank\"\n   >Add or Modify Management Gateway Firewall Rules</a> for more information about compute gateway firewall rule\n      parameters.\n   </li>\n   <li>Click <strong>PUBLISH</strong> to create the rule.<br>Firewall rules are applied in order\n      from top to bottom. Because there is a default Drop rule at the bottom and the rules above are always\n      Allow rules, management gateway firewall rule order has no impact on traffic flow.\n   </li>\n</ol>\n<p>\n   See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_013\" target=\"_blank\"\n   >Add or Modify Management Gateway Firewall Rules</a> for an example and more information about editing rule\n   logging settings and viewing rule statistics.\n</p>",
    "create-l2vpn" : "<!--\ntitle: How do I create a Layer 2 VPN?\ncontext: [networking, vpn, layer2]\nfeature: enableNsxtDeployment\n-->\n<p>A VMware Cloud on AWS extended network uses a Layer 2 Virtual Private Network (L2VPN) to extend an\n   on-premises network to multiple VLAN based networks that can be extended with different tunnel IDs on the\n   same L2VPN tunnel. This extended network is a single subnet with a single broadcast domain, so you can\n   migrate VMs to and from your cloud SDDC without having to change their IP addresses.</p>\n<ol class=\"list\">\n   <li>\n      Click <strong>VPN &gt; Layer 2</strong>.\n   </li>\n   <li>\n      Click <strong>ADD VPN TUNNEL</strong>.\n   </li>\n   <li>\n      Configure the VPN tunnel parameters.\n      <br>\n      See <a\n         href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_027\" target=\"_blank\"\n      >Configure a Layer 2 VPN Tunnel in the SDDC</a> for more information about tunnel parameters.\n   </li>\n   <li>(Optional) Tag the tunnel.</li>\n   <li>\n      Click <strong>SAVE</strong> to create the tunnel.\n      <br>\n      Tunnel creation might take a few minutes. When the tunnel becomes available, its status changes to Up.\n   </li>\n</ol>\n<p>\n   After the tunnel is up, you'll need to create a network segment bound to the tunnel ID of the new tunnel.\n   See <a\n      href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_006\" target=\"_blank\"\n   >Configure Layer 2 VPN Extended Segment </a> for more information about creating the segment and setting up\n   the on-premises side of the VPN.\n</p>",
    "create-logical-segment" : "<!--\ntitle: How do I create a logical network segment?\ncontext: [networking, network, segment]\nfeature: enableNsxtDeployment\n-->\n<p>VMware Cloud on AWS supports three types of logical network segments:</p>\n<li>A routed network segment (the default type) has connectivity to other logical networks in the SDDC\n   and, through the SDDC firewall, to external networks. A Single Host Starter SDDC is created with a single\n   routed network segment named sddc-cgw-network-1.</li>\n<li>An extended network segment extends an existing L2VPN tunnel, providing a single IP address space\n   that spans the SDDC and an on-premises network.</li>\n<li>A disconnected network segment has no uplink, and provides an isolated network accessible only to VMs\n   connected to it.</li>\n<ol class=\"list\">\n   <li>\n      To create a segment, click <strong>Segments &gt; ADD SEGMENT</strong> and give the new segment a <strong>Name</strong>.\n      <br>\n      To modify the configuration of an existing segment, click the ellipsis button an select <strong>Edit</strong>.\n   </li>\n   <li>\n      Specify a segment <strong>Type</strong> and fill in the required configuration parameters.\n      <br>\n      Parameter requirements depend on the segment type. See <a\n         href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_001\" target=\"_blank\"\n      >Create or Modify a Network Segment</a> for more information about segment configuration parameters.\n   <li>\n      Click <strong>SAVE</strong> to create or update the segment.\n      <br>\n      This operation can take up to 15 seconds to complete. When the segment <strong>Status</strong> changes\n      to <strong>Up</strong> the segment is ready for use. If the segment <strong>Status</strong> is <strong>Down</strong>,\n      you can click the information icon to see status details.\n   </li> \n</ol>",
    "create-policy-based-vpn" : "<!--\ntitle: How do I create a policy-based VPN?\ncontext: [networking, vpn, policy-based]\nfeature: enableNsxtDeployment\n-->\n<p>A policy-based VPN creates an IPsec tunnel and a policy that specifies how traffic uses it. When you\n   use a policy-based VPN, you must update the routing tables on both ends of the network when new routes are\n   added.</p>\n<p>Policy-based VPNs in your VMware Cloud on AWS SDDC use an IPsec protocol to secure traffic. To create a\n   policy-based VPN, you configure the local (SDDC) endpoint, then configure a matching remote (on-premises)\n   endpoint. Because each policy-based VPN must create a new IPsec security association for each network, an\n   administrator must update routing information on premises and in the SDDC whenever a new policy-based VPN\n   is created. A policy-based VPN can be an appropriate choice when you have only a few networks on either end\n   of the VPN, or if your on-premises network hardware does not support BGP (which is required for route-based\n   VPNs).</p>\n<ol class=\"list\">\n   <li>\n      Click <strong>VPN &gt; Policy Based</strong>.\n   </li>\n   <li>Click ADD VPN and give the new VPN a Name.</li>\n   <li>\n      Select a <strong>Local IP Address</strong> from the drop-down menu.\n      <br>\n      If you have configured AWS Direct Connect for this SDDC and want the VPN to use it, select the private\n      IP address. Note that VPN traffic over Direct Connect is limited to the default MTU of 1500 bytes even\n      if the link supports a higher MTU. Specify a public IP address if you want the VPN to connect over the\n      Internet.\n   </li>\n   <li>\n      For <strong>Remote Public IP</strong>, enter the address of your on-premises VPN endpoint.\n      <br>\n      See <a\n         href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_029\" target=\"_blank\"\n      >Create a Policy-Based VPN</a> for important constraints on the remote and local IP values.\n   </li>\n   <li>\n      (Optional) If your on-premises gateway is behind a NAT device, enter the gateway address as the <strong>Remote\n         Private IP</strong>.\n      <br>\n      This IP address must match the local identity (IKE ID) sent by the on-premises VPN gateway. If this\n      field is empty, the <strong>Remote Public IP</strong> field is used to match the local identity of the\n      on-premises VPN gateway.\n   </li>\n   <li>\n      Specify the <strong>Remote Networks</strong> that this VPN can connect to.\n      <br>\n      This list must include all networks defined as local by the on-premises VPN gateway. ​Enter each network\n      in CIDR format. Separate multiple CIDR blocks with commas.\n   </li>\n   <li>\n      Specify the <strong>Local Networks</strong> that this VPN can connect to.<br>\n      This list includes all routed compute networks in the SDDC, as well as the entire Management network and\n      the appliance subnet (a subset of the Management network that includes vCenter and other management\n      appliances, but not the ESXi hosts). It also includes the CGW DNS Network, a single IP address used to\n      source requests forwarded by the CGW DNS service.\n   </li>\n   <li>\n      Configure <strong>Advanced Tunnel Parameters</strong>.\n      <br>\n      See <a\n         href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_029\" target=\"_blank\"\n      >Create a Policy-Based VPN </a> for suggested parameter values.\n   </li>\n   <li>(Optional) Tag the VPN.</li>\n   <li>\n      Click <strong>SAVE</strong>.\n   </li>\n</ol>\n<p>The VPN creation process might take a few minutes. When the policy-based VPN becomes available, the\n   tunnel status and BGP session state are displayed. The following actions are available to help you with\n   troubleshooting and configuring the on-premises end of the VPN:</p>\n<ul>\n   <li>\n      Click <strong>DOWNLOAD CONFIG</strong> to download a file that contains VPN configuration details. You\n      can use these details to configure the on-premises end of this VPN.\n   </li>\n   <li>\n      Click <strong>VIEW STATISTICS</strong> to view packet traffic statistics for this VPN. See <a\n         href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_026\" target=\"_blank\"\n      >View VPN Tunnel Status and Statistics </a>.\n   </li>\n</ul>",
    "create-public-vif" : "<!--\ntitle: How do I create a public virtual interface?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    A public virtual interface (VIF) allows your SDDC to access AWS services that are external to your VPC, such as S3,\n    over AWS Direct Connect. A public VIF uses a public IP address space and provides a private dedicated connection to\n    the AWS network backbone, terminating in a specific AWS region. To create a public virtual interface in an SDDC, see <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_016\"\n        target=\"_blank\"\n    >Create a Public Virtual Interface for Access to AWS Services</a>.\n</p>\n",
    "create-route-based-vpn" : "<!--\ntitle: How do I create a route-based VPN?\ncontext: [networking, vpn, route-based]\nfeature: enableNsxtDeployment\n-->\n<p>A route-based VPN creates an IPsec tunnel interface and routes traffic through it as dictated by the\n   SDDC routing table. VMware Cloud on AWS uses the same public IP for all VPN connections, so only a single\n   VPN connection (Route-based, Policy-based, or L2VPN) can be created to a given remote public IP. Route\n   based VPNs in your VMware Cloud on AWS SDDC use an IPsec protocol to secure traffic and the Border Gateway\n   Protocol (BGP) to discover and propagate routes as new networks are created. To create a route-based VPN,\n   you configure BGP information for the local (SDDC) and remote (on-premises) endpoints, then specify tunnel\n   security parameters for the SDDC end of the tunnel.</p>\n<ol class=\"list\">\n   <li>\n      Click <strong>VPN &gt; Route Based</strong>.\n   </li>\n   <li>\n      (Optional) Change the default local Autonomous System Number (ASN).\n      <br>All route-based VPNs in the SDDC default to ASN 65000. If the remote ASN for any configured VPN\n      connection also has this value, click <strong>EDIT LOCAL ASN</strong>, enter a new value in the range\n      64521 to 65535, and click <strong>APPLY</strong>.\n   </li>\n   <li>\n      Select a <strong>Local IP Address</strong> from the drop-down menu.\n      <br>\n      If you have configured AWS Direct Connect for this SDDC and want the VPN to use it, select the private\n      IP address. Note that VPN traffic over Direct Connect is limited to the default MTU of 1500 bytes even\n      if the link supports a higher MTU. Select the public IP address if you want the VPN to connect over\n      Internet.\n   </li>\n   <li>\n      For <strong>Remote Public IP</strong>, enter the address of your on-premises VPN endpoint.\n      <br>\n      See <a\n         href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_030\" target=\"_blank\"\n      >Create a Route-Based VPN </a> for important constraints on the remote and local IP values.\n   </li>\n   <li>\n      For <strong>BGP Local IP/Prefix Length</strong>, enter the IP address, in CIDR format, of the local VPN\n      tunnel.\n   </li>\n   <li>\n      For <strong>BGP Remote IP</strong>, enter the BGP interface address of your on-premises VPN gateway.\n   </li>\n   <li>\n      For <strong>BGP Remote ASN</strong>, enter the ASN of your on-premises VPN gateway.\n   </li>\n   <li>\n      Configure <strong>Advanced Tunnel Parameters</strong>.\n      <br>\n      See <a\n         href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_030\" target=\"_blank\"\n      >Create a Route-Based VPN </a> for suggested parameter values.\n   </li>\n   <li>\n      (Optional) Under <strong>Advanced BGP Parameters</strong>, enter a BGP <strong>Secret</strong> that\n      matches the one used by the on-premises gateway.\n   </li>\n   <li>(Optional) Tag the VPN.</li>\n   <li>\n      Click <strong>SAVE</strong>.\n   </li>\n</ol>\n<p>The VPN creation process might take a few minutes. When the route-based VPN becomes available, the\n   tunnel status and BGP session state are displayed. The following actions are available to help you with\n   troubleshooting and configuring the on-premises end of the VPN:</p>\n<ul>\n   <li>\n      Click <strong>DOWNLOAD CONFIG</strong> to download a file that contains VPN configuration details. You\n      can use these details to configure the on-premises end of this VPN.\n   </li>\n   <li>\n      Click <strong>VIEW STATISTICS</strong> to view packet traffic statistics for this VPN. See <a\n         href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_026\" target=\"_blank\"\n      >View VPN Tunnel Status and Statistics </a>.\n   </li>\n   <li>\n      Click <strong>VIEW ROUTES</strong> to open a display of routes advertised and learned by this VPN.\n   </li>\n   <li>\n      Click <strong>DOWNLOAD ROUTES</strong> to download a list of <strong>Advertised Routes</strong> or <strong>Learned\n         Routes</strong> in CSV format.\n   </li>\n</ul>",
    "create-sddc" : "<!--\ntitle: How do I create a new SDDC?\ncontext: [dashboard,create-sddc]\n-->\n<p>To create an SDDC, pick an AWS region to host it, give the SDDC a name, and specify how many ESXi hosts you want\n    the SDDC to contain. If you don't already have an AWS account, you can still create a starter configuration SDDC\n    that contains a single ESXi host. There is a one-to-one relationship between SDDCs and customer AWS accounts. You\n    can connect an SDDC to a single customer AWS account and Amazon VPC.</p>\n<p>\n    From the Dashboard, click <b>Create SDDC</b> to launch the <strong>Create Software-Defined Data Center\n        (SDDC)</strong> wizard. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_008\"\n        target=\"_blank\"\n    >Deploy an SDDC from the VMC console</a> for more information about this process. The status of the SDDC deployment is\n    displayed on the Dashboard.\n</p>\n",
    "delete-sddc" : "<!--\ntitle: How do I delete an SDDC?\ncontext: [dashboard]\n-->\n<p>\n    On the Dashboard, locate the card for the SDDC and click <strong>ACTIONS</strong> &gt; <strong>Delete SDDC</strong>.\n    Confirm that you understand the consequences of this action, which cannot be undone, then click <strong>DELETE\n        SDDC</strong>.\n</p>\n",
    "e1cba85551988a87c1139e690d5997ad" : "<!--\ntitle: How do I configure NAT?\ncontext: [networking,nat]\n-->\n<p>Outbound Network Address Translation (NAT) is configured by default for the compute gateway. You can configure inbound NAT. </p>\n<ol class=\"list\">\n    <li>On the Network tab of your SDDC, click <b>NAT</b>.</li>\n    <li>Enter the NAT parameters:\n        <ul class=\"list\">\n            <li><b>Description:</b> Enter a description for the NAT rule.</li>\n            <li><b>Public IP:</b> Select the public IP address. For more information on how to provision a public IP address, search the help.</li>\n            <li><b>Service:</b>Select one of the following:\n                <ul class=\"list\">\n                    <li><b>Any:</b> The rule applies to all traffic.</li>\n                    <li>A specific service: The rule applies to traffic from the selected service and port.</li>\n                    <li><b>ICMP (All)</b>: The rule applies to ICMP traffic, such as ping packets.</li>\n                    <li><b>Custom TCP</b> or <b>Custom UDP</b>: To define a custom service and port to apply the rule to.</li>\n                </ul>\n            </li>\n            \n            <li><b>Public Ports:</b> If you selected a custom TCP or UDP service, enter the port or port range to route from.</li>\n            <li><b>Internal IP:</b> Enter the internal IP address or block of IP addresses the public IP address should be routed to. </li>\n             <li><b>Internal Ports:</b> If you selected a custom TCP or UDP service, enter the port or port range to route to.</li>\n        </ul>\n    </li>\n</ol>\n",
    "e87aff2a3ca94aca6476294af0962f5a" : "<!--\ntitle: What can I do on the Connection Info page?\ncontext: [connection-info]\n-->\n<p>On the Connection Info page, you can find hyperlinks for accessing the vSphere Client and vCenter Server for your SDDC. You can also see the initial password generated for the cloudadmin@vmc.local account, which you can use to authenticate to the vCenter Server. </p>\n<p>If you change the password for the cloudadmin@vmc.local account, the password is not updated on this page. </p>",
    "ef1277c930de7bd02f7937fb7b49d446" : "<!--\ntitle: I'm running out of Memory. What can I do?\ncontext: [summary]\n-->\n<p>If you have the ability to add hosts, and your SDDC isn't at its maximum number of hosts, you can add a host to increase the available memory capacity. Otherwise, shut down workloads or migrate them off of your SDDC.</p>",
    "ef936d7192ea7455d6def600da0c3062" : "<!--\ntitle: What roles can I assign to a new user?\ncontext: [dashboard, invite]\n-->\n\n<p>When you invite new users, you can assign them the following roles:</p>\n<ul class=\"list\">\n    <li>Organization Owner: Only Organization Owners can invite other users to the account.</li>\n    <li>Organization Member: Organization Members can create, manage, and access cloud data centers belonging to the Organization, but cannot invite new users.</li>\n</ul>\n",
    "f162582a2057d3497784dd2a7579ba69" : "<!--\ntitle: How many hosts can I have in my SDDC?\ncontext: [create-sddc]\n-->\n<p>Currently, you can deploy an SDDC with a minimum of 4 hosts and a maximum of 16.</p>\n",
    "f1744e41db8ba4a4ec281f5c63a3df29" : "<!--\ntitle: How do I set up compute gateway firewall rules?\ncontext: [networking,firewall]\n-->\n<p>The default firewall rules for the Management Gateway and Compute Gateway block all inbound and outbound traffic. Before you can use these gateways, you must add firewall rules that allow traffic as needed.</p>\n<ol class=\"list\">\n    <li>Go to the <b>Network</b> tab for the SDDC.</li>\n    <li>To create a predefined set of firewall rules for the Management Gateway, expand <b>Firewall Rule Accelerator</b> under <b>Management Gateway</b> and click \n    <b>CREATE FIREWALL RULES</b> to create rules in the selected <b>Rule Group</b> and <b>VPN</b>.\n    </li>\n    <li>To create firewall rules manually or edit rules created by the Firewall Rule Accelerator, expand <b>Firewall Rules</b> under <b>Management Gateway</b> or <b>Compute Gateway</b>.</li>\n    <li>Click <b>Add Rule</b>.</li>\n    <li>Enter the rule parameters:\n        <ul class=\"list\">\n            <li><b>Rule Name:</b> Enter a name for the rule.</li>\n            <li><b>Action:</b> Select <b>Allow</b> or <b>Deny</b>.</li>\n            <li><b>Source:</b> Enter or select one of the following.\n                <ul class=\"list\">\n                <li>Select <b>All Internet and VPN</b> to apply the rule to all traffic from the Internet and VPN.</li>\n                <li>Select <b>All Connected Amazon VPC</b> to apply the rule to all traffic from the connected Amazon VPC.</li>    \n                <li>Enter <b>Any</b> to apply the rule to traffic from all sources.</li>\n                <li>Enter one or more IP addresses or IP address ranges, separated by commas to apply the rule to traffic from those specific IP addresses. </li>    \n                </ul>\n            </li>\n            <li><b>Destination:</b> </b> Enter or select one of the following.\n                <ul class=\"list\">\n                <li>Select <b>All Internet and VPN</b> to apply the rule to all traffic to the Internet and VPN.</li>\n                <li>Select <b>All Connected Amazon VPC</b> to apply the rule to all traffic to the connected Amazon VPC.</li>    \n                <li>Enter <b>Any</b> to apply the rule to traffic to all sources.</li>\n                <li>Enter one or more IP addresses or IP address ranges, separated by commas to apply the rule to traffic to those specific IP addresses. </li>    \n                </ul></li>\n            <li><b>Service:</b>Select one of the following:\n                <ul class=\"list\">\n                    <li><b>Any (All Traffic):</b> The rule applies to all traffic.</li>\n                    <li>A specific service: The rule applies to traffic from the selected service and port.</li>\n                    <li><b>ICMP (All ICMP)</b>: The rule applies to all ICMP traffic</li>\n                    <li><b>Custom TCP</b> or <b>Custom UDP</b>: To define a custom service and port to apply the rule to.</li>\n                </ul>\n            </li>\n            <li><b>Ports:</b> If you selected a custom TCP or UDP service, enter the port number.</li>\n        </ul>\n    </li>\n</ol>\n<p>Firewall rules are applied in order from top to bottom. Use the up and down arrow icons to move firewall rules</p>\n",
    "f44b2dc3154413e99b0427e8f9cd4d72" : "<!--\ntitle: I'm running out of CPU. What can I do?\ncontext: [summary]\n-->\n<p>If you have the ability to add hosts, and your SDDC isn't at its maximum number of hosts, you can add a host to increase the available CPU capacity. Otherwise, shut down workloads or migrate them off of your SDDC.</p>",
    "fe666a0d29b8c867ff39f4b94392a748" : "<!--\ntitle: What are the management and compute gateways?\ncontext: [networking]\n-->\n<p>When you deploy an SDDC using VMware Cloud on AWS, it is configured with two networks: a management network and a compute network. </p>\n<p>The management network handles network traffic for the SDDC hosts, vCenter Server, NSX Manager, and other management functions.</p>\n<p>The compute network handles network traffic for your workload VMs.</p>\n",
    "firewall-rules" : "<!--\ntitle: What firewall rules do I need for Site Recovery?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n<p>You must create the following management gateway firewall rules to allow management and replication traffic\n    required by the VMware Site Recovery service.</p>\n<p>To enable management and API access:</p>\n<ol class=\"list\">\n    <li>Allow inbound service HTTPS (TCP 443) to vCenter</li>\n    <li>Allow inbound service SRM Server Management (TCP 9086) to Site Recovery Manager</li>\n    <li>Allow inbound service VR Server Management (TCP 8043) to vSphere Replication</li>\n    <li>Allow outbound service Any (All Traffic) from vCenter, Site Recovery Manager, and vSphere Replication</li>\n</ol>\n<p>To enable replication traffic:</p>\n<ol class=\"list\">\n    <li>Allow inbound service VM Replication (TCP 31031, 44046) to vSphere Replication</li>\n    <li>Allow outbound service Any (All Traffic) from ESXi Management Only</li>\n</ol>\n<p>To enable access to the Site Recovery console</p>\n<ol class=\"list\">\n    <li>Allow inbound HTTPS (TCP 443) to vSphere Replication</li>\n</ol>\n",
    "hcx" : "<!--\ntitle: What is the HCX Add-on?\ncontext: [hcx,addons]\n-->\n<p>\n    VMware HCX abstracts on-premises and cloud resources and presents them to workloads as a\n    hybrid cloud. This allows workload mobility between your on-premises data center and cloud SDDC. HCX is included as\n    part of your VMC on AWS service. For additional information on installing and configuring HCX, see the <a\n        href=\"https://docs.vmware.com/en/VMware-HCX/index.html\" target=\"_blank\"\n    >VMware HCX Documentation</a> and the <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_011\"\n        target=\"_blank\"\n    >Hybrid Migration with HCX Checklist</a>.\n</p>\n",
    "how-dns" : "<!--\ntitle: How do I configure DNS?\ncontext: [networking,dns]\n-->\n<p>\n    You have to specify a DNS server on the management and compute gateways to allow hosts and VMs to resolve\n    fully-qualified domain names (FQDNs) to IP addresses on the management and compute networks. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-12DA448A-9CFC-49CD-B765-3CB8A0B91BAB.html\"\n        target=\"_blank\"\n    >Set Management Gateway DNS </a> and <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-09E0A733-E621-4A53-9061-A409860F5011.html\"\n        target=\"_blank\"\n    >Set Compute Gateway DNS </a>.\n</p>\n<p>\n    DNS must be configured separately for the management and compute gateways.\n</p>\n",
    "how-invite-user" : "<!--\ntitle: How do I invite another user?\ncontext: [dashboard]\n-->\n<p>\n    The organization owner can invite users to join the organization. Follow the steps in <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_009\"\n        target=\"_blank\"\n    >Invite a New User</a>.",
    "how-remove-user" : "<!--\ntitle: How do I remove another user?\ncontext: [dashboard]\n-->\n<p>To remove a user from an organization, you need to be an Organization Owner.</p>\n<ol class=\"list\">\n    <li>\n        From the VMC Console dashboard, click the services icon at the top right of the window, and select <strong>Identity\n            and Access Management</strong>.\n    </li>\n    <li>Select the user or users you want to remove.</li>\n    <li>\n        Click <strong>Remove Users</strong>.\n    </li>\n    <li>\n        Click <strong>Remove</strong> to confirm the removal.\n    </li>\n</ol>\n<p>The user is removed from the organization and will no longer be able to access the organization's resources.</p>",
    "how-set-default-org" : "<!--\ntitle: How do I set my default organization?\ncontext: [dashboard]\n-->\n<p>If you are a member of more than one organization, you can set a default organization. This organization will be\n    the one displayed when you log in.</p>\n<ol class=\"list\">\n    <li>From the VMC Console dashboard, click your username and organization in the tool bar.</li>\n    <li>\n        Click <strong>Set Default Organization</strong> and select the organization you want as the default.\n    </li>\n</ol>",
    "how-switch-language" : "<!--\ntitle: How do I change the language used by the VMC Console?\ncontext: [dashboard]\nfeature: uiEnableLocalization\n-->\n<p>To change the language displayed by VMware Cloud on AWS or any other VMware cloud service, set the language\n    preference for your account.</p>\n<ol class=\"list\">\n    <li>\n        From the VMware Cloud Services console, click your username and organization in the tool bar and select <strong>My\n            Account</strong>.\n    </li>\n    <li>\n        Click <strong>Preferences</strong>.\n    </li>\n    <li>\n        Edit the <strong>Language</strong> and <strong>Regional Format</strong> settings.\n    </li>\n</ol>",
    "invite-no-myvmware" : "<!--\ntitle: Can I invite a user who does not have a MyVMware account?\ncontext: [dashboard, invite]\n-->\n\n<p>Yes. The user will be prompted to create a MyVMware account during the sign up process.</p>",
    "ipsec-vpn-connection" : "<!--\ntitle: How do I set up an IPsec VPN connection to the Management Gateway?\ncontext: [networking,vpn]\n-->\n<p>\n    The Management Gateway provides access to the SDDC management infrastructure, including vCenter Server, NSX and ESXi\n    hosts. An IPsec VPN provides Management Network connectivity between the Management Gateway and a network in your\n    SDDC. To create an IPsec VPN connection, follow the steps in <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-3A7090C5-836C-4DBA-9E69-A4A1D9B6F139.html\"\n        target=\"_blank\"\n    >Use the Configure MGW VPN Wizard to Configure a Management VPN and Gateway</a>.\n</li>\n",
    "log-intelligence" : "<!--\ntitle: What is the VMware vRealize Log Insight Cloud Add-on?\ncontext: [log-intelligence,addons]\nfeature: uiEnableLintAddon\n-->\n<p>\n    VMware vRealize Log Insight Cloud enables you to collect and analyze logs generated in your SDDC. A trial version of\n    the service is enabled by default in a new SDDC. A thirty-day trial period begins when a user in your organization\n    accesses the service. After the trial period, you can choose to subscribe to this service or continue to use a\n    subset of service features at no additional cost. For more information about using VMware vRealize Log Insight\n    Cloud, see the <a\n        href=\"https://docs.vmware.com/en/VMware-Log-Intelligence/index.html\"\n        target=\"_blank\"\n    >vRealize Log Insight Cloud Documentation</a>.\n</p>\n",
    "logical-network" : "<!--\ntitle: How do I create a logical network?\ncontext: [networking,logical-network]\n-->\n<p>\n    Logical networks provide network access to workload VMs. Your SDDC starts with a single default logical network,\n    sddc-cgw-network-1. You can use the HTML5 vSphere Client to create additional logical networks. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_017\"\n        target=\"_blank\"\n    >Create or Modify a Network Segment</a>.",
    "manage-vcenter-access" : "<!--\ntitle: How do I manage access to vCenter Server?\ncontext: [networking,firewall,vpn]\n-->\n<p>\n    By default, there is no external access to the vCenter Server system in your SDDC. Open access to your\n    vCenter Server system by:\n</p>\n<ul class=\"list\">\n    <li>Configuring a firewall rule to allow access to the vCenter Server system.</li>\n    <li>Configuring an IPsec VPN between your on-premises data center and your SDDC.</li>\n</ul>\n<p>\n    When you have configured one of these options, click the <b>Settings</b> tab to see how to connect to vCenter\n    Server using the vSphere Client and PowerCLI.\n</p>\n",
    "management-compute-gateways" : "<!--\r\ntitle: What are the management and compute gateways?\r\ncontext: [networking]\r\n-->\r\n<p>\r\n    When you deploy an SDDC using VMware Cloud on AWS, it is configured with two networks: a management network\r\n    and a compute network. The management network handles network traffic for the SDDC hosts, vCenter Server, NSX\r\n    Manager, and other management functions. The compute network handles network traffic for your workload VMs.\r\n</p>\r\n",
    "memory-running-out" : "<!--\ntitle: I'm running out of Memory. What can I do?\ncontext: [summary]\n-->\n<p>\n    If you have the ability to add hosts, and your SDDC isn't at its maximum number of hosts, you can add a host\n    to increase the available memory capacity. Otherwise, shut down workloads or migrate them off of your SDDC.\n</p>",
    "nat" : "<!--\ntitle: How do I configure NAT?\ncontext: [networking,nat]\n-->\n<p>\n    Outbound Network Address Translation (NAT) is configured by default for the compute gateway. Inbound NAT allows you\n    to map Internet traffic to a public-facing IP address and port to a private IP address and port inside your SDDC's\n    compute network. To configure inbound NAT, see <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0C04B8A4-A880-4A8E-85A5-4720D3A30235.html\"\n        target=\"_blank\"\n    >Configure NAT Settings </a>.\n</p>\n",
    "preshared-key" : "<!--\r\ntitle: What is the pre-shared key?\r\ncontext: [networking,vpn]\r\n-->\r\n<p>\r\n    The pre-shared key is used by the two ends of the management gateway VPN tunnel to authenticate with each\r\n    other, so both the SDDC gateway and your on-premises gateway must use the same key. The key has a maximum length of\r\n    128 characters. Treat the pre-shared key as you would a password: keep it confidential, and don't use email or other\r\n    insecure methods to communicate the key to others.\r\n</p>\r\n",
    "public-ip" : "<!--\ntitle: How do I manage public IP addresses?\ncontext: [networking,public-ip]\n-->\n<p>\n    If you have a workload VM that you need to access from the public Internet, request a public IP address for it. See\n    <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_018\"\n        target=\"_blank\"\n    >Request or Release a Public IP Address </a>.\n</p>",
    "recommended-cryptography" : "<!--\ntitle: What are the recommended cryptography settings for IPsec VPNs?\ncontext: [networking,vpn]\n-->\n<p>\n    The on-premises end of any IPsec VPN must be configured to match the settings you specified for the SDDC end of that\n    VPN. See the <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_019\"\n        target=\"_blank\"\n    >IPsec VPN Settings Reference</a> for information about available settings and recommended values.\n</p>",
    "remove-host" : "<!--\ntitle: How do I remove hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>\n    You can remove a host from your SDDC as long as you don't go below the minimum required. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_012\"\n        target=\"_blank\"\n    >Remove Hosts </a>.\n</p>\n",
    "sddc-can-i-add-hosts" : "<!--\ntitle: Can I add hosts to my SDDC later?\ncontext: [create-sddc]\n-->\n<p>\n    You can deploy additional hosts later if your SDDC contains fewer hosts than the maximum allocated to your\n    organization.\n</p>\n",
    "sddc-groups" : "<!--\ntitle: What is an SDDC Group?\ncontext: [create-sddc]\nfeature: uiEnableSddcGroups\n-->\n<p>An SDDC deployment group connects your SDDCs and VPCs using VMware Transit Connect to provide high-bandwidth,\n    low-latency connections between SDDCs in the group and to other VPCs in the same region. You can also add a Direct\n    Connect Gateway (DXGW) to provide centralized connectivity to your on-premises SDDCs. An SDDC must meet several\n    criteria to be eligible for group membership:</p>\n<ul class=\"list\">\n    <li>It must be owned by the organization that owns the group.</li>\n    <li>It must be in the same AWS region as other group members.</li>\n    <li>Its management network CIDR block cannot overlap the management CIDR block of any other group member.</li>\n    <li>It cannot be a member of another SDDC Deployment Group.</li>\n    <li>It must be at SDDC version 1.11 or later.</li>\n</ul>\n<p>Peer connectivity among SDDC group members requires a VMware Managed Transit Gateway (VTGW). This is an AWS\n    resource created by VMware Transit Connect and owned and managed by VMware. Adding the first member to an SDDC Group\n    creates one of these resources and assigns it to the group. Creation and operation of a VTGW incurs additional\n    charges on your VMware Cloud on AWS bill.</p>\n<p>To create an SDDC Group:\n<ol class=\"list\">\n    <li>\n        On the SDDC Groups tab, click <strong>ACTIONS</strong> and select <strong>Create SDDC Group</strong>.\n    </li>\n    <li>\n        Give the group a <strong>Name</strong> and optional <strong>Description</strong>, then click <strong>NEXT</strong>.\n    </li>\n    <li>\n        On the <strong>Membership</strong> grid, select the SDDCs to include as group members. When you have finished\n        selecting members, click <strong>NEXT</strong>.\n    </li>\n    <li>\n        Acknowledge that you understand and take responsibility for the costs you incur when you create an SDDC group,\n        then click <strong>CREATE GROUP</strong> to create the SDDC Group and its VMware Managed Transit Gateway.\n    </li>\n</ol>\n<p>\n    Charges begin when you click <strong>CREATE GROUP</strong>. You cannot pause or cancel the process after it starts.\n    Group members won't be able to use VMware Transit Connect or its VTGW until deployment is complete. Deployment\n    typically takes about fifteen minutes.\n</p>",
    "sddc-how-many-hosts" : "<!--\ntitle: How many hosts can I have in my SDDC?\ncontext: [create-sddc]\n-->\n<p>A Single-host starter SDDC is limited to a single host until you scale up. Other SDDCs start with a minimum of two\n    hosts and can scale up to a maximum of 16.</p>\n",
    "set-compute-dns" : "<!--\ntitle: How do I set up DNS for my management and compute networks?\ncontext: [networking, dns, system]\nfeature: enableNsxtDeployment\n-->\n<p>\n    Your SDDC includes default DNS zones for the Management Gateway and Compute Gateway. Each zone includes a\n    preconfigured DNS forwarding service. Use the <strong>DNS Services</strong> tab on the DNS Services page to disable,\n    enable, or update some properties of DNS forwarding services for the default zones. To create additional DNS zones\n    or configure additional properties of DNS forwarders in any zone, use the <strong>DNS Zones</strong> tab. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_002\" target=\"_blank\"\n    >Add a DNS Zone</a> for details.\n</p>\n<ol class=\"list\">\n    <li>\n        Click <strong>DNS</strong> .\n    </li>\n    <li>\n        Click DNS Services to open the DNS Services tab.\n        <br>\n        See <a\n            href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_025\" target=\"_blank\"\n        >Configure DNS Services</a> for details about DNS service parameters.\n    </li>\n    <li>\n        Click <b>SAVE</b> .\n    </li>\n</ol>",
    "srm" : "<!--\ntitle: What is the Site Recovery Add-on?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n<p>\n    VMware Site Recovery allows you to perform automatic disaster recovery of virtual machines from your on-premises\n    datacenter to your SDDC. For more information, see the <a\n        href=\"https://docs.vmware.com/en/VMware-Site-Recovery/index.html\"\n        target=\"_blank\"\n    >VMware Site Recovery Documentation</a>.\n</p>\n",
    "storage-running-out" : "<!--\ntitle: I'm running out of Storage. What can I do?\ncontext: [summary]\n-->\n<p>\n    If you have the ability to add hosts, and your SDDC isn't at its maximum number of hosts, you can add a host to\n    increase the available storage capacity. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_010\"\n        target=\"_blank\"\n    >Add Hosts</a>. Otherwise, shut down workloads or migrate them off of your SDDC.\n</p>",
    "undefined" : "<!--\ntitle: How do I add additional hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>You can add a host if your SDDC contains fewer hosts than its maximum. If you don't see the <b>Add Hosts</b> option in the <b>Actions</b> menu, contact VMware.</p>\n    \n<p>To add a host:</p>\n<ol class=\"list\">\n    <li>Go to the <b>Summary</b> tab for your SDDC.</li>\n    <li>Select <b>Actions</b> &gt; <b>Add Hosts</b>.</li>\n    <li>Select the number of hosts to add.</li>\n    <li>Click <b>Add Hosts</b>.</li>\n</ol>\n<p>It might take up to a few minutes to resize the SDDC. While the hosts are being added, your workloads and vCenter Server continue to run as normal, but you are not able to start additional add or remove host actions.</p>\n",
    "vms-cant-reach-internet" : "<!--\ntitle: Why can't my virtual machines reach the internet?\ncontext: [networking,firewall]\n-->\n<p>\n    The default compute gateway firewall rules prevent all traffic from VMs from reaching the internet. To allow your\n    virtual machines to reach the internet, you need to create a compute gateway firewall rule to allow outbound traffic\n    on the logical network that your VM is connected to. See <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_020\"\n        target=\"_blank\"\n    >Add or Modify Compute Gateway Firewall Rules</a>.\n</p>",
    "what-can-i-do" : "<!--\ntitle: What can I do on the Launchpad?\ncontext: [launchpad]\n-->\n<p>The VMware Cloud Launchpad is a consolidated starting point for all VMware hybrid cloud infrastructure and\n    related solutions. You can use the links on this page to get started with migration solutions, explore VMware Tanzu\n    Kubernetes Grid, or begin creating the infrastructure you need for the next steps in your journey to the cloud.</p>\n<p>\n    You can find more information about the Launchpad in <a\n        href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_036\" target=\"_blank\"\n    >VMware Docs</a>.\n</p>",
    "what-happens-when-i-delete" : "<!--\ntitle: What happens when I delete an SDDC?\ncontext: [dashboard]\n-->\n<p>When you delete an SDDC:</p>\n<ul class=\"list\">\n    <li>All workloads in the SDDC are terminated.</li>\n    <li>All data and configuration settings in the SDDC are deleted.</li>\n    <li>All UI and API access to the SDDC are terminated.</li>\n    <li>All public IP addresses for the SDDC are released.</li>\n    <li>All direct connect virtual interfaces in the SDDC are deleted.</li>\n</ul>\n<p>Back up or migrate essential data and workload VMs before you delete an SDDC.</p>\n",
    "what-is-connected-amazon-vpc" : "<!--\ntitle: What is the connected Amazon VPC?\ncontext: [networking]\n-->\n<p>\n    During SDDC creation, you can connect your SDDC to an AWS account and select a VPC and subnet within that\n    account. Using a CloudFormation template, VMware Cloud on AWS creates an AWS Elastic Network Interface (ENI),\n    allowing your SDDC and services in the Amazon VPC and subnet in your AWS account to communicate without needing to\n    route traffic through the internet gateway. You can only connect an SDDC to a single Amazon VPC.\n</p>\n<p>\n    You can view details of your connected Amazon VPC, such as the account ID, VPC ID, and subnet by clicking <b>Connected\n     VPC</b> in the <b>System</b> category on the <b>Networking & Security</b> tab.\n</p>\n",
    "what-is-direct-connect" : "<!--\ntitle: What is Amazon Direct Connect?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    <a href=\"https://aws.amazon.com/directconnect/\">AWS Direct Connect</a> is a service provided by AWS that allows you\n    to create a dedicated high-speed, low-latency network connection between your on-premises data center and an AWS\n    Direct Connect location. You can access Direct Connect through a private virtual interface that you create\n    in the AWS console. In an SDDC with networking backed by NSX-T, all Direct Connect traffic, including vMotion,\n    management traffic, and compute gateway traffic, uses a private virtual interface.\n</p>\n",
    "what-is-preview" : "<!--\ntitle: What are Preview features?\ncontext: [dashboard]\n-->\n<p>\n    Features released in preview have been released to gather feedback. These features are marked with a <b>Preview</b>\n    icon in the UI. These features might not be available to all customers or in all AWS regions. We cannot guarantee\n    that features that are in \"Preview\" will become available within any particular time frame or at all. Make your\n    purchase decisions only on the basis of features that are available.\n</p>",
    "what-is-traffic-group" : "<!--\ntitle: What is a Traffic Group?\ncontext: [networking, virtual-interfaces]\nfeature: uiEnableSddcGroups\n-->\n<p>\n    In the default configuration, your SDDC network has a single edge router through which all North-South traffic\n    flows. To provide additional bandwidth for a subset of this traffic, you can create one or more traffic groups, each\n    of which creates an additional edge router, then create a list of CIDR blocks that you want to have routed through\n    the new edge router. See <a href=\"https://docs.vmware.com/en/VMware-Cloud-on-AWS/services/context?id=vmc_037\"\n        target=\"_blank\"\n    >Add Traffic Groups to Increase Edge Bandwidth</a> for more information about creating and managing traffic groups.\n</p>\n",
    "what-languages" : "<!--\ntitle: Which languages are supported in the VMC Console UI?\ncontext: [dashboard]\nfeature: uiEnableLocalization\n-->\n<p>The VMware Cloud on AWS Console supports English, French, German, Japanese, Korean, Spanish, Simplified Chinese,\n    and Traditional Chinese.</p>\n<p>To change the language displayed by VMware Cloud on AWS or any other VMware cloud service, set the language\n    preference for your account.</p>\n<ol class=\"list\">\n    <li>\n        From the VMware Cloud Services console, click your username and organization in the tool bar and select <strong>My\n            Account</strong>.\n    </li>\n    <li>\n        Click <strong>Preferences</strong>.\n    </li>\n    <li>\n        Edit the <strong>Language</strong> and <strong>Regional Format</strong> settings.\n    </li>\n</ol>\n"
  }
}