{
  "component" : "docs",
  "locale" : "es",
  "messages" : {
    "0004be8f6b3629f0e708d1ec68ed0e10" : "<!--\ntitle: ¿Por qué las máquinas virtuales no pueden acceder a Internet?\ncontext: [networking,firewall]\n-->\n<p>Las reglas de firewall de puerta de enlace de cómputo predeterminadas evitan que el tráfico de las máquinas virtuales llegue a Internet. Para permitir que las máquinas virtuales accedan a Internet, debe crear una regla de firewall de puerta de enlace de cómputo a fin de permitir el tráfico saliente en la red lógica a la que esté conectada la máquina virtual.</p>\n<ol class=\"list\">\n <li>Vaya a la pestaña <b>Red</b> para ver el SDDC.</li>\n    <li>En <b>Puerta de enlace de cómputo</b>, expanda la sección <b>Reglas de firewall</b>.</li>\n    <li>Haga clic en <b>Agregar regla</b>.</li>\n    <li>Introduzca los parámetros de regla:        <ul class=\"list\">\n            <li><b>Nombre de regla:</b> escriba un nombre para la regla.</li>\n            <li><b>Acción:</b> seleccione <b>Permitir</b>.</li>\n            <li><b>Origen:</b> escriba el rango de direcciones IP del bloque CIDR asignado a la red lógica de la máquina virtual.</li>\n            <li><b>Destino:</b> escriba <b>Cualquiera</b>.</li>\n            <li><b>Servicio:</b> seleccione <b>Cualquiera (todo el tráfico)</b>.</li>\n        </ul>\n    </li>\n\n</ol>",
    "0bedef5eb3bf011102af4dde2ffd30f3" : "<!--\ntitle: ¿Cuáles son las funciones de Vista previa?\ncontext: [dashboard]\n-->\n<p>En la vista previa se incluyeron funciones que permiten recoger comentarios. Estas funciones se marcan con el icono <b>Vista previa</b> en la interfaz de usuario. Puede que estas no estén disponibles para todos los clientes ni en todas las regiones de AWS. No podemos garantizar que las funciones en una \"Vista previa\" estarán disponibles en un periodo de tiempo concreto (ni si finalmente lo estarán). Base su decisión de compra únicamente en las funciones disponibles.</p>",
    "0f673b9345c9b2d37731c1bc20ea21d7" : "<!--\ntitle: ¿Cómo se quitan hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Los hosts se pueden quitar siempre y cuando se conserve el mínimo de 3 hosts en un clúster de SDDC:</p>\n<ol class=\"list\">\n    <li>Vaya a la pestaña <b>Resumen</b> para ver el SDDC.</li>\n    <li>Seleccione <b>Acciones</b> &gt; <b>Quitar hosts</b>.</li>\n    <li>Seleccione el número de hosts que desea quitar.</li>\n    <li>Seleccione <b>Entiendo que esta acción no puede deshacerse</b>.</li>\n    <li>Haga clic en <b>Quitar</b>.</li>\n</ol>\n<p>Es posible que se tarde varias horas en cambiar el tamaño del SDDC. Mientras se quitan los hosts, las cargas de trabajo y vCenter Server seguirán funcionando con normalidad, pero no podrá iniciar otras acciones de adición o eliminación de hosts.</p>\n",
    "1041670326db849c3331e1879416f57a" : "<!--\ntitle: ¿Cómo se establece la organización predeterminada?\ncontext: [dashboard]\n-->\n\n<p>Si es miembro de más de una organización, puede establecer su organización predeterminada. Esta será la que se muestre cuando inicie sesión.</p>\n<ol class=\"list\">\n    <li>En el panel de control de la consola de VMC, haga clic en su nombre de usuario y organización en la barra de herramientas.</li>\n    <li>Haga clic en <b>Establecer organización predeterminada</b> y seleccione la organización que desee configurar como predeterminada.</li>\n</ol>",
    "147a7e2ad24bb56ec548c1540fcb6fe8" : "<!--\ntitle: ¿Qué se puede hacer en la página de panel de control?\ncontext: [dashboard]\n-->\n<p>En el panel de control, puede:</p>\n<ul class=\"list\">\n    <li>Ver todos los SDDC creados en la organización actual. Puede hacer clic en un SDDC para abrir vCenter Server, ver los detalles relativos a este o eliminarlo.</li>\n    <li>Supervisar el progreso de las implementaciones de SDDC en curso.</li>\n    <li>Haga clic en <b>Crear SDDC</b> para crear un nuevo SDDC.</li>\n    <li>Haga clic en <b>Invitar a usuarios</b> para invitar a otros usuarios a la organización.</li>\n    <li>Haga clic en su nombre de usuario en la esquina superior derecha para cambiar de organización (si es miembro de varias), ver su perfil, generar un token de OAuth y establecer su organización predeterminada.</li>\n</ul>\n",
    "1611103ba0feffd85e1a9f1d8c264a91" : "<!--\ntitle: ¿Cómo se configura DNS?\ncontext: [networking,dns]\n-->\n<p>Configure DNS para que las máquinas del SDDC puedan resolver nombres de dominio completos (FQDN) como direcciones IP. Cuando se configuran DNS, no se debe configurar un servidor DNS público y otro privado (local), ya que pueden producirse resultados impredecibles. </p>\n<ol class=\"list\">\n    <li>En la pestaña Red del SDDC, expanda <b>DNS</b> en <b>Puerta de enlace de administración</b> o <b>Puerta de enlace de cómputo</b>. </li>\n    <li>Haga clic en <b>Editar</b>.</li>\n    <li>Escriba las direcciones IP de <b>Servidor DNS 1</b> y (si lo desea) <b>Servidor DNS 2</b>.</li>\n    <li>Si configura DNS para la puerta de enlace de administración, seleccione cómo se debe resolver el nombre de dominio completo (FQDN) de vCenter Server.        <ul class=\"list\">\n            <li>Si accede a vCenter Server desde Internet, seleccione <b>Dirección IP pública</b>.</li>\n            <li>Si configuró una VPN y la usa para acceder a vCenter Server, seleccione <b>Dirección IP privada</b>.</li>\n        </ul>\n    </li>\n    <li>Si configura DNS para la puerta de enlace de cómputo y ya configuró servidores DNS privados, asegúrese de que la VPN se configuró para admitir solicitudes de DNS a través de la VPN de la puerta de enlace de cómputo seleccionando <b>cgw-dns-network</b> como una de las redes locales de la VPN. Consulte \"¿Cómo se configura una conexión VPN de IPsec en la puerta de enlace de cómputo?\" para obtener más información. </li>\n</ol>\n",
    "1e7fa90bb4da44fd3a9411ebf9db3435" : "<!--\ntitle: ¿Cuál es la configuración de criptografía recomendada para las VPN de IPsec?\ncontext: [networking,vpn]\n-->\n<p>A menos que se indique lo contrario, estas opciones no se pueden editar en la consola de VMC. Si elige otros valores para las opciones editables, asegúrese de que configuración de la puerta de enlace local sea similar a la de la consola de VMC. </p>\n<h4>Configuración de Intercambio de claves por red (IKE) de la fase 1</h4>\n<ul class=\"list\">\n    <li>Protocolo: IKEv1</li>\n    <li>Modo ISAKMP: modo principal (deshabilitar el modo agresivo)</li>\n    <li>Duración de asociación de seguridad ISAKMP/IKE: 28800 segundos (8 horas)</li>\n    <li>Cifrado (editable): AED-256</li>\n    <li>Hash: SHA-1</li>\n    <li>Diffie-Hellman (editable): grupo 2 de DH</li>\n    <li>Modo de IPsec: túnel</li>\n    <li>Autenticación de IKE: clave precompartida</li>\n</ul>\n<h4>Configuración de la fase 2</h4>\n<ul class=\"list\">\n    <li>Cifrado (editable): AES-256</li>\n    <li>Hash: SHA-1</li>\n    <li>Modo de túnel: modo de túnel de carga de seguridad encapsuladora (ESP)</li>\n    <li>Diffie-Hellman (editable): grupo 2 de DH</li>\n    <li>Vida útil de asociación de seguridad: 3600 segundos (1 hora)</li>\n    <li>Confidencialidad directa total (PFS): habilitada</li>\n</ul>\n",
    "2283807a9964ef305873059103b3049b" : "<!--\ntitle: ¿Qué es una clave precompartida?\ncontext: [networking,vpn]\n-->\n<p>Los dos extremos del túnel VPN de la puerta de enlace de administración usan la clave precompartida para autenticarse entre sí, de modo que la puerta de enlace del SDDC y la local deben usar la misma clave. Esta debe tener un máximo de 128 caracteres. Trate la clave precompartida como si fuera una contraseña: mantenga su confidencialidad y no use el correo electrónico u otros métodos no seguros para compartirla con otros usuarios.</p>\n",
    "2c1ba2f7d865746fd731ed552a7f0b2e" : "<!--\ntitle: ¿Cómo se debe acceder a vSphere Client?\ncontext: [connection-info]\n-->\n<p>Antes de acceder a vSphere Client, debe configurar una regla de conexión VPN o de firewall para permitir el acceso a vCenter Server. Consulte <a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Establecer las reglas de firewall de puerta de enlace de administración</a>.</p>\n<p>Haga clic en el hipervínculo bajo <b>vSphere Client (HTML5)</b> y use el nombre de usuario y la contraseña que aparecen en la página Información de conexión para iniciar sesión.</p>\n",
    "30b59ac2bbc24fc5bbec7cbb1e9a495f" : "<!--\ntitle: ¿Cómo se crea una interfaz virtual pública?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>Puede configurar una interfaz virtual pública para acceder a servicios públicos de AWS, como S3, que puedan transmitirse a través de la conexión de Direct Connect. También puede establecer túneles VPN de puerta de enlace de administración y cómputo a través de la interfaz virtual pública de Direct Connect.</p>\n<p>Antes de crear una interfaz virtual pública, asegúrese de cumplir con los <a href=\"http://docs.aws.amazon.com/es_es/directconnect/latest/UserGuide/WorkingWithVirtualInterfaces.html#vif-prerequisites\">requisitos previos para las interfaces virtuales</a>.</p>\n<ol class=\"list\">\n    \n    <li>Inicie sesión en la consola de AWS.</li>\n    <li>Haga clic en <b>Direct Connect</b> y, a continuación, haga clic en <b>Interfaces virtuales</b>.</li>\n    <li>Haga clic en <b>Crear interfaz virtual</b>.</li>\n    <li>Seleccione <b>Público</b> para crear una interfaz virtual pública y, a continuación, seleccione <b>Mi cuenta de AWS</b> como propietario de la interfaz virtual.</li>\n</ol>\n<p>Una vez creada la interfaz pública virtual, configure las VPN de IPsec de puerta de enlace de administración y de cómputo para que la IP de puerta de enlace remota y las redes remotas se correspondan con el dispositivo que finaliza la conexión de Direct Connect en el centro de datos local.</p>",
    "368b83feade4e30006d029979ca09467" : "<!--\ntitle: Me estoy quedando sin espacio de almacenamiento. ¿Qué puedo hacer?\ncontext: [summary]\n-->\n<p>Si puede agregar hosts y el SDDC no alcanzó la cantidad máxima de hosts, podrá agregar un host para aumentar la capacidad de almacenamiento disponible. De lo contrario, apague cargas de trabajo o mígrelas fuera del SDDC.</p>",
    "371bacda2d54ffb6283b3c1ba319749f" : "<!--\ntitle: ¿Qué es el Amazon VPC conectado?\ncontext: [networking]\n-->\n<p>Durante la creación del SDDC, este se conecta a una cuenta de AWS y se seleccionan un VPC y una subred en dicha cuenta. Si se usa una plantilla de CloudFormation, VMware Cloud™ on AWS creará una interfaz de red flexible (ENI), lo que permitirá que el SDDC y los servicios de Amazon VPC y la subred de la cuenta de AWS se comuniquen sin necesidad de redirigir el tráfico a través de la puerta de enlace de Internet. Solo se puede conectar un SDDC a cada Amazon VPC.</p>\n\n<p>Para ver la información del Amazon VPC conectado, como el identificador de cuenta, el identificador de VPC y la subred, haga clic en <b>Amazon VPC conectado</b> en la pestaña <b>Redes</b>.</p>\n",
    "399fb082e659bd059c329d47187b2c9b" : "<!--\ntitle: ¿Cómo se debe acceder a vSphere Client?\ncontext: [connection-info]\n-->\n<p>Antes de acceder a vSphere Client, debe configurar una conexión VPN o una regla de firewall para permitir el acceso a vCenter Server. Consulte <a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Establecer las reglas de firewall de puerta de enlace de administración</a>.</p>\n<p>Haga clic en el hipervínculo bajo <b>vSphere Client (HTML5)</b> y use el nombre de usuario y la contraseña que aparecen en la página Información de conexión para iniciar sesión.</p>\n",
    "48964c31fdfaa31e73dd1678ae622e6d" : "<!--\ntitle: ¿Cómo se configura una conexión VPN de IPsec con la puerta de enlace de cómputo?\ncontext: [networking,vpn]\n-->\n<p>Se puede crear una conexión VPN desde la puerta de enlace de cómputo del SDDC en la red de cómputo local.</p>\n<ol class=\"list\">\n    <li>En la pestaña Redes del SDDC, complete la configuración de VPN de la puerta de enlace de cómputo.        <ul class=\"list\">\n            <li><b>Nombre de VPN:</b> escriba un nombre para la VPN.</li>\n            <li><b>Dirección IP pública de puerta de enlace remota:</b> introduzca la dirección IP de la puerta de enlace local.</li>\n            <li><b>Dirección IP privada de puerta de enlace remota:</b> si la puerta de enlace local se encuentra tras una NAT, escriba la dirección IP privada de la puerta de enlace local.</li>\n            <li><b>Redes remotas:</b> escriba la dirección de las redes de cómputo locales.</li>\n            <li><b>Dirección IP de puerta de enlace local:</b> muestra la dirección IP de la puerta de enlace de cómputo del SDDC. No es un campo editable.</li>\n            <li><b>Red local:</b> seleccione la red lógica a la que se conectará para usar esta VPN. Si la red lógica utiliza DHCP y se configuró un servidor DNS local, seleccione también <b>cgw-dns-network</b> para permitir que las solicitudes DNS se transmitan a través de la VPN. </li>\n            <li><b>Cifrado:</b> seleccione <b>AES-256</b>.</li>\n            <li><b>Confidencialidad directa total:</b> seleccione <b>Habilitado</b>.</li>\n            <li><b>Diffie-Hellman:</b> seleccione un grupo Diffie-Hellman. Debe coincidir con la configuración de la puerta de enlace local.</li>\n            <li><b>Clave precompartida:</b> escriba una cadena de clave de 128 caracteres como máximo.</li>\n        </ul>\n    </li>\n    <li>Configure el lado local del túnel VPN con las opciones de criptografía recomendadas. Consulte la <i>Guía de introducción a VMware Cloud on AWS</i> para obtener más información sobre la configuración de dispositivos de puerta de enlace específicos. </li>\n  \n</ol>\n<p>Para comprobar que el túnel VPN se conectó correctamente, consulte el estado de la VPN en la pestaña Redes.</p>\n",
    "48a5b54af2520255a60f1aeb8acc32fc" : "<!--\ntitle: ¿Cómo se configura una conexión VPN de IPsec con la puerta de enlace de cómputo?\ncontext: [networking,vpn]\n-->\n<p>Se puede crear una conexión VPN desde la puerta de enlace de cómputo del SDDC en la red de cómputo local.</p>\n<ol class=\"list\">\n    <li>En la pestaña Redes del SDDC, complete la configuración de VPN de la puerta de enlace de cómputo.        <ul class=\"list\">\n            <li><b>Nombre de VPN:</b> escriba un nombre para la VPN.</li>\n            <li><b>Dirección IP pública de puerta de enlace remota:</b> introduzca la dirección IP de la puerta de enlace local.</li>\n            <li><b>Dirección IP privada de puerta de enlace remota:</b> si la puerta de enlace local se encuentra tras una NAT, escriba la dirección IP privada de la puerta de enlace local.</li>\n            <li><b>Redes remotas:</b> escriba la dirección de las redes de cómputo locales.</li>\n            <li><b>Dirección IP de puerta de enlace local:</b> muestra la dirección IP de la puerta de enlace de cómputo del SDDC. No es un campo editable.</li>\n            <li><b>Red local:</b> seleccione la red lógica a la que se conectará para usar esta VPN. Si la red lógica utiliza DHCP y se configuró un servidor DNS local, seleccione también <b>cgw-dns-network</b> para permitir que las solicitudes DNS se transmitan a través de la VPN. </li>\n            <li><b>Cifrado:</b> seleccione <b>AES-256</b>.</li>\n            <li><b>Confidencialidad directa total:</b> seleccione <b>Habilitado</b>.</li>\n            <li><b>Diffie-Hellman:</b> seleccione un grupo Diffie-Hellman. Debe coincidir con la configuración de la puerta de enlace local.</li>\n            <li><b>Clave precompartida:</b> escriba una cadena de clave de 128 caracteres como máximo.</li>\n        </ul>\n    </li>\n    <li>Configure el lado local del túnel VPN con las opciones de criptografía recomendadas. Consulte la <i>Guía de introducción a VMware Cloud on AWS</i> para obtener más información sobre la configuración de dispositivos de puerta de enlace específicos. </li>\n  \n</ol>\n<p>Para comprobar que el túnel VPN se conectó correctamente, consulte el estado de VPN en la página Redes.</p>\n",
    "4b1343d42dce723ba29e55b781b412ac" : "<!--\ntitle: ¿Cómo se asocia una interfaz virtual privada al SDDC en la nube?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>La interfaz virtual privada permite que el tráfico de administración de ESXi y el tráfico de vMotion fluyan a través de la conexión de Direct Connect entre el entorno local y el SDDC.</p>\n<p>Antes de crear una interfaz virtual privada, asegúrese de cumplir con los <a href=\"http://docs.aws.amazon.com/es_es/directconnect/latest/UserGuide/WorkingWithVirtualInterfaces.html#vif-prerequisites\">requisitos previos para las interfaces virtuales</a>.</p>\n<ol class=\"list\">\n    <li>Determine el identificador de la cuenta de AWS de VMC. Este se encuentra en la sección <b>Direct Connect</b> de la pestaña <b>Redes</b> del SDDC.</li>\n    <li>Inicie sesión en la consola de AWS.</li>\n    <li>Haga clic en <b>Direct Connect</b> y, a continuación, en <b>Interfaces virtuales</b>.</li>\n    <li>Haga clic en <b>Crear interfaz virtual</b>.</li>\n    <li>Seleccione <b>Privada</b> para crear una interfaz virtual privada. Seleccione <b>Otra cuenta de AWS</b> como propietario de la cuenta e introduzca el identificador de la cuenta de AWS de VMC.</li>\n    <li>Inicie sesión en la consola de VMC y desplácese hasta la pestaña <b>Redes</b> del SDDC.</li>\n    <li>En <b>Direct Connect</b>, expanda <b>Interfaces virtuales</b> y haga clic en <b>Asociar</b> junto a la interfaz virtual que creó.</li>\n    <li>Seleccione <b>Entiendo que seré responsable de los cargos de transferencia de datos contraídos por la interfaz</b> y haga clic en <b>Aceptar interfaz virtual</b>.</li>\n    <li>Si se actualizó una VPN de IPsec, actualice la configuración de VPN.        <ol class=\"list\">\n            <li>En la consola de VMC, actualice la configuración de VPN de IPsec de administración. El diagrama de topología de la red muestra la dirección de subred del dispositivo de administración en el campo <b>Subred del dispositivo</b>.</li>\n            <li>Actualice la configuración de red remota de la puerta de enlace local para que use la dirección de subred del dispositivo de administración.</li>\n        </ol>\n    </li>\n</ol>\n",
    "4f87a32661f5b7d16a44c3302de7d26f" : "<!--\ntitle: ¿Cómo puede elegirse el rango de direcciones IP para la red de administración?\ncontext: [networking]\n-->\n<p>Los valores especificados para la red de administración no se pueden cambiar después de crear el SDDC. Tenga en cuenta estos puntos cuando elija los valores:</p>\n<ul class=\"list\">\n    <li>Los únicos tamaños admitidos para el rango de bloques CIDR son /23, /20 y /16.</li>\n\t<li>Si va a conectar el SDDC a un centro de datos local, las direcciones IP que elija para el SDDC deben ser diferentes de las que se encuentran en el centro de datos local a fin de evitar conflictos de direcciones IP.</li>\n\t<li>La cantidad máxima de hosts que puede contener el SDDC depende del bloque CIDR especificado. Si el bloque CIDR se indica con el formato XXX.XXX.XXX.XXX/YY, la cantidad máxima de hosts que podrá contener el SDDC será (2 ^(27 - YY)) - 3. Por ejemplo, si se especifica el bloque CIDR 192.0.2.0/23, la cantidad máxima de hosts será (2 ^(27 - 23)) - 3, o 13.</li>\n</ul>\n<p><b>Nota:</b> Aunque la cantidad de direcciones IP de host disponible en un bloque CIDR /16 es 2045, la cantidad máxima de hosts del SDDC se limita a 160 debido a otros factores.</p>",
    "504c453076570eee108f676037cdb3fd" : "<!--\ntitle: ¿Cómo se invita a otro usuario?\ncontext: [dashboard]\n-->\n\n<p>Para invitar a otro usuario, debe ser un propietario de organización.</p>\n<ol class=\"list\">\n    <li>En el panel de control de la consola de VMC, haga clic en <b>Invitar a usuarios</b>.</li>\n    <li>Escriba las direcciones de correo electrónico de los usuarios a los que desee invitar.</li>\n    <li>Seleccione la función de los usuarios a los que va a invitar. Puede seleccionar <b>Propietario de organización</b> o <b>Miembro de la organización</b>.</li>\n    <li>Haga clic en <b>Agregar</b>.</li>\n</ol>\n<p>Los usuarios que invite recibirán un correo electrónico con un vínculo e instrucciones adicionales que les permitirán registrarse en VMware Cloud on AWS.</p>",
    "512168942276546150ab4591791d2c97" : "<!--\ntitle: ¿Cómo se configura una conexión VPN de IPsec con la puerta de enlace de administración?\ncontext: [networking,vpn]\n-->\n<p>Se puede crear una conexión VPN desde la puerta de enlace de administración del SDDC en la red de administración local.</p>\n<ol class=\"list\">\n    <li>En la pestaña Redes del SDDC, complete la configuración de VPN de la puerta de enlace de administración.        <ul class=\"list\">\n            <li><b>Nombre de VPN:</b> escriba un nombre para la VPN.</li>\n            <li><b>Dirección IP pública de puerta de enlace remota:</b> introduzca la dirección IP pública de la puerta de enlace local.</li>\n            <li><b>Dirección IP privada de puerta de enlace remota:</b> si la puerta de enlace local se encuentra tras una NAT, escriba la dirección IP privada de la puerta de enlace local.</li>\n            <li><b>Redes remotas:</b> escriba la dirección de las redes de administración locales.</li>\n            <li><b>Dirección IP de puerta de enlace local:</b> muestra la dirección IP de la puerta de enlace de administración del SDDC. No es un campo editable.</li>\n            <li><b>Red local:</b> muestra el bloque CIDR de la subred de administración correspondiente a la puerta de enlace de administración. No es un campo editable.</li>\n            <li><b>Cifrado:</b> seleccione <b>AES-256</b>.</li>\n            <li><b>Confidencialidad directa total:</b> seleccione <b>Habilitado</b>.</li>\n            <li><b>Diffie-Hellman:</b> seleccione un grupo Diffie-Hellman. Debe coincidir con la configuración de la puerta de enlace local.</li>\n            <li><b>Clave precompartida:</b> escriba una cadena de clave de 128 caracteres como máximo.</li>\n        </ul>\n    </li>\n    <li>Configure el lado local del túnel VPN con las opciones de criptografía recomendadas. Consulte la <i>Guía de introducción a VMware Cloud on AWS</i> para obtener más información sobre la configuración de dispositivos de puerta de enlace específicos. </li>\n\n</ol>\n<p>Para comprobar que el túnel VPN se conectó correctamente, consulte el estado de VPN en la página Redes.</p>\n",
    "51e82d2f893994cad4a0435b6704fa8a" : "<!--\ntitle: ¿Qué reglas de firewall se necesitan para Site Recovery?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n\n<p>\n    Debe crear varias reglas de firewall para habilitar el tráfico de administración y replicación,    así como el servicio VMware Site Recovery.\n</p>\n\n<p>\n    Para habilitar el acceso de administración y API:\n</p>\n\n<ol>\n    <li>Permita el servicio HTTPS (TCP 433) entrante en vCenter</li>\n    <li>Permita el servicio Administración de servidor de SRM (TCP 9086) entrante en Site Recovery Manager</li>\n    <li>Permita el servicio Administración de servidor de VR (TCP 8043) entrante en vSphere Replication</li>\n    <li>Permita el servicio Cualquiera (todo el tráfico) saliente de vCenter, Site Recovery Manager y vSphere Replication</li>\n</ol>\n\n<p>\n    Para habilitar el tráfico de replicación:\n</p>\n\n<ol>\n    <li>Permita el servicio Replicación de máquinas virtuales (TCP 31031, 44046) entrante en vSphere Replication</li>\n    <li>Permita el servicio Cualquiera (todo el tráfico) saliente desde Solo administración de ESXi</li>\n</ol>\n\n<p>\n    Para habilitar el acceso a la consola de Site Recovery\n</p>\n\n<ol>\n    <li>Permita el servicio HTTPS (TCP 443) entrante a vSphere Replication</li>\n</ol>\n",
    "52939d0bf7f6e015fc43b762e1fe79b0" : "<!--\ntitle: ¿Pueden agregarse hosts al SDDC más tarde?\ncontext: [create-sddc]\n-->\n<p>Más tarde, podrá implementar hosts adicionales si el SDDC contiene menos hosts del máximo asignado a su organización.</p>\n\n    \n\n",
    "52b8f73acf9935a10aed190f248e5a6c" : "<!--\ntitle: ¿Cómo se quita otro usuario?\ncontext: [dashboard]\n-->\n\n<p>Para quitar otro usuario de una organización, debe ser un propietario de organización.</p>\n<ol class=\"list\">\n    <li>En el panel de control de la consola de VMC, haga clic en el icono de servicios de la esquina superior derecha de la ventana y seleccione <b>Administración de identidad y acceso</b>.</li>\n    <li>Seleccione los usuarios que desee quitar.</li>\n    <li>Haga clic en <b>Quitar usuarios</b>.</li>\n    <li>Haga clic en <b>Quitar</b> para confirmar la acción.</li>\n</ol>\n<p>El usuario se quitará de la organización y no podrá acceder a los recursos de esta.</p>",
    "5ba0833e46158bb895f9a8776f02fb99" : "<!--\ntitle: ¿Qué es el complemento de Site Recovery?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n\n<p>VMware Site Recovery Manager le permite realizar acciones automáticas de recuperación ante desastres de máquinas virtuales del centro de datos local al SDDC en la nube.</p>\n",
    "5c4cd561f50297e3eb2c5783b9405139" : "<!--\ntitle: ¿Cómo se crea un nuevo SDDC?\ncontext: [dashboard,create-sddc]\n-->\n<p>Durante la creación del SDDC, este se conecta a una cuenta de AWS y se seleccionan un VPC y una subred en dicha cuenta. Si se usa una plantilla de CloudFormation, VMware Cloud™ on AWS creará una interfaz de red flexible (ENI), lo que permitirá que el SDDC y los servicios de Amazon VPC se comuniquen sin necesidad de redirigir el tráfico a través de la puerta de enlace de Internet. Solo se puede conectar un SDDC a cada Amazon VPC.</p>\n<p>Asegúrese de tener una cuenta de AWS y un VPC adecuado antes de crear un SDDC. Cree el VPC en la misma región que desee usar para el SDDC, y cree una subred con al menos 64 direcciones IP (un bloque CIDR /27) en cada zona de disponibilidad (AZ) del VPC.</p>\n<p>Para crear un nuevo SDDC:</p>\n<ol class=\"list\">\n    <li>En el panel de control, haga clic en <b>Crear SDDC</b>.</li>\n    <li>Siga los pasos para conectar la cuenta de AWS, configurar las propiedades del SDDC y seleccionar la subred. Consulte <a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-EF198D55-03E3-44D1-AC48-6E2ABA31FF02.html\" target=\"_blank\">Implementar un SDDC desde la consola de VMC</a> para obtener más información.</li>\n</ol>\n<p>El estado de la implementación del SDDC se muestra en el panel de control.</p>\n",
    "6ced784d9c5e00071eff86b77b849f2e" : "<!--\ntitle: ¿Qué se puede hacer en la página Redes?\ncontext: [networking]\n-->\n<p>En la página Redes, se puede:</p>\n<ul class=\"list\">\n    <li>Ver un diagrama de topología que muestra el estado de las conexiones de red hacia y desde el SDDC.</li>\n    <li>Crear reglas de firewall para las puertas de enlace de administración y cómputo.</li>\n    <li>Configurar las opciones de VPN de las conexiones VPN de IPsec entre el SDDC y un centro de datos local.</li>\n    <li>Configurar las opciones de DNS de las puertas de enlace de administración y cómputo.</li>\n    <li>Ver las redes lógicas. (Para configurar las redes lógicas use vSphere Client).</li>\n    <li>Configurar la NAT entrante de la puerta de enlace de cómputo.</li>\n    <li>Crear direcciones IP públicas para la puerta de enlace de cómputo.</li>\n    <li>Ver información sobre el Amazon VPC conectado.</li>\n    <li>Asociar interfaces virtuales privadas de AWS Direct Connect al SDDC.</li>\n</ul>\n",
    "7f1e7006f73bb6f25bf233669f10341a" : "<!--\ntitle: ¿Cómo se configuran las reglas de firewall de puerta de enlace de cómputo?\ncontext: [networking,firewall]\n-->\n<p>De forma predeterminada, el firewall de la puerta de enlace de cómputo se configura de manera que se deniegue todo el tráfico entrante y saliente. Agregue otras reglas de firewall para permitir el tráfico según sea necesario.</p>\n<ol class=\"list\">\n    <li>Vaya a la pestaña <b>Red</b> para ver el SDDC.</li>\n    <li>En <b>Puerta de enlace de cómputo</b>, expanda la sección <b>Reglas de firewall</b>.</li>\n    <li>Haga clic en <b>Agregar regla</b>.</li>\n    <li>Introduzca los parámetros de regla:        <ul class=\"list\">\n            <li><b>Nombre de regla:</b> escriba un nombre para la regla.</li>\n            <li><b>Acción:</b> seleccione <b>Permitir</b> o <b>Denegar</b>.</li>\n            <li><b>Origen:</b> introduzca o seleccione una de las siguientes opciones.                <ul class=\"list\">\n                <li>Seleccione <b>Todo el tráfico de Internet y VPN</b> para aplicar la regla a todo el tráfico procedente de Internet y VPN.</li>\n                <li>Seleccione <b>Todos los Amazon VPC conectados</b> para aplicar la regla a todo el tráfico procedente de Amazon VPC conectados.</li>    \n                <li>Introduzca <b>Cualquiera</b> para aplicar la regla al tráfico procedente de todos los orígenes.</li>\n                <li>Introduzca uno o varios rangos de direcciones IP o direcciones IP separados por comas para aplicar la regla al tráfico procedente de dichas direcciones IP. </li>    \n                </ul>\n            </li>\n            <li><b>Destino:</b> </b> introduzca o seleccione una de las siguientes opciones.\n                <ul class=\"list\">\n                <li>Seleccione <b>Todo el tráfico de Internet y VPN</b> para aplicar la regla a todo el tráfico dirigido a Internet y VPN.</li>\n                <li>Seleccione <b>Todos los Amazon VPC conectados</b> para aplicar la regla a todo el tráfico dirigido a Amazon VPC conectados.</li>    \n                <li>Introduzca <b>Cualquiera</b> para aplicar la regla al tráfico dirigido a todos los orígenes.</li>\n                <li>Introduzca uno o varios rangos de direcciones IP o direcciones IP separados por comas para aplicar la regla al tráfico dirigido a dichas direcciones IP. </li>    \n                </ul></li>\n            <li><b>Servicio:</b> seleccione una de las siguientes opciones:                <ul class=\"list\">\n                    <li><b>Cualquiera (todo el tráfico):</b> la regla se aplicará a todo el tráfico.</li>\n                    <li>Un servicio específico: la regla se aplicará al tráfico procedente del servicio y el puerto seleccionados.</li>\n                    <li><b>ICMP (todo ICMP)</b>: la regla se aplicará a todo el tráfico ICMP</li>\n                    <li><b>TCP personalizado</b> o <b>UDP personalizado</b>: para definir el servicio y el puerto personalizados a los que se aplicará la regla.</li>\n                </ul>\n            </li>\n            <li><b>Puertos:</b> si seleccionó un servicio TCP o UDP personalizado, escriba el número de puerto.</li>\n        </ul>\n    </li>\n</ol>\n<p>Las reglas de firewall se aplican en orden descendente. Utilice los iconos de flecha hacia arriba y hacia abajo para mover las reglas de firewall</p>\n",
    "815b9b868cca3fed897e848acddbf460" : "<!--\ntitle: ¿Qué es el complemento de Hybrid Cloud Extension?\ncontext: [hcx,addons]\n-->\n\n<p>VMware Hybrid Cloud Extension (HCX) abstrae los recursos locales y de nube y los presenta a las cargas de trabajo como una nube híbrida. Esto permite la movilidad de las cargas de trabajo entre el centro de datos local y el SDDC en la nube.</p>\n<p>HCX forma parte del servicio VMC on AWS. Para obtener más información sobre la instalación y la configuración de HCX, consulte <a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws\n.getting-started/GUID-DAE9B318-294A-4422-BBF4-82AE9DDFF043.html\">Lista de comprobación de la migración híbrida con HCX</a>.</p>",
    "8779212284284274601fb331ab4033a1" : "<!--\ntitle: ¿Cómo se crea una red lógica?\ncontext: [networking,logical-network]\n-->\n<p>Las redes lógicas se muestran en la consola de VMC, pero para crearlas se usa vSphere Client. </p>\n<ol class=\"list\">\n    <li>En la pestaña <b>Información de conexión</b> del SDDC, haga clic en el vínculo bajo <b>vSphere Client (HTML5)</b> e inicie sesión con las credenciales de vCenter Server.</li>\n    <li>Seleccione <b>Menú</b> &gt; <b>Listas de inventario globales</b> y luego <b>Redes lógicas</b>.</li>\n    <li>Haga clic en el botón Agregar.</li>\n    <li>En el campo de texto <b>Nombre</b>, escriba un nombre para la red lógica.</li>\n    <li>En el campo de texto <b>Bloque CIDR</b>, introduzca un bloque CIDR con el formato xxx.xxx.xxx.0/YY. <p>La longitud del prefijo debe ser de 22 a 30, debido a que la red lógica no debe tener más de 1.000 puertos.</p></li>\n    <li>(Opcional) Seleccione <b>Habilitado</b> para habilitar DHCP. <p>Si habilita DHCP en una red lógica y configuró un servidor DNS local, debe editar la VPN de puerta de enlace de cómputo para permitir que las consultas DNS se reenvíen correctamente a través de la VPN. Para ello, seleccione <b>cgw-dns-network</b> como una de las redes locales de la VPN.</p></li>\n    <li>Haga clic en <b>Aceptar</b>.</li>\n</ol>\n",
    "8c9c25e613fcceef9f17aab074171d86" : "<!--\ntitle: ¿Qué se puede hacer en la página Resumen?\ncontext: [summary]\n-->\n<p>En la página Resumen se muestra el uso actual de CPU, memoria y almacenamiento del SDDC. En esta página también se pueden agregar hosts al SDDC o quitarlos.</p>",
    "8e142af13e14fd0858db11652a4f6a91" : "<!--\ntitle: ¿Cómo se administra el acceso a vCenter Server?\ncontext: [networking,firewall,vpn]\n-->\n<p>De forma predeterminada, no se puede acceder de forma externa al sistema vCenter Server en el SDDC. Para abrir el acceso al sistema vCenter Server, realice una de estas opciones:</p>\n<ul class=\"list\">\n    <li>Configure una regla de firewall para permitir el acceso al sistema vCenter Server.</li>\n    <li>Configure una VPN de IPsec entre el centro de datos local y el SDDC.</li>\n</ul>\n<p>Cuando configure una de estas opciones, haga clic en la pestaña <b>Información de conexión</b> para ver cómo puede conectarse a vCenter Server mediante vSphere Client y PowerCLI.</p>\n",
    "907e29f426a0e6cfe310ca3065113696" : "<!--\ntitle: ¿Qué ocurre cuando se elimina un SDDC?\ncontext: [dashboard]\n-->\n<p>Cuando se elimina un SDDC, también se eliminan las máquinas virtuales y los datos; los hosts y los demás recursos asignados al SDDC se liberan para poder usarlos en otros SDDC. Antes de eliminar un SDDC, cree una copia de seguridad de los datos importantes y las máquinas virtuales, o mígrelos a otro lugar.</p>\n",
    "9473fdd0d880a43c21b7778d34872157" : "contenido de prueba",
    "99a1f78f70ee152574b1f192a311da43" : "<!--\ntitle: ¿Cómo se elimina un SDDC?\ncontext: [dashboard]\n-->\n<p>En el panel de control, busque la tarjeta del SDDC y haga clic en <b>Acciones</b> &gt <b>Eliminar SDDC</b>.</p>\n",
    "9a5c79ad338ec95353d9a47570c368bc" : "<!--\ntitle: ¿Es posible invitar a un usuario que no tenga una cuenta de MyVMware?\ncontext: [dashboard, invite]\n-->\n\n<p>Sí. El usuario deberá crear una cuenta de MyVMware durante el proceso de registro.</p>",
    "9a876507c260d5e28f7888e94b34c30b" : "<!--\ntitle: ¿Cómo se configuran las reglas de firewall de puerta de enlace de administración?\ncontext: [networking,firewall]\n-->\n<p>De forma predeterminada, el firewall de la puerta de enlace de administración se configura para denegar todo el tráfico entrante y saliente. Agregue reglas de firewall para poder acceder a vCenter Server y permitir el tráfico según corresponda.</p>\n<ol class=\"list\">\n    <li>Vaya a la pestaña <b>Red</b> para ver el SDDC.</li>\n    <li>En <b>Puerta de enlace de administración</b>, expanda la sección <b>Reglas de firewall</b>.</li>\n    <li>Haga clic en <b>Agregar regla</b>.</li>\n    <li>Introduzca los parámetros de regla:        <ul class=\"list\">\n            <li><b>Nombre de regla:</b> escriba un nombre descriptivo para la regla.</li>\n              <li><b>Acción:</b> para las reglas de firewall de la puerta de enlace de administración solo está disponible la acción <b>Permitir</b>.</li>\n            <li><b>Origen:</b> introduzca una de las siguientes opciones:                <ul class=\"list\">\n                    <li>Una dirección IP, un rango de direcciones IP o <b>Cualquiera</b> para permitir el tráfico desde esa dirección o ese rango de direcciones.</li>\n                    <li><b>vCenter</b> para permitir el tráfico desde la instancia de vCenter Server del SDDC.</li>\n                    <li><b>Solo administración de ESXi</b> para permitir el tráfico desde la instancia de administración de ESXi del SDDC.</li>\n                </ul>\n            </li>\n            <li><b>Destino:</b> introduzca una de las siguientes opciones:                <ul class=\"list\">\n                    <li>Una dirección IP, un rango de direcciones IP o <b>Cualquiera</b> para permitir el tráfico a esa dirección o ese rango de direcciones.</li>\n                    <li><b>vCenter</b> para permitir el tráfico hacia la instancia de vCenter Server del SDDC.</li>\n                    <li><b>Solo administración de ESXi</b> para permitir el tráfico dirigido a la instancia de administración de ESXi del SDDC.</li>\n                </ul>\n            </li>\n            <li><b>Servicio</b>: seleccione una de las siguientes opciones:                <ul class=\"list\">\n                    <li><b>Cualquiera (todo el tráfico)</b></li>\n                    <li><b>HTTPS (TCP 443)</b>: solo se aplica si se elige vCenter Server como destino.</li>\n                    <li><b>Aprovisionamiento (TCP 902)</b>: solo se aplica si se elige administración de ESXi como destino.</li>\n                    <li><b>Consola remota (TCP 903)</b>: solo se aplica si se elige administración de ESXi como destino.</li>\n                    <li><b>ICMP (todo ICMP)</b></li>\n                </ul>\n            </li>  \n            <li><b>Puerto</b>: es un parámetro que no se puede editar y que muestra el puerto del servicio seleccionado.</li>\n        </ul>\n    </li>\n</ol>\n<p>Las reglas de firewall se aplican en orden descendente. Utilice los iconos de flecha hacia arriba y hacia abajo para mover las reglas de firewall</p>\n",
    "9fee73eeba958dca24974ae6e88a6c55" : "<!--\ntitle: ¿Qué es Amazon Direct Connect?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>AWS Direct Connect es un servicio de AWS que permite crear una conexión de alta velocidad y baja latencia entre el centro de datos local y los servicios de AWS.</p>\n\n<p>El acceso a Direct Connect se realiza a través de una interfaz virtual privada o pública. Puede usar una interfaz virtual privada para la administración de ESXi y el tráfico de vMotion entre el centro de datos local y el SDDC en la nube. Puede usar una interfaz virtual pública para acceder a los servicios públicos de AWS y redirigir el tráfico de VPN de IPsec de la puerta de enlace de administración a través de Direct Connect.</p>\n",
    "a82311223952969b5c0c177b512d9a90" : "<!--\ntitle: Acerca de VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>Copyright © 2017-2018 VMware, Inc. Todos los derechos reservados. Este producto está protegido por leyes de copyright y propiedad intelectual en Estados Unidos y otros países, así como por tratados internacionales. Los productos de VMware están cubiertos por una o varias de las patentes detalladas en <a href=\"http://www.vmware.com/go/patents-es\" target=\"_blank\">http://www.vmware.com/go/patents-es</a>.</p>\n<p>VMware es una marca registrada o marca comercial de VMware, Inc. en Estados Unidos y otras jurisdicciones. Todas las otras marcas y nombres que se mencionan aquí pueden ser marcas comerciales de sus respectivas compañías.</p>\n",
    "about-vmc-on-aws" : "<!--\ntitle: Acerca de VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>\n    Copyright © 2017-2020 VMware, Inc. Todos los derechos reservados. Este producto está protegido por leyes de copyright y propiedad intelectual en Estados Unidos y otros países, así como por tratados internacionales. Los productos de VMware están cubiertos por una o varias de las patentes detalladas en <a\n        href=\"http://www.vmware.com/go/patents-es\"\n        target=\"_blank\"\n    >http://www.vmware.com/go/patents-es</a>.\n</p>\n<p>VMware es una marca registrada o una marca comercial de VMware, Inc. en Estados Unidos y otras jurisdicciones. Todos los nombres y las marcas adicionales que se mencionan aquí pueden ser marcas comerciales de sus respectivas compañías.</p>\n",
    "ad24817552198eb1a923aebd467e0274" : "<!--\ntitle: ¿Cómo se solucionan los errores de la conexión VPN de IPsec?\ncontext: [networking,vpn]\n-->\n<p>Después de crear una conexión VPN entre la puerta de enlace de cómputo del SDDC y una red de cómputo local, puede comprobar que el túnel VPN esté conectado correctamente consultando el estado de la VPN en la pestaña Redes. Se pueden producir errores durante la creación de la VPN debido a una configuración incorrecta del SDDC o el extremo local de la red. Haga clic en Detalles del estado de la VPN para obtener más información acerca del estado de la VPN, incluidos los mensajes de error de túnel y canal. Esta lista de mensajes de error de la VPN incluye sugerencias para solucionar la causa principal del error.</p>\n\n<p>\n    Mensaje de canal:\n    <kbd>Policy does not allow OAKLEY_RSA_SIG authentication...</kbd>\n    <br>Mensaje de túnel:\n    <kbd> No acceptable Oakley Transform, sending notification...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Establezca el modo de autenticación\n    de la VPN local como PSK.\n</p>\n<p>\n    Mensaje de canal:\n    <kbd>peer is NATed...</kbd>\n    <br>Mensaje de túnel:\n    <kbd>peer is NATed...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Compruebe que el firewall\n    local abre el puerto 4500 para el tráfico de UDP entre la VPN local\n     y la IP pública de la VPN del SDDC.\n<p>\n    Mensaje de canal:\n    <kbd> sending notification NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> Mensaje de túnel:\n    <kbd> NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Descargue la configuración\n    de la VPN del SDDC y compruebe que la VPN local tiene la misma configuración\n     de IPsec de fase 1.\n</p>\n<p>\n    Mensaje de canal: ninguno<br> Mensaje de túnel:\n    <kbd> NO_PROPOSAL_CHOSEN msgid=00000000 ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Descargue la configuración\n    de la VPN del SDDC y compruebe que la VPN local tiene la misma configuración\n    de IPsec de fase 2.\n</p>\n<p>\n    Mensaje de canal: ninguno<br>Mensaje de túnel:\n    <kbd> cannot respond to IPsec SA request because no connection is\n        known for ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Descargue la configuración\n    de la VPN del SDDC y compruebe que se puede acceder a la VPN local en la dirección local\n    que se muestra en las direcciones de configuración locales y que la interfaz de usuario de la VPN\n    del SDDC muestre dicha dirección para <b>Dirección IP de puerta de enlace remota</b>.\n</p>\n<p>\n    Mensaje de canal:\n    <kbd>initiating Main Mode, STATE_MAIN_I1: initiate, deleting\n        state (STATE_MAIN_I1) ...</kbd>\n    <br>Mensaje de túnel:\n    <kbd>deleting state (STATE_MAIN_I1), STATE_MAIN_I1: initiate,\n        initiating Main Mode ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Compruebe que las reglas de\n     firewall de puerta de enlace de administración local permiten el tráfico de ping de ICMP a la VPN\n    del SDDC.\n</p>\n<p>\n    Mensaje de canal:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., we require peer to have ID '208.91.1.25', but peer declares\n        '10.146.97.30'...</kbd>\n    <br>Mensaje de túnel:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., deleting state (STATE_MAIN_R2), deleting state (STATE_QUICK_R2),\n        Main mode peer ID is ID_IPV4_ADDR: '10.146.97.30' ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> El valor configurado en la\n    interfaz de usuario de la VPN de IPsec del SDDC para <b>Dirección IP pública de puerta de enlace remota</b>\n    (en este ejemplo, 208.91.1.25) no coincide con el valor que proporciona\n    la VPN local para su identidad (en este ejemplo, 10.146.97.30). Edite el valor de <b>Dirección IP\n    pública de puerta de enlace remota</b> en la interfaz de usuario de la VPN de IPsec del SDDC\n    o actualice la red local de manera que emplee un identificador local que coincida con el valor de <b>Dirección IP\n    pública de puerta de enlace remota</b> de la interfaz de usuario de la VPN de IPsec del SDDC.\n\n</p>\n<p>\n    Mensaje de canal:\n    <kbd>received 1 malformed payload notifies, ...</kbd>\n    <br>Mensaje de túnel:\n    <kbd>sending notification PAYLOAD_MALFORMED to ..., probable\n        authentication failure (mismatch of preshared secrets?)...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Compruebe que la clave precompartida\n    configurada para el extremo local de la VPN coincide con la clave precompartida\n    configurada en la interfaz de usuario de la VPN de IPsec del SDDC.\n</p>\n\n<p>\n    Para obtener más información sobre cómo solucionar problemas de conexión VPN, consulte <a\n    href=\"https://docs.vmware.com/es/VMware-NSX-for-vSphere/6.4/com.vmware.nsx.troubleshooting.doc/GUID-3E4D0B69-B7E7-4C8B-BC78-A3FB3EE5E8BA.html\">Solución de problemas de redes privadas virtuales</a> en la documentación de NSX for vSphere.\n</p>\n",
    "add-custom-service" : "<!--\ntitle: ¿Cómo se agrega un servicio personalizado?\ncontext: [networking, inventory]\nfeature: enableNsxtDeployment\n-->\n<P>Cuando se crea una regla de firewall, se puede especificar que se aplique al tráfico de red desde uno o varios de los servicios definidos en el inventario de servicios del SDDC. La lista predeterminada incluye servicios de VMware, como la consola remota y el aprovisionamiento, servicios estándar como IKE, ICMP y TCP, y muchos servicios de terceros bien conocidos. Para agregar servicios a esta lista, seleccione valores, generalmente puertos y protocolos, de una lista de tipos de servicio y propiedades de servicio adicionales.</p>\n<ol class=\"list\">\n   <li>Haga clic en <strong>Servicios &gt; AGREGAR NUEVO SERVICIO</strong> y asigne un nombre al nuevo servicio.   </li>\n   <li>Haga clic en <strong>Configurar entradas de servicio</strong> para abrir la página Configurar entradas de servicio.   </li>\n   <li>En la página Configurar entradas de servicio, haga clic en <strong>AGREGAR NUEVA ENTRADA DE SERVICIO</strong>. <br> Para ver la lista de servicios conocidos, utilice los controles desplegables para desplazarse por las listas <strong>Tipo de servicio</strong> y <strong>Propiedades adicionales</strong>. Para agregar un servicio, seleccione un <strong>Tipo de servicio</strong> en el menú desplegable y especifique un valor para <strong>Propiedades adicionales</strong>, como los puertos de origen o de destino del servicio. A continuación, haga clic en <strong>APLICAR</strong>.\n   </li>\n   <li>(Opcional) En <strong>Descripción</strong>, proporcione una descripción del servicio y etiquételo.   </li>\n   <li>Haga clic en <strong>GUARDAR</strong> para crear la definición del servicio.\n   </li>\n</ol>",
    "add-host" : "<!--\ntitle: ¿Cómo se agregan hosts adicionales?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>\n    <b></b>Puede agregar un host si el SDDC contiene menos hosts que el número máximo permitido. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_010\"\n        target=\"_blank\"\n    >Agregar hosts</a>.",
    "add-management-group" : "<!--\ntitle: ¿Cómo se agregan grupos de administración?\ncontext: [networking, inventory]\nfeature: enableNsxtDeployment\n-->\n<p>Los grupos de inventario de administración predefinidos se crean automáticamente para los componentes de la infraestructura de SDDC,\n como vCenter y NSX Manager. No es posible modificar un grupo de administración predefinido, pero sí crear\n grupos de inventario de administración adicionales mediante la especificación de los bloques CIDR a los que están conectados los miembros del grupo.</p>\n<ol class=\"list\">\n   <li>Haga clic en <strong>Inventario &gt; Grupos</strong>.\n   </li>\n   <li>En la página Grupos, haga clic en <strong>GRUPOS DE ADMINISTRACIÓN</strong>; a continuación, haga clic en <strong>AGREGAR GRUPO</strong> y asigne al grupo un <strong>nombre</strong> y una <strong>descripción</strong> opcional.   </li>\n   <li>Haga clic en <strong>Establecer miembros</strong> para abrir la página <strong>Seleccionar miembros</strong>. Introduzca una o varias direcciones IP de las máquinas virtuales de administración en formato CIDR.\n   </li>\n   <li>(Opcional) Etiquete el grupo.</li>\n   <li>Haga clic en <strong>GUARDAR</strong> para crear el grupo.\n   </li>\n</ol>",
    "add-workload-groups" : "<!--\ntitle: ¿Cómo se agregan los grupos de cálculo o de carga de trabajo?\ncontext: [networking,inventory]\n-->\n<p>Debido a que los grupos de inventario de cálculo están formados por las máquinas virtuales de cálculo que se implementan en sus segmentos de red de cálculo, VMware Cloud on AWS no puede crearlos por usted. Deberá hacerlo usted mismo antes de poder desarrollar reglas de firewall de puerta de enlace de cómputo.</p>\n<ol class=\"list\">\n   <li>Haga clic en <strong>Inventario &gt; Grupos</strong>.\n   </li>\n   <li>En la página Grupos, haga clic en <strong>GRUPOS DE CÁLCULO</strong>; a continuación, haga clic en <strong>AGREGAR GRUPO</strong> y asigne al grupo un <strong>nombre</strong> y una <strong>descripción</strong> opcional.   </li>\n   <li>Haga clic en <strong>Establecer miembros</strong> para abrir la página <strong>Seleccionar miembros</strong>. Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_023\" target=\"_blank\"\n   >Agregar o modificar un grupo de cálculo</a> para obtener más información acerca de las formas que existen para designar la pertenencia a un grupo de cálculo.\n   </li>\n   <li>(Opcional) Etiquete el grupo.</li>\n   <li>Haga clic en <strong>GUARDAR</strong> para crear el grupo. \n   </li>\n</ol>",
    "advanced-security" : "<!--\ntitle: ¿Qué es el complemento NSX Advanced Security?\ncontext: [networking,addons]\nfeature: uiEnableNsxtAddon\n-->\n<p>\nNSX Advanced Security para VMware Cloud on AWS permite que el SDDC acceda a las funciones de seguridad de la aplicación NSX, lo que incluye\n<a\n        href=\"https://docs.vmware.com/es/VMware-NSX-T-Data-Center/3.0/administration/GUID-967EA04D-EA5A-4E0C-ACC3-D05B282C7FAF.html\"\n        target=\"_blank\"\n    >Perfiles de contexto</a>.\n</p>\n",
    "ae317d4d23c887da92794b8baed1d765" : "<!--\ntitle: Acerca de VMware Cloud on AWS\ncontext: [connection-info, create-sddc, dashboard, networking, summary]\n-->\n<p>Copyright © 2017 VMware, Inc. Todos los derechos reservados. Este producto está protegido por leyes de copyright y propiedad intelectual en Estados Unidos y otros países, así como por tratados internacionales. Los productos de VMware están cubiertos por una o varias de las patentes detalladas en <a href=\"http://www.vmware.com/go/patents-es\" target=\"_blank\">http://www.vmware.com/go/patents-es</a>.</p>\n<p>VMware es una marca registrada o marca comercial de VMware, Inc. en Estados Unidos y otras jurisdicciones. Todas las otras marcas y nombres que se mencionan aquí pueden ser marcas comerciales de sus respectivas compañías.</p>",
    "attach-private-vif" : "<!--\ntitle: ¿Cómo se asocia una interfaz virtual privada al SDDC en la nube?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    Una interfaz virtual (VIF) privada de AWS utiliza un espacio de direcciones IP privadas y proporciona una conexión dedicada privada al componente principal de la red de AWS, la cual culmina en la VPC. Inicie sesión en la consola de AWS para crear la VIF privada y, a continuación, inicie sesión en la consola de SDDC para asociar la VIF. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_014\"\n        target=\"_blank\"\n    >Crear una interfaz virtual privada para el tráfico de administración de ESXi y de vMotion</a>. Tenga en cuenta que la organización debe hacerse responsable de los cargos de transferencia de datos en los que se incurra debido al uso de esta interfaz antes de que pueda empezar a utilizarla para conectar un centro de datos local al SDDC.\n</p>\n",
    "available-roles" : "<!--\ntitle: ¿Qué funciones pueden asignarse a un nuevo usuario?\ncontext: [dashboard, invite]\n-->\n<p>El propietario de una organización debe asignar una de las siguientes funciones a cada miembro de la organización:</p>\n<ul class=\"list\">\n    <li>Propietario de organización: los propietarios de organización son los únicos que pueden invitar a otros usuarios a unirse a la organización.</li>\n    <li>Miembro de la organización: los miembros de la organización pueden crear, administrar y acceder a los centros de datos en la nube que pertenecen a la organización, pero no pueden invitar a usuarios nuevos.</li>\n</ul>\n<p>\n    Para obtener más información, consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_021\"\n        target=\"_blank\"\n    >Asignar una función de servicio de VMC a un miembro de la organización</a>.\n</p>",
    "bb4bd2b0bac3cadb60ded3460a132c6c" : "<!--\ntitle: ¿Qué se puede hacer en la página Redes?\ncontext: [networking]\n-->\n<p>En la página Redes, puede:</p>\n<ul class=\"list\">\n    <li>Ver un diagrama de topología que muestra el estado de las conexiones de red hacia y desde el SDDC.</li>\n    <li>Crear reglas de firewall para las puertas de enlace de administración y cómputo.</li>\n    <li>Configurar las opciones de VPN de las conexiones VPN de IPsec entre el SDDC y un centro de datos local.</li>\n    <li>Configurar las opciones de DNS de las puertas de enlace de administración y cómputo.</li>\n    <li>Ver las redes lógicas. (Para configurar las redes lógicas use vSphere Client).</li>\n    <li>Configurar la NAT entrante de la puerta de enlace de cómputo.</li>\n    <li>Crear direcciones IP públicas para la puerta de enlace de cómputo.</li>\n    <li>Ver información sobre el Amazon VPC conectado.</li>\n    <li>Asociar interfaces virtuales privadas de AWS Direct Connect al SDDC.</li>\n</ul>\n",
    "bb6d9d33a0a0560a5eaa7ba985b8fceb" : "<!--\ntitle: ¿Cómo se establece una conexión con el SDDC mediante PowerCLI?\ncontext: [connection-info]\n-->\n\n<p>Antes de conectarse mediante PowerCLI, debe crear una regla de firewall para permitir el acceso a vCenter Server. Consulte <a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.getting-started/GUID-0420393D-34CD-48B5-BC61-04100D04852A.html\" target=\"_blank\">Establecer las reglas de firewall de puerta de enlace de administración</a>.</p>\n<ol class=\"list\">\n    <li>Inicie PowerCLI en el equipo cliente.</li>\n    <li>En la página Información de conexión de la consola de VMC, copie el comando de <b>Conexión de PowerCLI</b> haciendo clic en el botón para copiar.</li>\n    <li>Pegue el comando en la ventana de PowerCLI.</li>\n    <li>Sustituya la <tt>&lt;contraseña&gt;</tt> por la que se muestra en <b>Autenticación</b>. Si la contraseña contiene caracteres especiales, escríbala entre comillas simples.</li>\n</ol>\n",
    "c0ecc7ac8dc10d134d859bd7c95f90e0" : "<!--\ntitle: ¿Cómo se agregan hosts adicionales?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Puede agregar un host si el SDDC contiene menos hosts que el máximo permitido. Si no ve la opción <b>Agregar hosts</b> en el menú <b>Acciones</b>, póngase en contacto con VMware.</p>\n    \n<p>Para agregar un host:</p>\n<ol class=\"list\">\n    <li>Vaya a la pestaña <b>Resumen</b> para ver el SDDC.</li>\n    <li>Seleccione <b>Acciones</b> &gt <b>Agregar hosts</b>.</li>\n    <li>Seleccione la cantidad de hosts que desee agregar.</li>\n    <li>Haga clic en <b>Agregar hosts</b>.</li>\n</ol>\n<p>Es posible que se tarde varios minutos en cambiar el tamaño del SDDC. Mientras se agregan los hosts, las cargas de trabajo y vCenter Server seguirán funcionando con normalidad, pero no podrá iniciar otras acciones de adición o eliminación de hosts.</p>\n",
    "c1dcdcbe735c6e47a057611d5c3ed1f9" : "<!--\ntitle: ¿Cómo se configura una conexión VPN de Capa 2 con la puerta de enlace de cómputo?\ncontext: [networking,l2vpn]\n-->\n<p>\n\tLa configuración de una VPN de Capa 2 forma parte de la configuración de una red extendida. Una red extendida tiene un único espacio de direcciones IP que abarca los entornos locales\ty de SDDC. Esto simplifica la migración de las máquinas virtuales de carga de trabajo desde el SDDC en la nube y hacia este.\n</p>\n<ol class=\"list\">\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-B447CF8B-8A5F-4189-8E12-078E0FD62320.html\">Configure el servidor de VPN\t\t\tde Capa 2 en el SDDC.</a>\t\tLa puerta de enlace de cómputo del SDDC en la nube actúa como el servidor de VPN de Capa 2 y proporciona el lado de SDDC de la VPN de Capa 2 que respalda una red extendida. Utilice la consola de VMC para configurar el\t\tservidor.\t</li>\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-027ECB6F-78D7-4089-8E71-3FEE6F327D72.html\">Configure y\t\t\thabilite el cliente de VPN de Capa 2 local.</a>\t\tTras configurar el lado de SDDC de la VPN de Capa 2, el sistema solicita que se configure el lado remoto (local) de la VPN de Capa 2. Para ello, se puede emplear la instancia local existente de NSX\t\to se puede descargar un dispositivo de NSX independiente.\t</li>\n\t<li>\n\t\t<a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-AFC96BF4-DBE4-4AFC-85E3-749C09289758.html\">Cree una red\t\t\textendida en el SDDC.</a>\t\tEspecifique los identificadores de los túneles creados en los pasos 1 y 2. Tras configurar la red extendida, puede abrir el túnel VPN de Capa 2.\t</li>\n</ol>\n<p>\n\tPara comprobar que el túnel VPN de Capa 2 se conectó correctamente, abra la fila <b>VPN de Capa 2</b> en <b>Puerta de enlace de cómputo</b> y actualice el estado.\n</p>\n",
    "c4a6fedc7bfcfeb8f152266f21e8d145" : "<!--\ntitle: ¿Cómo se debe configurar el FQDN de vCenter Server?\ncontext: [networking,dns]\n-->\n<p>Como parte de la configuración de DNS de la puerta de enlace de administración, debe configurar cómo se resolverá el nombre de dominio completo de vCenter Server.</p>\n<ul class=\"list\">\n    <li>Si accede a vCenter Server desde Internet, seleccione <b>Dirección IP pública</b>.</li>\n    <li>Si configuró una VPN y la usa para acceder a vCenter Server, seleccione <b>Dirección IP privada</b>.</li>\n</ul>\n",
    "ccbad6ce65d351ae7236e3fd1697c46d" : "<!--\ntitle: ¿Cómo se administran las direcciones IP públicas?\ncontext: [networking,public-ip]\n-->\n<p>Puede solicitar que las direcciones IP públicas se asignen a máquinas virtuales de carga de trabajo para permitir el acceso a estas máquinas virtuales desde Internet. VMware Cloud on AWS aprovisionará la dirección IP desde AWS. Antes de crear una dirección IP pública, debe asignar una IP estática a la máquina virtual desde la red lógica a la que esté conectada. </p>\n<ol class=\"list\">\n    <li>En la pestaña Red del SDDC, haga clic en <b>Direcciones IP públicas</b> en <b>Puerta de enlace de cómputo</b>.</li>\n    <li>Haga clic en <b>Solicitar dirección IP pública</b>.</li>\n    <li>Escriba una nota sobre la dirección IP y haga clic en <b>Guardar</b>.</li>\n</ol>\n<p>Para usar esta dirección IP pública, siga estos pasos:</p>\n<ul class=\"list\">\n    <li>Configure una regla de NAT para conectar la dirección IP pública con la dirección IP interna de una máquina virtual.</li>\n    <li>Agregue una regla de firewall de puerta de enlace de cómputo para permitir el tráfico entre la dirección IP pública y la red lógica a la que se asocia la máquina virtual.</li>\n</ul>\n",
    "choose-management-ip" : "<!--\ntitle: ¿Cómo puede elegirse el rango de direcciones IP para la red de administración?\ncontext: [networking]\n-->\n<p>\n    Los valores especificados para la red de administración no se pueden cambiar después de crear el SDDC. Tenga en cuenta estos puntos cuando elija los valores:\n</p>\n<ul class=\"list\">\n    <li>Elija un rango de direcciones IP que no se superponga a la subred de AWS con la que se va a conectar. Si desea conectar el SDDC a un centro de datos local, las direcciones IP que elija para la red de administración deben ser distintas de las del centro de datos local, con el fin de evitar conflictos en las direcciones IP.</li>\n    <li>\n        Se admiten bloques CIDR de tamaño 16, 20 o 23. Para bloques CIDR de tamaño 20 o 23, la cantidad máxima de hosts que el SDDC puede contener depende del tamaño del bloque CIDR que especifique y de si el SDDC ocupa una o varias zonas de disponibilidad (AZ).\n        <dl class=\"list\">\n            <dt>Bloque CIDR de tamaño 23</dt>\n            <dd>Hasta 27 hosts (una AZ). Hasta 22 hosts (varias AZ).</dd>\n            <dt>Bloque CIDR de tamaño 20 o 16</dt>\n            <dd>Hasta 160 hosts, independientemente de la cantidad de zonas de disponibilidad.</dd>\n        </dl>\n    </li>\n</ul>",
    "compute-firewall-rules" : "<!--\ntitle: ¿Cómo se configuran las reglas de firewall de puerta de enlace de cómputo?\ncontext: [networking,firewall]\n-->\n<p>\n    Las reglas de firewall de puerta de enlace de cómputo predeterminadas bloquean todo el tráfico entrante y saliente. Para poder utilizar una nueva puerta de enlace de cómputo, debe crear reglas de firewall que permitan el tráfico según sea necesario. Consulte\n <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0E66C9C8-C260-4056-8511-44818431110C.html\"\n        target=\"_blank\"\n    >Establecer las reglas de firewall de puerta de enlace de cómputo</a>.\n</p>\n",
    "compute-ipsec-vpn-connection" : "<!--\ntitle: ¿Cómo se configura una conexión VPN de IPsec con la puerta de enlace de cómputo?\ncontext: [networking,vpn]\n-->\n<p>\n    La puerta de enlace de cómputo otorga acceso a las máquinas virtuales de carga de trabajo. Una VPN de IPsec ofrece conectividad entre la puerta de enlace de cómputo y la red de cómputo del SDDC. Para crear una conexión de VPN de IPsec con la puerta de enlace de cómputo, siga los pasos que se describen en <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-93C55532-5734-4B70-8745-C3E779512869.html\"\n        target=\"_blank\"\n    >Crear una VPN de cómputo</a>.\n</p>\n",
    "compute-ipsec-vpn-connection-err" : "<!--\ntitle: ¿Cómo se solucionan los errores de la conexión VPN de IPsec?\ncontext: [networking,vpn]\n-->\n<p>Después de crear una conexión VPN entre la puerta de enlace de cómputo del SDDC y una red de cómputo local, puede comprobar que el túnel VPN esté conectado correctamente consultando el estado de la VPN en la pestaña Redes. Se pueden producir errores durante la creación de la VPN debido a una configuración incorrecta del SDDC o el extremo local de la red. Haga clic en Detalles del estado de la VPN para obtener más información acerca del estado de la VPN, incluidos los mensajes de error de túnel y canal. Esta lista de mensajes de error de la VPN incluye sugerencias para solucionar la causa principal del error.</p>\n\n<p>\n    Mensaje de canal:\n    <kbd>Policy does not allow OAKLEY_RSA_SIG authentication...</kbd>\n    <br>Mensaje de túnel:\n    <kbd> No acceptable Oakley Transform, sending notification...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Establezca el modo de autenticación\n    de la VPN local como PSK.\n</p>\n<p>\n    Mensaje de canal:\n    <kbd>peer is NATed...</kbd>\n    <br>Mensaje de túnel:\n    <kbd>peer is NATed...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Compruebe que el firewall\n    local abre el puerto 4500 para el tráfico de UDP entre la VPN local\n     y la IP pública de la VPN del SDDC.\n<p>\n    Mensaje de canal:\n    <kbd> sending notification NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> Mensaje de túnel:\n    <kbd> NO_PROPOSAL_CHOSEN ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Descargue la configuración\n    de la VPN del SDDC y compruebe que la VPN local tiene la misma configuración\n     de IPsec de fase 1.\n</p>\n<p>\n    Mensaje de canal: ninguno<br> Mensaje de túnel:\n    <kbd> NO_PROPOSAL_CHOSEN msgid=00000000 ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Descargue la configuración\n    de la VPN del SDDC y compruebe que la VPN local tiene la misma configuración\n    de IPsec de fase 2.\n</p>\n<p>\n    Mensaje de canal: ninguno<br>Mensaje de túnel:\n    <kbd> cannot respond to IPsec SA request because no connection is\n        known for ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Descargue la configuración\n    de la VPN del SDDC y compruebe que se puede acceder a la VPN local en la dirección local\n    que se muestra en las direcciones de configuración locales y que la interfaz de usuario de la VPN\n    del SDDC muestre dicha dirección para <b>Dirección IP de puerta de enlace remota</b>.\n</p>\n<p>\n    Mensaje de canal:\n    <kbd>initiating Main Mode, STATE_MAIN_I1: initiate, deleting\n        state (STATE_MAIN_I1) ...</kbd>\n    <br>Mensaje de túnel:\n    <kbd>deleting state (STATE_MAIN_I1), STATE_MAIN_I1: initiate,\n        initiating Main Mode ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Compruebe que las reglas de\n     firewall de puerta de enlace de administración local permiten el tráfico de ping de ICMP a la VPN\n    del SDDC.\n</p>\n<p>\n    Mensaje de canal:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., we require peer to have ID '208.91.1.25', but peer declares\n        '10.146.97.30'...</kbd>\n    <br>Mensaje de túnel:\n    <kbd>sending encrypted notification INVALID_ID_INFORMATION to\n        ..., deleting state (STATE_MAIN_R2), deleting state (STATE_QUICK_R2),\n        Main mode peer ID is ID_IPV4_ADDR: '10.146.97.30' ...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> El valor configurado en la\n    interfaz de usuario de la VPN de IPsec del SDDC para <b>Dirección IP pública de puerta de enlace remota</b>\n    (en este ejemplo, 208.91.1.25) no coincide con el valor que proporciona\n    la VPN local para su identidad (en este ejemplo, 10.146.97.30). Edite el valor de <b>Dirección IP\n    pública de puerta de enlace remota</b> en la interfaz de usuario de la VPN de IPsec del SDDC\n    o actualice la red local de manera que emplee un identificador local que coincida con el valor de <b>Dirección IP\n    pública de puerta de enlace remota</b> de la interfaz de usuario de la VPN de IPsec del SDDC.\n\n</p>\n<p>\n    Mensaje de canal:\n    <kbd>received 1 malformed payload notifies, ...</kbd>\n    <br>Mensaje de túnel:\n    <kbd>sending notification PAYLOAD_MALFORMED to ..., probable\n        authentication failure (mismatch of preshared secrets?)...</kbd>\n    <br> <strong>Sugerencia de solución:</strong> Compruebe que la clave precompartida\n    configurada para el extremo local de la VPN coincide con la clave precompartida\n    configurada en la interfaz de usuario de la VPN de IPsec del SDDC.\n</p>\n\n<p>\n    Para obtener más información sobre cómo solucionar problemas de conexión VPN, consulte <a\n    href=\"https://docs.vmware.com/es/VMware-NSX-for-vSphere/6.4/com.vmware.nsx.troubleshooting.doc/GUID-3E4D0B69-B7E7-4C8B-BC78-A3FB3EE5E8BA.html\">Solución de problemas de redes privadas virtuales</a> en la documentación de NSX for vSphere.\n</p>\n",
    "compute-l2-vpn-connection" : "<!--\ntitle: ¿Cómo se configura una conexión VPN de Capa 2 con la puerta de enlace de cómputo?\ncontext: [networking,l2vpn]\n-->\n<p>\n    La puerta de enlace de cómputo utiliza una VPN de Capa 2 para otorgar acceso a las máquinas virtuales de carga de trabajo que se ejecutan en el SDDC. La configuración de una VPN de Capa 2 forma parte de la configuración de una red extendida. Una red extendida tiene un único espacio de direcciones IP que abarca los entornos de SDDC y locales. Esto simplifica la migración de las máquinas virtuales de carga de trabajo hacia el SDDC en la nube y desde este.\nPara crear una VPN de Capa 2 en un SDDC con redes respaldadas por VMware NSX for vSphere, siga estos pasos:\n<ol class=\"list\">\n    <li>\n        <a\n            href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-B447CF8B-8A5F-4189-8E12-078E0FD62320.html\"\n            target=\"_blank\"\n        >Configure el servidor de VPN de Capa 2 en el SDDC.</a> La puerta de enlace de cómputo del SDDC en la nube actúa como el servidor de VPN de Capa 2 y proporciona el lado de SDDC de la VPN de Capa 2 que respalda una red extendida. Utilice la consola de VMC para configurar el servidor.\n    </li>\n    <li>\n        <a\n            href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-027ECB6F-78D7-4089-8E71-3FEE6F327D72.html\"\n            target=\"_blank\"\n        >Configure y habilite el cliente de VPN de Capa 2 local.</a> Tras configurar el lado de SDDC de la VPN de Capa 2, el sistema solicita que se configure el lado remoto (instancia local de NSX) de la VPN de Capa 2. Para ello, se puede emplear la instancia local existente de NSX o se puede descargar un dispositivo de NSX independiente.\n    </li>\n    <li>\n        <a\n            href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-AFC96BF4-DBE4-4AFC-85E3-749C09289758.html\"\n            target=\"_blank\"\n        >Cree una red extendida en el SDDC.</a> Especifique los identificadores de los túneles que creó en los pasos 1 y 2.\nTras configurar la red extendida, puede activar el túnel VPN de Capa 2. Para comprobar que el túnel VPN de Capa 2 se conectó correctamente, abra la fila <b>VPN de Capa 2</b> en <b>Puerta de enlace de cómputo</b> y actualice el estado.\n    </li>\n</ol>\n</p>\n",
    "configure-IPFIX" : "<!--\ntitle: ¿Cómo se configura la sesión y el recopilador de IPFIX?\ncontext: [networking, tools, toolsipfix]\nfeature: enableNsxtDeployment\n-->\n<p>IPFIX (exportación de información sobre el flujo de protocolo de Internet) es un estándar de formato y exportación de la información sobre el flujo de red para la solución de problemas, auditoría o recopilación de información de análisis. Puede configurar la supervisión del flujo de un segmento lógico. Se capturan todos los flujos de las máquinas virtuales conectadas a ese segmento lógico y se envían al recopilador de IPFIX. El recopilador de IPFIX puede estar en el centro de datos local en uno de los segmentos lógicos.</p>\n<p>\n   <strong>Requisito previo</strong>\n</p>\n<p>\n   Compruebe que haya un segmento lógico configurado. Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-267DEADB-BD01-46B7-82D5-B9AA210CA9EE.html\"\n   >Crear o modificar un segmento de red</a>.\n</p>\n<ol class=\"list\">\n   <li>Haga clic en <strong>IPFIX &gt; RECOPILADORES &gt; AGREGAR NUEVO RECOPILADOR</strong> y asigne un <strong>nombre</strong> al recopilador.\n   </li>\n   <li>Introduzca la dirección IP y el puerto del recopilador. <br> El puerto UDP predeterminado es 4739. Se pueden agregar hasta       cuatro recopiladores de IPFIX.\n   </li>\n   <li>Haga clic en <strong>GUARDAR</strong>.\n   </li>\n   <li>Haga clic en <strong>PERFILES DE IPFIX DE CONMUTADOR</strong> para crear o editar un perfil de IPFIX de conmutador. <br> Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-NSX-T-Data-Center/2.5/administration/GUID-3458F2B3-089E-4BFC-8348-705172F2B802.html\"\n   >Configurar perfiles de IPFIX de conmutador</a> para obtener más información sobre los parámetros del perfil de IPFIX de conmutador de NSX-T.\n   </li>\n   <li>(Opcional) Etiquete el perfil.</li>\n   <li>Haga clic en <strong>GUARDAR</strong> para crear el perfil.\n   </li>\n</ol>",
    "configure-nat" : "<!--\ntitle: ¿Cómo se crean o se modifican las reglas NAT?\ncontext: [networking, nat, nat_nsx]\nfeature: enableNsxtDeployment\n-->\n<p>La traducción de direcciones de red (Network Address Translation, NAT) asigna direcciones IP internas de la red de cálculo a direcciones expuestas en la red Internet pública. Para crear una regla de NAT, proporcione la dirección interna y el número de puerto de una máquina virtual o servicio de carga de trabajo, y una dirección IP pública y número de puerto que haya obtenido del sistema.</p>\n<p>Las reglas de NAT deben ejecutarse en la interfaz de Internet del SDDC, ya que es donde se exponen las direcciones públicas de sus máquinas virtuales de carga de trabajo. Las reglas de firewall, que examinan los orígenes y los destinos de los paquetes, se ejecutan en la puerta de enlace de cálculo y procesan el tráfico después de que lo hayan transformado las reglas de NAT correspondientes. Al crear una regla de NAT, puede especificar si las direcciones IP internas o externas y el número de puerto de una máquina virtual se expondrán a reglas de firewall que afectan al tráfico de red hacia y desde dicha máquina virtual.</p>\n<ol class=\"list\">\n   <li>Haga clic en <strong>NAT &gt; AGREGAR REGLA DE NAT</strong> y asigne un <strong>nombre</strong> a la regla.   </li>\n   <li>Introduzca los parámetros de la regla de NAT. <br> Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_024\" target=\"_blank\"\n   >Crear o modificar reglas de NAT</a> para obtener detalles sobre las operaciones y los parámetros de reglas de NAT.\n   </li>\n   <li>(Opcional) Alterne <strong>Registro</strong> para registrar acciones de regla.   </li>\n   <li>La nueva regla está habilitada de forma predeterminada. Alterne <strong>Habilitar</strong> para deshabilitarla.\n   </li>\n   <li>Haga clic en <strong>GUARDAR</strong> para crear la regla.   </li>\n</ol>",
    "configure-portmirroring" : "<!--\ntitle: ¿Cómo se configura una sesión de reflejo del puerto?\ncontext: [networking, tools, toolsportmirroring]\nfeature: enableNsxtDeployment\n-->\n<p>El reflejo del puerto permite replicar y redirigir todo el tráfico proveniente de un origen. El tráfico reflejado se envía encapsulado por un túnel GRE (encapsulación de enrutamiento genérico) hacia un recopilador, de forma que toda la información de paquete original se conserva mientras se atraviesa la red hacia un destino remoto.</p>\n<p>El reflejo del puerto se utiliza en las siguientes situaciones:</p>\n<ul>\n   <li>Solución de problemas: analiza el tráfico para detectar intrusiones y errores de depuración y de diagnóstico en una red.</li>\n   <li>Cumplimiento y supervisión: reenvía todo el tráfico supervisado a un dispositivo de red para analizarlo y corregirlo.</li>\n</ul>\n<p>El reflejo del puerto incluye un grupo de origen donde los datos se supervisan y un grupo de destino en el que se copian los datos recopilados. Los criterios de pertenencia del grupo de origen requieren que las máquinas virtuales se agrupen en función de la carga de trabajo (como grupo web o grupo de aplicaciones), mientras que los criterios de pertenencia del grupo de destino requieren que las máquinas virtuales se agrupen según las direcciones IP.</p>\n<P>El reflejo del puerto tiene un punto de cumplimiento en el que se pueden aplicar reglas de directiva al entorno del SDDC.</p>\n<P>\n   <strong>Requisito previo</strong>\n</p>\n<p>Confirme que hay disponibles grupos de carga de trabajo con los criterios de pertenencia de máquina virtual y dirección IP. </li>\n<ol class=\"list\">\n   <li>Haga clic en <strong>Reflejo del puerto &gt; AGREGAR PERFIL</strong> y asigne al perfil un <strong>nombre</strong> y una <strong>descripción</strong> opcional.   </li>\n   <li>Especifique los parámetros del perfil. <br> Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_028\" target=\"_blank\"\n   >Configurar reflejos de puerto</a> para obtener detalles sobre los parámetros de creación de reflejo del puerto.\n   </li>\n   <li>Haga clic en <strong>GUARDAR</strong> para crear la sesión.\n   </li>\n   <li>(Opcional) Haga clic en el botón de puntos suspensivos junto a una sesión de reflejo del puerto y seleccione <strong>Editar</strong> para realizar cambios de configuración.   </li>\n</ol>",
    "configure-vcenter-fqdn" : "<!--\ntitle: ¿Cómo se debe configurar el FQDN de vCenter Server?\ncontext: [networking,dns]\n-->\n<p>\n    Puede conectarse a la instancia de vCenter Server del SDDC en una dirección IP pública o privada. \nUna dirección IP privada puede resolverse a partir de una VPN del SDDC, mientras que una dirección IP pública puede resolverse desde Internet.\n</p>\n<p>Para obtener más información, consulte <a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_015\">Configurar la dirección de resolución de FQDN en vCenter Server</a>.</p>\n",
    "connect-powercli" : "<!--\ntitle: ¿Cómo se establece una conexión con el SDDC mediante PowerCLI?\ncontext: [connection-info]\n-->\n<p>\n    Antes de que pueda conectarse mediante PowerCLI, debe crear una regla de firewall para permitir el acceso a vCenter Server. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_013\"\n        target=\"_blank\"\n    >Agregar o modificar reglas de firewall de puerta de enlace de administración</a>.\n</p>\n<ol class=\"list\">\n    <li>Inicie PowerCLI en el equipo cliente.</li>\n    <li>\n        En la pestaña <strong>Configuración</strong> de la consola de VMC, copie el comando que se encuentra en <strong>Conexión de PowerCLI</strong> haciendo clic en el botón para copiar.\n    </li>\n    <li>Pegue el comando en la ventana de PowerCLI.</li>\n    <li>\n        Sustituya la <tt>&lt;contraseña&gt;</tt> por la que se muestra en <strong>Cuenta de usuario de vCenter predeterminada</strong>. Si la contraseña contiene caracteres especiales, escríbala entre comillas simples.\n    </li>\n</ol>\n",
    "connect-vsphere-client" : "<!--\ntitle: ¿Cómo se debe acceder a vSphere Client?\ncontext: [connection-info]\n-->\n<p>\n    Antes de que pueda acceder a vSphere Client, debe configurar una conexión VPN o una regla de firewall para permitir el acceso a vCenter Server. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_013\"\n        target=\"_blank\"\n    >Agregar o modificar reglas de firewall de puerta de enlace de administración</a>.\n</p>\n<p>\n    En la tarjeta de detalles del SDDC, haga clic en <strong>ABRIR VCENTER</strong> y use las credenciales de vCenter predeterminadas para iniciar sesión. Para ver estas credenciales, haga clic en <strong>MOSTRAR CREDENCIALES</strong> en el cuadro de diálogo <strong>ABRIR VCENTER</strong>. Asimismo, las podrá encontrar en <strong>Cuenta de usuario de vCenter predeterminada</strong> en la pestaña <strong>Configuración</strong> del SDDC.\n</p>\n",
    "cpu-running-out" : "<!--\ntitle: Me estoy quedando sin recursos de CPU. ¿Qué puedo hacer?\ncontext: [summary]\n-->\n<p>\n    Si puede agregar hosts y el SDDC no alcanzó la cantidad máxima de hosts, podrá agregar un host para aumentar la capacidad de CPU disponible. De lo contrario, apague cargas de trabajo o mígrelas fuera del SDDC.\n</p>",
    "create-distributed-firewall-rule" : "<!--\ntitle: ¿Cómo se configuran las reglas de firewall distribuido?\ncontext: [networking, distributedfirewall]\nfeature: enableNsxtDeployment\n-->\n<p>\n   Las reglas de firewall distribuido se aplican en el nivel de la máquina virtual y controlan el tráfico de este a oeste dentro del SDDC. Todo el tráfico que intenta atravesar el firewall distribuido se somete a las reglas en el orden en el que figuran en la tabla de reglas, comenzando por el principio. Un paquete permitido por la primera regla pasa a la segunda regla y así sucesivamente por las reglas que siguen hasta que el paquete se descarta, se rechaza o alcanza la regla predeterminada, la cual permite todo el tráfico. Las reglas de firewall distribuido se agrupan en directivas. Las directivas están organizadas por categoría. Las ventajas de las categorías están relacionadas exclusivamente con la agrupación, no tienen propiedades operativas. Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_017\" target=\"_blank\"\n   >Agregar o modificar reglas de firewall distribuido</a> para obtener más información sobre las categorías de reglas de firewall distribuido.\n</p>\n<ol class=\"list\">\n   <li>Haga clic en <strong>Redes &amp; Seguridad &gt; Firewall distribuido</strong>.<br>Haga clic en <strong>REGLAS ESPECÍFICAS DE CATEGORÍA</strong> y seleccione una categoría para ver y modificar las directivas y las reglas de esa categoría, o haga clic en <strong>TODAS LAS REGLAS</strong> para ver (pero no modificar) las reglas de todas las directivas y categorías.   </li>\n   <li>(Opcional) Cambie la estrategia de conectividad predeterminada.<br>De forma predeterminada, el firewall distribuido incluye una regla Permitir implícita para todo el tráfico. Esta regla, que no aparece en ninguna lista de reglas, se evalúa después de todas las demás reglas y permite que el tráfico que no coincide con una regla anterior pase a través del firewall. Haga clic en el icono de estrategia de conectividad para ver una lista de estrategias disponibles. Para cambiar la estrategia actual, seleccione otra y haga clic en <strong>GUARDAR</strong>.\n   </li>\n   <li>Para agregar una directiva en la parte superior de la lista, haga clic en <strong>AGREGAR DIRECTIVA</strong> y asígnele un <strong>nombre</strong>.<br> Para agregar una directiva antes o después de una directiva existente, haga clic en el botón de puntos suspensivos verticales situado al principio de la fila de la directiva para abrir el menú de configuración de directivas y, a continuación, haga clic en <strong>Agregar directiva arriba</strong> o <strong>Agregar directiva debajo</strong>. De forma predeterminada, se aplica una nueva directiva al firewall distribuido (Distributed Firewall, DFW), pero se pueden especificar uno o varios grupos de inventario para que se aplique a estos en su lugar. El valor <strong>SE APLICA A</strong> de la directiva se propaga a todas las reglas de esta.\n   </li>\n   <li>Para agregar una regla, seleccione una directiva, haga clic en <strong>AGREGAR NUEVA REGLA</strong> y asigne un <strong>nombre</strong> a la regla.   </li>\n   <li>Introduzca los parámetros de la nueva regla.<br> Los parámetros se inicializan en los valores predeterminados (por ejemplo, <strong>Cualquiera</strong> para <strong>Orígenes</strong> y <strong>Destinos</strong>). Para editar un parámetro, mueva el cursor del mouse sobre el valor del parámetro y haga clic en el icono de lápiz para abrir un editor específico del parámetro. Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_017\" target=\"_blank\"\n   >Agregar o modificar reglas de firewall distribuido</a> para obtener más información sobre los parámetros de la regla de firewall distribuido.\n      </li>\n   <li>Haga clic en PUBLICAR para crear la regla.</li> \n</ol>",
    "create-edge-compute-firewall" : "<!--\ntitle: ¿Cómo se crea una regla de firewall de puerta de enlace de cómputo de NSX Edge?\ncontext: [networking, security]\nfeature: enableNsxtDeployment\n-->\n<p>De forma predeterminada, la puerta de enlace de cómputo bloquea el tráfico a todos los vínculos superiores. Agregue reglas de firewall de puerta de enlace de cómputo para permitir el tráfico según sea necesario.</p>\n<p>\n   Las reglas de firewall de puerta de enlace de cómputo especifican las acciones que deben realizarse en cuanto al tráfico de red que proviene de un origen determinado y se dirige a un destino especificado. Las acciones pueden implicar permitir (permitir el tráfico) o quitar (quitar todos los paquetes que coinciden con el origen y el destino especificados). El origen y el destino pueden elegirse entre una lista de interfaces de red física o bien a partir de una especificación genérica de <strong>Todos los vínculos superiores</strong>, que se refiere a todo el tráfico saliente de la puerta de enlace hacia la interfaz de VPC, la interfaz de Internet o la interfaz de Direct Connect. Una regla de firewall que se aplica a <strong>Todos los vínculos superiores</strong> no se aplica a la <strong>Interfaz de túnel VPN</strong> (VPN Tunnel Interface, VTI), que es una interfaz virtual y no un vínculo superior físico. La <strong>Interfaz de túnel VPN</strong> debe especificarse explícitamente en el parámetro <strong>Se aplica a</strong> de cualquier regla de firewall que administre la comunicación de la máquina virtual de carga de trabajo mediante una VPN basada en rutas. La puerta de enlace de cómputo incluye una <strong>Regla de VTI predeterminada</strong> que quita todo el tráfico hacia la VTI. Para permitir que las máquinas virtuales de carga de trabajo se comuniquen mediante la VTI, modifique esta regla o bájela a una clasificación inferior en la jerarquía de reglas, de modo que la precedan reglas más permisivas.\n</p>\n<p>Todo el tráfico que intenta atravesar el firewall se somete a las reglas en el orden en el que figuran en la tabla de reglas, comenzando por el principio. Un paquete permitido por la primera regla pasa a la segunda regla y así sucesivamente por las reglas que siguen hasta que el paquete se descarta, se rechaza o alcanza la regla predeterminada, la cual permite todo el tráfico.</p>\n<ol class=\"list\">\n   <li>Haga clic en <strong>Firewall de puerta de enlace</strong> para abrir la página <strong>FIREWALL DE PUERTA DE ENLACE</strong>.\n   </li>\n   <li>En la página <strong>FIREWALL DE PUERTA DE ENLACE</strong>, haga clic en <strong>Puerta de enlace de cómputo</strong>.\n   </li>\n   <li>Para agregar una regla, haga clic en <strong>AGREGAR REGLA</strong> y asígnele un <strong>nombre</strong>.\n   </li>\n   <li>Introduzca los parámetros de la nueva regla.<br> Los parámetros se inicializan en los valores predeterminados (por ejemplo, <strong>Cualquiera</strong> para <strong>Orígenes</strong> y <strong>Destinos</strong>). Para editar un parámetro, mueva el cursor del mouse sobre el valor del parámetro y haga clic en el icono de lápiz para abrir un editor específico del parámetro. Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_020\" target=\"_blank\"\n   >Agregar o modificar reglas de firewall de puerta de enlace de cómputo</a> para obtener más información sobre los parámetros de la regla de firewall de puerta de enlace de cómputo.\n      </li>\n   <li>Haga clic en <strong>PUBLICAR</strong> para crear la regla.\n   </li>\n</ol>\n<p>\n   Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_020\" target=\"_blank\"\n   >Agregar o modificar reglas de firewall de puerta de enlace de cómputo</a> para obtener más información sobre cómo editar la configuración de registro de reglas y cómo ver las estadísticas de las reglas.\n</p>",
    "create-edge-management-firewall" : "<!--\ntitle: ¿Cómo se crean las reglas de firewall de puerta de enlace de administración de NSX Edge?\ncontext: [networking, security]\nfeature: enableNsxtDeployment\n-->\n<p>De forma predeterminada, la puerta de enlace de administración bloquea el tráfico a todos los destinos de todos los orígenes. Agregue reglas de firewall de puerta de enlace de administración para permitir el tráfico según sea necesario.</p>\n<ol class=\"list\">\n   <li>Haga clic en <strong>Firewall de puerta de enlace</strong> para abrir la página <strong>FIREWALL DE PUERTA DE ENLACE</strong>.\n   </li>\n   <li>En la página <strong>FIREWALL DE PUERTA DE ENLACE</strong>, haga clic en <strong>Puerta de enlace de administración</strong>.   </li>\n   <li>Para agregar una regla, haga clic en <strong>AGREGAR REGLA</strong> y asígnele un <strong>nombre</strong>.\n   </li>\n   <li>Introduzca los parámetros de la nueva regla.<br> Los parámetros se inicializan en los valores predeterminados (por ejemplo, <strong>Cualquiera</strong> para <strong>Orígenes</strong> y <strong>Destinos</strong>). Para editar un parámetro, mueva el cursor del mouse sobre el valor del parámetro y haga clic en el icono de lápiz para abrir un editor específico del parámetro. Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_013\" target=\"_blank\"\n   >Agregar o modificar reglas de firewall de puerta de enlace de administración</a> para obtener más información sobre los parámetros de la regla de firewall de puerta de enlace de cómputo.\n   </li>\n   <li>Haga clic en <strong>PUBLICAR</strong> para crear la regla. <br> Las reglas de firewall se aplican en orden de arriba a abajo. Debido a que hay una regla Descartar predeterminada en la parte inferior y las reglas superiores son siempre del tipo Permitir, el orden de las reglas de firewall de puerta de enlace de administración no tiene ningún impacto sobre el flujo de tráfico.\n   </li>\n</ol>\n<p>\n   Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_013\" target=\"_blank\"\n   >Agregar o modificar reglas de firewall de puerta de enlace de administración</a> para obtener un ejemplo y más información sobre cómo editar la configuración de registro de reglas y cómo ver las estadísticas de las reglas.\n</p>",
    "create-l2vpn" : "<!--\ntitle: ¿Cómo se crea una VPN de capa 2?\ncontext: [networking, vpn, layer2]\nfeature: enableNsxtDeployment\n-->\n<p>Una red extendida de VMware Cloud on AWS utiliza una red privada virtual de capa 2 (Layer 2 Virtual Private Network, L2VPN) para extender una red local a varias VLAN en función de las redes que se pueden extender con diferentes identificadores de túnel en el mismo túnel L2VPN. Esta red extendida es una subred única con un solo dominio de difusión, por lo que puede migrar las máquinas virtuales hacia y desde el SDDC en la nube sin tener que cambiar sus direcciones IP.</p>\n<ol class=\"list\">\n   <li>\n      Haga clic en <strong>VPN &gt; Capa 2</strong>.\n   </li>\n   <li>\n      Haga clic en <strong>AGREGAR TÚNEL VPN</strong>.\n   </li>\n   <li>\n      Configure los parámetros del túnel VPN.\n      <br>\n      Consulte <a\n         href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_027\" target=\"_blank\"\n      >Configurar un túnel VPN de capa 2 en el SDDC</a> para obtener más información sobre los parámetros del túnel.\n   </li>\n   <li>(Opcional) Etiquete el túnel.</li>\n   <li>\nHaga clic en <strong>GUARDAR</strong> para crear el túnel.\n      <br>\n      La creación del túnel podría durar unos minutos. Cuando el túnel esté disponible, su estado pasará a ser Activo.\n   </li>\n</ol>\n<p>\n   Una vez que el túnel esté activo, tendrá que crear un segmento de red vinculado al ID de túnel del nuevo túnel.\n Consulte <a\n      href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_006\" target=\"_blank\"\n   >Configurar un segmento ampliado de VPN de capa 2</a> para obtener más información sobre cómo crear el segmento y cómo configurar el lado local de la VPN.\n</p>",
    "create-logical-segment" : "<!--\ntitle: ¿Cómo se crea un segmento de red lógica?\ncontext: [networking, network, segment]\nfeature: enableNsxtDeployment\n-->\n<p>VMware Cloud on AWS es compatible con tres tipos de segmentos de redes lógicas:</p>\n<li>Un segmento de red enrutada (el tipo de segmento predeterminado) tiene conectividad con otras redes lógicas en el SDDC y, a través del firewall de SDDC, con redes externas. Se crea un SDDC de inicio de host único con un solo segmento de red enrutada denominado sddc-cgw-network-1.</li>\n<li>Un segmento de red extendida amplía un túnel L2VPN existente, lo que proporciona un solo espacio de direcciones IP que abarca el SDDC y una red local.</li>\n<li>Un segmento de red desconectada no tiene vínculo superior y proporciona una red aislada a la que solo pueden acceder las máquinas virtuales conectadas a ella.</li>\n<ol class=\"list\">\n   <li>\n      Para crear un segmento, haga clic en <strong>Segmentos &gt; AGREGAR SEGMENTO</strong> y proporcione un <strong>nombre</strong> al segmento nuevo. <br> Para modificar la configuración de un segmento existente, haga clic en el botón de puntos suspensivos y seleccione <strong>Editar</strong>.\n   </li>\n   <li>\n      Especifique un <strong>tipo</strong> de segmento y rellene los parámetros de configuración necesarios.\n      <br>\n      Los requisitos de los parámetros dependen del tipo de segmento. Consulte <a\n         href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_001\" target=\"_blank\"\n      >Crear o modificar un segmento de red</a> para obtener más información sobre los parámetros de configuración de segmentos.\n   <li>\n      Haga clic en <strong>GUARDAR</strong> para crear o actualizar el segmento. <br>Esta operación puede demorar hasta 15 segundos en completarse. Cuando el <strong>Estado</strong> del segmento pasa a <strong>Activo</strong>, el segmento está listo para su uso. Si el <strong>Estado</strong> del segmento es <strong>Desactivado</strong>, puede hacer clic en el icono de información para ver los detalles del estado.\n   </li> \n</ol>",
    "create-policy-based-vpn" : "<!--\ntitle: ¿Cómo se crea una VPN basada en directivas?\ncontext: [networking, vpn, policy-based]\nfeature: enableNsxtDeployment\n-->\n<p>Una VPN basada en directivas crea un túnel IPsec y una directiva que especifica su uso por parte del tráfico. Cuando se utiliza una VPN basada en directivas, es necesario actualizar las tablas de enrutamiento en ambos extremos de la red cuando se agregan nuevas rutas.</p>\n<p>Las VPN basadas en directivas del SDDC de VMware Cloud on AWS usan un protocolo IPsec para proteger el tráfico. Para crear una VPN basada en directivas, configure el endpoint local (SDDC) y, a continuación, configure un endpoint remoto correspondiente (local). Dado que cada VPN basada en directivas debe crear una nueva asociación de seguridad de IPsec en cada red, cuando se cree una nueva VPN basada en directivas, los administradores deben actualizar la información de enrutamiento tanto de forma local como en el SDDC. Una VPN basada en directivas puede ser una opción adecuada cuando solo hay unas pocas redes en cada extremo de la VPN, o si el hardware de red local no es compatible con BGP (cuyo uso es obligatorio en las VPN basadas en rutas).</p>\n<ol class=\"list\">\n   <li>\nHaga clic en <strong> VPN &gt; Basada en directiva</strong>.\n   </li>\n   <li>Haga clic en AGREGAR VPN y asigne un Nombre a la nueva VPN.</li>\n   <li>\n      Seleccione una <strong>Dirección IP local</strong> en el menú desplegable.\n      <br>\n      Si configuró AWS Direct Connect en este SDDC y desea que la VPN lo use, seleccione la dirección IP privada. Tenga en cuenta que el tráfico de VPN a través de Direct Connect se limita a la MTU predeterminada de 1500 bytes, incluso si el vínculo admite una MTU superior. Seleccione una dirección IP pública si desea que la VPN se conecte a través de Internet.\n   </li>\n   <li>\n      Para <strong>IP pública remota</strong>, introduzca la dirección del endpoint de VPN local.\n      <br>\n      Consulte <a\n         href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_029\" target=\"_blank\"\n      >Crear una VPN basada en directivas</a> para obtener las restricciones importantes de los valores de IP remota y local.\n   </li>\n   <li>\n(Opcional) Si la puerta de enlace local está detrás de un dispositivo NAT, introduzca la dirección de puerta de enlace como <strong>IP privada remota</strong>.\n      <br>\n      Esta dirección IP debe coincidir con la identidad local (identificador de IKE) enviada por la puerta de enlace de VPN local. Si este campo está vacío, se usará el campo <strong>IP pública remota</strong> para que coincida con la identidad local de la puerta de enlace de VPN local.\n   </li>\n   <li>\n      Especifique las <strong>Redes remotas</strong> a las que esta VPN se puede conectar.\n      <br>\n      Esta lista debe incluir todas las redes definidas como locales por la puerta de enlace de VPN local. Introduzca cada red en formato CIDR. Separe varios bloques CIDR con comas.\n   </li>\n   <li>\n      Especifique las <strong>Redes locales</strong> a las que esta VPN se puede conectar.\n      <br>\n      Esta lista incluye todas las redes de cálculo enrutadas en el SDDC, así como la red de administración completa y la subred del dispositivo (que es un subconjunto de la red de administración que incluye vCenter y otros dispositivos de administración, pero no los hosts ESXi). También incluye la red DNS de CGW, una dirección IP única que se utiliza para obtener las solicitudes de origen reenviadas por el servicio DNS de CGW.\n   </li>\n   <li>\n      Configure <strong>Parámetros de túnel avanzados</strong>.\n      <br>\n      Consulte <a\n         href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_029\" target=\"_blank\"\n      >Crear una VPN basada en directivas</a> para los valores de parámetros sugeridos.\n   </li>\n   <li>(Opcional) Etiquete la VPN.</li>\n   <li>\n      Haga clic en <strong>GUARDAR</strong>.\n   </li>\n</ol>\n<p>El proceso de creación de la VPN puede tardar unos minutos. Cuando la VPN basada en directivas pasa a estar disponible, se muestran el estado del túnel y el estado de la sesión de BGP. Las siguientes acciones están disponibles para ayudarle con la solución de problemas y configuración del extremo local de la VPN:</p>\n<ul>\n   <li>\n      Haga clic en <strong>DESCARGAR CONFIGURACIÓN</strong> para descargar un archivo que contenga los detalles de configuración de la VPN. Puede utilizar estos detalles para configurar el extremo local de esta VPN.\n   </li>\n   <li>\n      Haga clic en <strong>VER ESTADÍSTICAS</strong> para ver las estadísticas de tráfico de paquetes de esta VPN. Consulte <a\n         href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_026\" target=\"_blank\"\n      >Ver estadísticas y estado del túnel VPN</a>.\n   </li>\n</ul>",
    "create-public-vif" : "<!--\ntitle: ¿Cómo se crea una interfaz virtual pública?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    Una interfaz virtual (VIF) pública permite al SDDC acceder a los servicios de AWS que son externos a la VPC (como S3) a través de AWS Direct Connect. Una VIF pública emplea un espacio de direcciones IP públicas y proporciona una conexión dedicada privada al componente principal de la red de AWS, la cual culmina en una región de AWS específica. Para crear una interfaz virtual pública en un SDDC, consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_016\"\n        target=\"_blank\"\n    >Crear una interfaz virtual pública para acceder a los servicios de AWS</a>.\n</p>\n",
    "create-route-based-vpn" : "<!--\ntitle: ¿Cómo se crea una VPN basada en rutas?\ncontext: [networking, vpn, route-based]\nfeature: enableNsxtDeployment\n-->\n<p>Una VPN basada en rutas crea una interfaz de túnel IPsec y enruta el tráfico a través de ella, según lo establecido en la tabla de enrutamiento de SDDC. VMware Cloud on AWS usa la misma dirección IP pública para todas las conexiones VPN, de manera que solo se puede crear una única conexión VPN (basada en rutas, basada en directivas o L2VPN) a una dirección IP pública remota dada. Las VPN basadas en rutas del SDDC de VMware Cloud on AWS utilizan un protocolo IPsec para proteger el tráfico y el protocolo de puerta de enlace de borde (Border Gateway Protocol, BGP) para detectar y propagar las rutas a medida que se crean redes nuevas. Para crear una VPN basada en rutas, configure la información de BGP de los endpoints locales (SDDC) y remotos (locales) y, a continuación, especifique los parámetros de seguridad de túnel del extremo del SDDC del túnel.</p>\n<ol class=\"list\">\n   <li>\n      Haga clic en <strong>VPN &gt; Basada en ruta</strong>.\n   </li>\n   <li>\n      (Opcional) Cambie el número de sistema autónomo (Autonomous System Number, ASN) local predeterminado.\n      <br>De forma predeterminada, todas las VPN basadas en rutas del SDDC son ASN 65000. Si el ASN remoto de cualquier conexión de VPN configurada\n      también tiene este valor, haga clic en <strong>EDITAR ASN LOCAL</strong>, introduzca un nuevo valor en el rango de\n      64521 a 65535, y haga clic en <strong>APLICAR</strong>.\n   </li>\n   <li>\n      Seleccione una <strong>Dirección IP local</strong> en el menú desplegable.\n      <br>\n      Si configuró AWS Direct Connect en este SDDC y desea que la VPN lo use, seleccione la dirección IP privada. Tenga en cuenta que el tráfico de VPN a través de Direct Connect se limita a la MTU predeterminada de 1500 bytes, incluso si el vínculo admite una MTU superior. Seleccione la dirección IP pública si desea que la VPN se conecte a través de Internet.\n   </li>\n   <li>\n      Para <strong>IP pública remota</strong>, introduzca la dirección del endpoint de VPN local.\n      <br>\n      Consulte <a\n         href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_030\" target=\"_blank\"\n      >Crear una VPN basada en rutas</a> para obtener las restricciones importantes de los valores de IP remota y local.\n   </li>\n   <li>\n      En <strong>Longitud de prefijo/IP local de BGP</strong>, introduzca la dirección IP (en formato CIDR) del túnel VPN local.\n   </li>\n   <li>\n      En <strong>IP remota de BGP</strong>, introduzca la dirección de la interfaz BGP de la puerta de enlace de VPN local.\n   </li>\n   <li>\n      En <strong>ASN remoto de BGP</strong>, introduzca el ASN de la puerta de enlace de VPN local.\n   </li>\n   <li>\n      Configure <strong>Parámetros de túnel avanzados</strong>.\n      <br>\n      Consulte <a\n         href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_030\" target=\"_blank\"\n      >Crear una VPN basada en rutas</a> para los valores de parámetros sugeridos.\n   </li>\n   <li>\n      (Opcional) En <strong>Parámetros de BGP avanzados</strong>, introduzca un <strong>Secreto</strong> de BGP que coincida con el que utiliza la puerta de enlace local.   </li>\n   <li>(Opcional) Etiquete la VPN.</li>\n   <li>\n      Haga clic en <strong>GUARDAR</strong>.\n   </li>\n</ol>\n<p>El proceso de creación de la VPN puede tardar unos minutos. Cuando la VPN basada en rutas pasa a estar disponible, se muestran el estado del túnel y el estado de la sesión de BGP. Las siguientes acciones están disponibles para ayudarle con la solución de problemas y configuración del extremo local de la VPN:</p>\n<ul>\n   <li>\n      Haga clic en <strong>DESCARGAR CONFIGURACIÓN</strong> para descargar un archivo que contenga los detalles de configuración de la VPN. Puede utilizar estos detalles para configurar el extremo local de esta VPN.\n   </li>\n   <li>\n      Haga clic en <strong>VER ESTADÍSTICAS</strong> para ver las estadísticas de tráfico de paquetes de esta VPN. Consulte <a\n         href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_026\" target=\"_blank\"\n      >Ver estadísticas y estado del túnel VPN</a>.\n   </li>\n   <li>\n      Haga clic en <strong>VER RUTAS</strong> para abrir una pantalla de rutas anunciadas y conocidas por esta VPN.\n   </li>\n   <li>\n      Haga clic en <strong>DESCARGAR RUTAS</strong> para descargar una lista de <strong>rutas anunciadas</strong> o <strong>rutas aprendidas</strong> en formato CSV.\n   </li>\n</ul>",
    "create-sddc" : "<!--\ntitle: ¿Cómo se crea un nuevo SDDC?\ncontext: [dashboard,create-sddc]\n-->\n<p>Para crear un SDDC, elija una región de AWS en la que alojarlo, asigne un nombre al SDDC y especifique cuántos hosts ESXi quiere que el SDDC contenga. Si aún no tiene una cuenta de AWS, todavía puede crear un SDDC de configuración de inicio que contenga un único host ESXi. Existe una relación de uno a uno entre los SDDC y las cuentas de cliente de AWS.\nPuede conectar un SDDC a Amazon VPC y a una cuenta de cliente de AWS única.</p>\n<p>\n    En el panel de control, haga clic en <b>Crear SDDC</b> para iniciar el asistente <strong>Crear un centro de datos definido por software (SDDC)</strong>. Para obtener más información sobre este proceso, consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_008\"\n        target=\"_blank\"\n    >Implementar un SDDC desde la consola de VMC</a>. El estado de la implementación del SDDC se muestra en el panel de control.\n</p>\n",
    "delete-sddc" : "<!--\ntitle: ¿Cómo se elimina un SDDC?\ncontext: [dashboard]\n-->\n<p>\n    En el panel de control, busque la tarjeta del SDDC y haga clic en <strong>ACCIONES</strong> &gt; <strong>Eliminar SDDC</strong>.\nConfirme que comprende las consecuencias de esta acción (la cual no se puede deshacer) y, a continuación, haga clic en <strong>ELIMINAR SDDC</strong>.\n</p>\n",
    "e1cba85551988a87c1139e690d5997ad" : "<!--\ntitle: ¿Cómo se configura NAT?\ncontext: [networking,nat]\n-->\n<p>La traducción de dirección de red (Network Address Translation, NAT) saliente se configura de forma predeterminada para la puerta de enlace de cómputo. Puede configurar la NAT entrante. </p>\n<ol class=\"list\">\n    <li>En la pestaña Red del SDDC, haga clic en <b>NAT</b>.</li>\n    <li>Introduzca los parámetros NAT:        <ul class=\"list\">\n            <li><b>Descripción:</b> escriba una descripción para la regla de NAT.</li>\n            <li><b>Dirección IP pública:</b> seleccione la dirección IP pública. Para obtener más información sobre cómo aprovisionar una dirección IP pública, busque en la ayuda.</li>\n            <li><b>Servicio:</b> seleccione una de las siguientes opciones:                <ul class=\"list\">\n                    <li><b>Cualquiera:</b> la regla se aplicará a todo el tráfico.</li>\n                    <li>Un servicio específico: la regla se aplicará al tráfico procedente del servicio y el puerto seleccionados.</li>\n                    <li><b>ICMP (todo)</b>: la regla se aplicará a todo el tráfico ICMP, como los paquetes de ping.</li>\n                    <li><b>TCP personalizado</b> o <b>UDP personalizado</b>: para definir el servicio y el puerto personalizados a los que se aplicará la regla.</li>\n                </ul>\n            </li>\n            \n            <li><b>Puertos públicos:</b> si seleccionó un servicio TCP o UDP personalizado, introduzca el puerto o el rango de puertos desde los que se redirigirá.</li>\n            <li><b>IP interna:</b> escriba la dirección IP interna o el bloque de direcciones IP a los que se debería redirigir la dirección IP pública. </li>\n             <li><b>Puertos internos:</b> si seleccionó un servicio TCP o UDP personalizado, introduzca el puerto o el rango de puertos a los que se redirigirá.</li>\n        </ul>\n    </li>\n</ol>\n",
    "e87aff2a3ca94aca6476294af0962f5a" : "<!--\ntitle: ¿Qué se puede hacer en la página Información de conexión?\ncontext: [connection-info]\n-->\n<p>En la página Información de conexión, encontrará hipervínculos para acceder a las instancias de vSphere Client y vCenter Server del SDDC. También podrá ver la contraseña inicial generada para la cuenta cloudadmin@vmc.local, que se puede usar para autenticarse en vCenter Server. </p>\n<p>Si cambia la contraseña de la cuenta cloudadmin@vmc.local, no se actualizará en esta página. </p>",
    "ef1277c930de7bd02f7937fb7b49d446" : "<!--\ntitle: Me estoy quedando sin memoria. ¿Qué puedo hacer?\ncontext: [summary]\n-->\n<p>Si puede agregar hosts y el SDDC no alcanzó la cantidad máxima de hosts, podrá agregar un host para aumentar la capacidad de memoria disponible. De lo contrario, apague cargas de trabajo o mígrelas fuera del SDDC.</p>",
    "ef936d7192ea7455d6def600da0c3062" : "<!--\ntitle: ¿Qué funciones pueden asignarse a un nuevo usuario?\ncontext: [dashboard, invite]\n-->\n\n<p>Cuando se invita a usuarios nuevos, se les pueden asignar las siguientes funciones:</p>\n<ul class=\"list\">\n    <li>Propietario de organización: los propietarios de organización son los únicos que pueden invitar a otros usuarios a la cuenta.</li>\n    <li>Miembro de la organización: los miembros de la organización pueden crear, administrar y acceder a los centros de datos en la nube que pertenecen a la organización, pero no pueden invitar a usuarios nuevos.</li>\n</ul>\n",
    "f162582a2057d3497784dd2a7579ba69" : "<!--\ntitle: ¿Cuántos hosts se pueden incluir en el SDDC?\ncontext: [create-sddc]\n-->\n<p>Actualmente, se puede implementar un SDDC con un mínimo de 4 hosts y un máximo de 16.</p>\n",
    "f1744e41db8ba4a4ec281f5c63a3df29" : "<!--\ntitle: ¿Cómo se configuran las reglas de firewall de puerta de enlace de cómputo?\ncontext: [networking,firewall]\n-->\n<p>Las reglas de firewall predeterminadas para la puerta de enlace de administración y la puerta de enlace de cómputo bloquean todo el tráfico entrante y saliente. Antes de poder utilizar estas puertas de enlace, debe agregar reglas de firewall que permitan el tráfico según sea necesario.</p>\n<ol class=\"list\">\n    <li>Vaya a la pestaña <b>Red</b> para ver el SDDC.</li>\n    <li>Para crear un conjunto predefinido de reglas de firewall para la puerta de enlace de administración, expanda <b>Acelerador de reglas de firewall</b> en la <b>Puerta de enlace de administración</b> y haga clic\n    en <b>Crear reglas de firewall</b> para crear reglas en el <b>Grupo de reglas</b> y <b>VPN</b> seleccionados.\n    </li>\n    <li>Para crear reglas de firewall de forma manual o editar reglas creadas por el Acelerador de reglas de firewall, expanda <b>Reglas de firewall</b> en la <b>Puerta de enlace de administración</b> o en la <b>Puerta de enlace de cómputo</b>.</li>\n    <li>Haga clic en <b>Agregar regla</b>.</li>\n    <li>Introduzca los parámetros de regla:        <ul class=\"list\">\n            <li><b>Nombre de regla:</b> escriba un nombre para la regla.</li>\n            <li><b>Acción:</b> seleccione <b>Permitir</b> o <b>Denegar</b>.</li>\n            <li><b>Origen:</b> introduzca o seleccione una de las siguientes opciones.                <ul class=\"list\">\n                <li>Seleccione <b>Todo el tráfico de Internet y VPN</b> para aplicar la regla a todo el tráfico procedente de Internet y VPN.</li>\n                <li>Seleccione <b>Todos los Amazon VPC conectados</b> para aplicar la regla a todo el tráfico procedente de Amazon VPC conectados.</li>    \n                <li>Introduzca <b>Cualquiera</b> para aplicar la regla al tráfico procedente de todos los orígenes.</li>\n                <li>Escriba una o más direcciones IP o rangos de direcciones IP separados por comas para aplicar la regla al tráfico procedente de dichas direcciones IP. </li>    \n                </ul>\n            </li>\n            <li><b>Destino:</b> </b> introduzca o seleccione una de las siguientes opciones.\n                <ul class=\"list\">\n                <li>Seleccione <b>Todo el tráfico de Internet y VPN</b> para aplicar la regla a todo el tráfico dirigido a Internet y VPN.</li>\n                <li>Seleccione <b>Todos los Amazon VPC conectados</b> para aplicar la regla a todo el tráfico dirigido a Amazon VPC conectados.</li>    \n                <li>Introduzca <b>Cualquiera</b> para aplicar la regla al tráfico dirigido a todos los orígenes.</li>\n                <li>Escriba una o más direcciones IP o rangos de direcciones IP separados por comas para aplicar la regla al tráfico dirigido a dichas direcciones IP. </li>    \n                </ul></li>\n            <li><b>Servicio:</b> seleccione una de las siguientes opciones:                <ul class=\"list\">\n                    <li><b>Cualquiera (todo el tráfico):</b> la regla se aplicará a todo el tráfico.</li>\n                    <li>Un servicio específico: la regla se aplicará al tráfico procedente del servicio y el puerto seleccionados.</li>\n                    <li><b>ICMP (todo ICMP)</b>: la regla se aplicará a todo el tráfico ICMP</li>\n                    <li><b>TCP personalizado</b> o <b>UDP personalizado</b>: para definir el servicio y el puerto personalizados a los que se aplicará la regla.</li>\n                </ul>\n            </li>\n            <li><b>Puertos:</b> si seleccionó un servicio TCP o UDP personalizado, escriba el número de puerto.</li>\n        </ul>\n    </li>\n</ol>\n<p>Las reglas de firewall se aplican en orden descendente. Utilice los iconos de flecha hacia arriba y hacia abajo para mover las reglas de firewall</p>\n",
    "f44b2dc3154413e99b0427e8f9cd4d72" : "<!--\ntitle: Me estoy quedando sin recursos de CPU. ¿Qué puedo hacer?\ncontext: [summary]\n-->\n<p>Si puede agregar hosts y el SDDC no alcanzó la cantidad máxima de hosts, podrá agregar un host para aumentar la capacidad de CPU disponible. De lo contrario, apague cargas de trabajo o mígrelas fuera del SDDC.</p>",
    "fe666a0d29b8c867ff39f4b94392a748" : "<!--\ntitle: ¿Qué son las puertas de enlace de administración y de cómputo?\ncontext: [networking]\n-->\n<p>Cuando se implementa un SDDC con VMware Cloud on AWS, este se configura con dos redes: una red de administración y una de cómputo. </p>\n<p>La red de administración gestiona el tráfico de red de los hosts del SDDC, vCenter Server, NSX Manager y otras funciones de administración.</p>\n<p>La red de cómputo controla el tráfico de red para las máquinas virtuales de carga de trabajo.</p>\n",
    "firewall-rules" : "<!--\ntitle: ¿Qué reglas de firewall se necesitan para Site Recovery?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n<p>Debe crear las siguientes reglas de firewall de puerta de enlace de administración para permitir el tráfico de administración y replicación que el servicio de VMware Site Recovery requiere.</p>\n<p>Para habilitar el acceso de administración y API:</p>\n<ol class=\"list\">\n    <li>Permita el servicio HTTPS (TCP 443) entrante en vCenter</li>\n    <li>Permita el servicio Administración de servidor de SRM (TCP 9086) entrante en Site Recovery Manager</li>\n    <li>Permita el servicio Administración de servidor de VR (TCP 8043) entrante en vSphere Replication</li>\n    <li>Permita el servicio Cualquiera (todo el tráfico) saliente de vCenter, Site Recovery Manager y vSphere Replication</li>\n</ol>\n<p>Para habilitar el tráfico de replicación:</p>\n<ol class=\"list\">\n    <li>Permita el servicio Replicación de máquinas virtuales (TCP 31031, 44046) entrante en vSphere Replication</li>\n    <li>Permita el servicio Cualquiera (todo el tráfico) saliente desde Solo administración de ESXi</li>\n</ol>\n<p>Para habilitar el acceso a la consola de Site Recovery</p>\n<ol class=\"list\">\n    <li>Permita el servicio HTTPS (TCP 443) entrante a vSphere Replication</li>\n</ol>\n",
    "hcx" : "<!--\ntitle: ¿Qué es el complemento de HCX?\ncontext: [hcx,addons]\n-->\n<p>\n    VMware HCX abstrae los recursos locales y de nube, y los presenta a las cargas de trabajo como una nube híbrida. Esto permite que las cargas de trabajo gocen de movilidad entre el centro de datos local y el SDDC en la nube. HCX forma parte del servicio VMC on AWS. Para obtener más información sobre la instalación y la configuración de HCX, consulte la <a\n        href=\"https://docs.vmware.com/es/VMware-HCX/index.html\" target=\"_blank\"\n    >Documentación de VMware HCX</a> y la <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_011\"\n        target=\"_blank\"\n    >Lista de comprobación de la migración híbrida con HCX</a>.\n</p>\n",
    "how-dns" : "<!--\ntitle: ¿Cómo se configura DNS?\ncontext: [networking,dns]\n-->\n<p>\n    Debe especificar un servidor DNS en las puertas de enlace de administración y cómputo para permitir que los hosts y las máquinas virtuales resuelvan los nombres de dominio completo (FQDN) como direcciones IP en las redes de administración y cómputo. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-12DA448A-9CFC-49CD-B765-3CB8A0B91BAB.html\"\n        target=\"_blank\"\n    >Establecer DNS de puerta de enlace de administración</a> y <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-09E0A733-E621-4A53-9061-A409860F5011.html\"\n        target=\"_blank\"\n    >Establecer DNS de puerta de enlace de cómputo</a>.\n</p>\n<p>\n    DNS debe configurarse por separado para las puertas de enlace de administración y cómputo.\n</p>\n",
    "how-invite-user" : "<!--\ntitle: ¿Cómo se invita a otro usuario?\ncontext: [dashboard]\n-->\n<p>\n    El propietario de la organización puede invitar a usuarios a unirse a la organización. Siga los pasos que se describen en <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_009\"\n        target=\"_blank\"\n    >Invitar a un nuevo usuario</a>.",
    "how-remove-user" : "<!--\ntitle: ¿Cómo se quita otro usuario?\ncontext: [dashboard]\n-->\n<p>Para quitar un usuario de una organización, debe ser un propietario de la organización.</p>\n<ol class=\"list\">\n    <li>\n        En el panel de control de la consola de VMC, haga clic en el icono de servicios de la esquina superior derecha de la ventana y seleccione <strong>Administración de identidad y acceso</strong>.\n    </li>\n    <li>Seleccione los usuarios que desee quitar.</li>\n    <li>\n        Haga clic en <strong>Quitar usuarios</strong>.\n    </li>\n    <li>\n        Haga clic en <strong>Quitar</strong> para confirmar la acción.\n    </li>\n</ol>\n<p>El usuario se quitará de la organización y no podrá acceder a los recursos de esta.</p>",
    "how-set-default-org" : "<!--\ntitle: ¿Cómo se establece la organización predeterminada?\ncontext: [dashboard]\n-->\n<p>Si es miembro de más de una organización, puede establecer su organización predeterminada. Esta será la que se muestre cuando inicie sesión.</p>\n<ol class=\"list\">\n    <li>En el panel de control de la consola de VMC, haga clic en su nombre de usuario y organización en la barra de herramientas.</li>\n    <li>\n        Haga clic en <strong>Establecer organización predeterminada</strong> y seleccione la organización que desee configurar como predeterminada.\n    </li>\n</ol>",
    "how-switch-language" : "<!--\ntitle: ¿Cómo se cambia el idioma que la consola de VMC utiliza?\ncontext: [dashboard]\nfeature: uiEnableLocalization\n-->\n<p>Para cambiar el idioma que utiliza VMware Cloud on AWS o cualquier otro servicio de nube de VMware, establezca la preferencia de idioma de la cuenta.</p>\n<ol class=\"list\">\n    <li>\n        En la consola de VMware Cloud Services, haga clic en el nombre de usuario y la organización en la barra de herramientas y seleccione <strong>Mi cuenta</strong>.\n    </li>\n    <li>\n        Haga clic en <strong>Preferencias</strong>.\n    </li>\n    <li>\n        Edite las opciones <strong>Idioma</strong> y <strong>Formato regional</strong>.\n    </li>\n</ol>",
    "invite-no-myvmware" : "<!--\ntitle: ¿Es posible invitar a un usuario que no tenga una cuenta de MyVMware?\ncontext: [dashboard, invite]\n-->\n\n<p>Sí. El usuario deberá crear una cuenta de MyVMware durante el proceso de registro.</p>",
    "ipsec-vpn-connection" : "<!--\ntitle: ¿Cómo se configura una conexión VPN de IPsec con la puerta de enlace de administración?\ncontext: [networking,vpn]\n-->\n<p>\n    La puerta de enlace de administración permite acceder a la infraestructura de administración del SDDC, incluidos los hosts ESXi, vCenter Server y NSX. Una VPN de IPsec ofrece conectividad de red de administración entre la puerta de enlace de administración y una red en el SDDC. Para crear una conexión VPN de IPsec, siga los pasos que se describen en <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-3A7090C5-836C-4DBA-9E69-A4A1D9B6F139.html\"\n        target=\"_blank\"\n    >Usar el asistente para la configuración de VPN de puerta de enlace de administración para configurar una VPN y una puerta de enlace de administración</a>.\n</li>\n",
    "log-intelligence" : "<!--\ntitle: ¿Qué es el complemento VMware vRealize Log Insight Cloud?\ncontext: [log-intelligence,addons]\nfeature: uiEnableLintAddon\n-->\n<p>\n    VMware vRealize Log Insight Cloud le permite recopilar y analizar los registros generados en el SDDC. Una versión de prueba del servicio está habilitada de forma predeterminada en un nuevo SDDC. Cuando un usuario de la organización accede al servicio, se inicia un período de prueba de treinta días. Después del período de prueba, puede optar por suscribirse a este servicio o seguir utilizando un subconjunto de funciones de servicio sin ningún coste adicional. Para obtener más información sobre el uso de VMware vRealize Log Insight Cloud, consulte la <a\n        href=\"https://docs.vmware.com/es/VMware-Log-Intelligence/index.html\"\n        target=\"_blank\"\n    >documentación de vRealize Log Insight Cloud</a>.\n</p>\n",
    "logical-network" : "<!--\ntitle: ¿Cómo se crea una red lógica?\ncontext: [networking,logical-network]\n-->\n<p>\n    Las redes lógicas otorgan acceso a la red a las máquinas virtuales de carga de trabajo. El SDDC comienza con una única red lógica predeterminada (sddc-cgw-network-1). Puede utilizar la instancia HTML5 de vSphere Client para crear redes lógicas adicionales. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_017\"\n        target=\"_blank\"\n    >Crear o modificar un segmento de red</a>.",
    "manage-vcenter-access" : "<!--\ntitle: ¿Cómo se administra el acceso a vCenter Server?\ncontext: [networking,firewall,vpn]\n-->\n<p>\n    De forma predeterminada, no se puede acceder del exterior al sistema vCenter Server en el SDDC. Para abrir el acceso al sistema vCenter Server, realice una de las opciones siguientes:\n</p>\n<ul class=\"list\">\n    <li>Configure una regla de firewall para permitir el acceso al sistema vCenter Server.</li>\n    <li>Configure una VPN de IPsec entre el centro de datos local y el SDDC.</li>\n</ul>\n<p>\n    Cuando configure una de estas opciones, haga clic en la pestaña <b>Configuración</b> para determinar cómo conectarse a vCenter Server mediante vSphere Client y PowerCLI.\n</p>\n",
    "management-compute-gateways" : "<!--\r\ntitle: ¿Qué son las puertas de enlace de administración y de cómputo?\r\ncontext: [networking]\r\n-->\r\n<p>\n    Cuando se implementa un SDDC con VMware Cloud on AWS, este se configura con dos redes: una red de administración y una red de cómputo. La red de administración procesa el tráfico de red para los hosts del SDDC, vCenter Server, NSX Manager y otras funciones de administración. La red de cómputo procesa el tráfico de red para la máquinas virtuales de carga de trabajo.\n</p>\r\n",
    "memory-running-out" : "<!--\ntitle: Me estoy quedando sin memoria. ¿Qué puedo hacer?\ncontext: [summary]\n-->\n<p>\n    Si puede agregar hosts y el SDDC no alcanzó la cantidad máxima de hosts, podrá agregar un host para aumentar la capacidad de memoria disponible. De lo contrario, apague cargas de trabajo o mígrelas fuera del SDDC.\n</p>",
    "nat" : "<!--\ntitle: ¿Cómo se configura NAT?\ncontext: [networking,nat]\n-->\n<p>\n    La traducción de direcciones de red (NAT) saliente se configura de forma predeterminada para la puerta de enlace de cómputo. La NAT entrante permite asignar el tráfico de Internet a un puerto y una dirección IP públicos, y a un puerto y una dirección IP privados dentro de la red de cómputo del SDDC. Para configurar la NAT entrante, consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/com.vmware.vmc-aws.networking-security/GUID-0C04B8A4-A880-4A8E-85A5-4720D3A30235.html\"\n        target=\"_blank\"\n    >Configurar los ajustes de NAT</a>.\n</p>\n",
    "preshared-key" : "<!--\r\ntitle: ¿Qué es una clave precompartida?\r\ncontext: [networking,vpn]\r\n-->\r\n<p>\n    Los dos extremos del túnel VPN de la puerta de enlace de administración usan la clave precompartida para autenticarse entre sí, de modo que la puerta de enlace del SDDC y la puerta de enlace local deben usar la misma clave. La clave admite 128 caracteres como máximo. Trate la clave precompartida como si fuese una contraseña: mantenga su confidencialidad y no use el correo electrónico u otros métodos no seguros para compartirla con otros usuarios.\n</p>\r\n",
    "public-ip" : "<!--\ntitle: ¿Cómo se administran las direcciones IP públicas?\ncontext: [networking,public-ip]\n-->\n<p>\n    Si hay una máquina virtual de carga de trabajo a la que debe acceder desde Internet de acceso público, solicite una dirección IP pública para ella. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_018\"\n        target=\"_blank\"\n    >Solicitar o liberar una dirección IP pública </a>.\n</p>",
    "recommended-cryptography" : "<!--\ntitle: ¿Cuál es la configuración de criptografía recomendada para las VPN de IPsec?\ncontext: [networking,vpn]\n-->\n<p>\n    El extremo local de cualquier VPN de IPsec debe configurarse para que coincida con los ajustes especificados para el extremo de SDDC de dicha VPN. Consulte la <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_019\"\n        target=\"_blank\"\n    >Referencia de la configuración de VPN de IPsec</a> para obtener información sobre la configuración disponible y los valores recomendados.\n</p>",
    "remove-host" : "<!--\ntitle: ¿Cómo se quitan hosts?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>\n    Puede quitar un host del SDDC siempre que se mantenga por encima del mínimo requerido. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_012\"\n        target=\"_blank\"\n    >Quitar hosts</a>.\n</p>\n",
    "sddc-can-i-add-hosts" : "<!--\ntitle: ¿Pueden agregarse hosts al SDDC más tarde?\ncontext: [create-sddc]\n-->\n<p>\n    Más tarde, podrá implementar hosts adicionales si el SDDC contiene menos hosts del máximo asignado a su organización.\n</p>\n",
    "sddc-groups" : "<!--\ntitle: ¿Qué es un grupo de SDDC?\ncontext: [create-sddc]\nfeature: uiEnableSddcGroups\n-->\n<p>Un grupo de implementación de SDDC conecta los SDDC y las VPC mediante VMware Transit Connect para proporcionar conexiones de ancho de banda elevado\ny latencia baja entre los SDDC del grupo y con otras VPC en la misma región. También puede agregar una puerta de enlace de\nDirect Connect (DXGW) para proporcionar conectividad centralizada a los SDDC locales. Un SDDC debe cumplir con varios\ncriterios para poder formar parte de un grupo:</p>\n<ul class=\"list\">\n    <li>Debe ser propiedad de la organización que posee el grupo.</li>\n    <li>Debe estar en la misma región de AWS que otros miembros del grupo.</li>\n    <li>Su bloque CIDR de red de administración no puede superponerse con el bloque CIDR de administración de ningún otro miembro del grupo.</li>\n    <li>No puede ser miembro de otro grupo de implementación de SDDC.</li>\n    <li>La versión del SDDC debe ser 1.11 o posterior.</li>\n</ul>\n<p>La conectividad de punto a punto entre los miembros del grupo de SDDC requiere una puerta de enlace de tránsito administrado de VMware (VTGW). Este es un recurso de\nAWS creado por VMware Transit Connect, del cual VMware es propietario y administrador. Al agregar el primer miembro a un grupo de SDDC,\nse crea uno de estos recursos y se lo asigna al grupo. La creación y el funcionamiento de una instancia de VTGW generan\ncargos adicionales en la factura de VMware Cloud on AWS.</p>\n<p>Para crear un grupo de SDDC:\n<ol class=\"list\">\n    <li>\nEn la pestaña Grupos de SDDC, haga clic en <strong>ACCIONES</strong> y seleccione <strong>Crear grupo de SDDC</strong>.\n    </li>\n    <li>\nAsigne un nombre y una descripción opcional en los campos <strong>Nombre</strong> y <strong>Descripción</strong>, y luego haga clic en <strong>SIGUIENTE</strong>.\n    </li>\n    <li>\nEn la cuadrícula <strong>Membresía</strong>, seleccione los SDDC que se incluirán como miembros del grupo. Tras seleccionar los miembros,\nhaga clic en <strong>SIGUIENTE</strong>.\n    </li>\n    <li>\nConfirme que comprende y asume la responsabilidad de los costes que se generan al crear un grupo de SDDC.\nA continuación, haga clic en <strong>CREAR GRUPO</strong> para crear el grupo de SDDC y la puerta de enlace de tránsito administrado de VMware.\n    </li>\n</ol>\n<p>\nLos cargos se aplican cuando hace clic en <strong>CREAR GRUPO</strong>. No se puede pausar ni cancelar el proceso una vez que se inicia.\nLos miembros del grupo no podrán usar VMware Transit Connect ni la instancia de VTGW hasta que se complete la implementación, la cual\nsuele tardar alrededor de quince minutos.\n</p>",
    "sddc-how-many-hosts" : "<!--\ntitle: ¿Cuántos hosts se pueden incluir en el SDDC?\ncontext: [create-sddc]\n-->\n<p>Un SDDC de inicio de host único se limita a un solo host hasta que lo escala de forma vertical. Otros SDDC comienzan con un mínimo de dos hosts y pueden escalarse de forma vertical hasta alcanzar un máximo de 16.</p>\n",
    "set-compute-dns" : "<!--\ntitle: ¿Cómo se configura el DNS para las redes de cómputo y administración?\ncontext: [networking, dns, system]\nfeature: enableNsxtDeployment\n-->\n<p>\n    El SDDC incluye zonas de DNS predeterminadas para la puerta de enlace de administración y de cálculo. Cada zona incluye un servicio de reenvío de DNS preconfigurado. Utilice la pestaña <strong>Servicios de DNS</strong> de la página Servicios de DNS para deshabilitar, habilitar o actualizar algunas propiedades de los servicios de reenvío de DNS para las zonas predeterminadas. Para crear zonas de DNS adicionales o configurar propiedades adicionales de reenviadores DNS en cualquier zona, utilice la pestaña <strong>Zonas de DNS</strong>. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_002\" target=\"_blank\"\n    >Agregar una zona de DNS</a> para obtener más información.\n</p>\n<ol class=\"list\">\n    <li>\n        Haga clic en <strong>DNS</strong> .\n    </li>\n    <li>\n        Haga clic en Servicios de DNS para abrir la pestaña Servicios de DNS.\n        <br>\n        Consulte <a\n            href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_025\" target=\"_blank\"\n        >Configurar servicios DNS</a> para obtener detalles sobre los parámetros del servicio de DNS.\n    </li>\n    <li>\n        Haga clic en <b>GUARDAR</b>.\n    </li>\n</ol>",
    "srm" : "<!--\ntitle: ¿Qué es el complemento de Site Recovery?\ncontext: [srm,addons]\nfeature: enableDRaaSAddOn\n-->\n<p>\n    VMware Site Recovery le permite realizar acciones automáticas de recuperación ante desastres de máquinas virtuales del centro de datos local al SDDC. Para obtener más información, consulte la <a\n        href=\"https://docs.vmware.com/es/VMware-Site-Recovery/index.html\"\n        target=\"_blank\"\n    >documentación de VMware Site Recovery</a>.\n</p>\n",
    "storage-running-out" : "<!--\ntitle: Me estoy quedando sin espacio de almacenamiento. ¿Qué puedo hacer?\ncontext: [summary]\n-->\n<p>\n    Si puede agregar hosts y el SDDC no alcanzó la cantidad máxima de hosts, podrá agregar un host para aumentar la capacidad de almacenamiento disponible. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_010\"\n        target=\"_blank\"\n    >Agregar hosts</a>. De lo contrario, apague cargas de trabajo o mígrelas fuera del SDDC. </p>",
    "undefined" : "<!--\ntitle: ¿Cómo se agregan hosts adicionales?\ncontext: [summary,create-sddc,dashboard]\n-->\n<p>Puede agregar un host si el SDDC contiene menos hosts que el máximo permitido. Si no ve la opción <b>Agregar hosts</b> en el menú <b>Acciones</b>, póngase en contacto con VMware.</p>\n    \n<p>Para agregar un host:</p>\n<ol class=\"list\">\n    <li>Vaya a la pestaña <b>Resumen</b> para ver el SDDC.</li>\n    <li>Seleccione <b>Acciones</b> &gt <b>Agregar hosts</b>.</li>\n    <li>Seleccione la cantidad de hosts que desee agregar.</li>\n    <li>Haga clic en <b>Agregar hosts</b>.</li>\n</ol>\n<p>Es posible que se tarde varios minutos en cambiar el tamaño del SDDC. Mientras se agregan los hosts, las cargas de trabajo y vCenter Server seguirán funcionando con normalidad, pero no podrá iniciar otras acciones de adición o eliminación de hosts.</p>\n",
    "vms-cant-reach-internet" : "<!--\ntitle: ¿Por qué las máquinas virtuales no pueden acceder a Internet?\ncontext: [networking,firewall]\n-->\n<p>\n    Las reglas de firewall de puerta de enlace de cálculo predeterminadas impiden que todo el tráfico de las máquinas virtuales llegue a Internet. Para permitir que las máquinas virtuales accedan a Internet, debe crear una regla de firewall de puerta de enlace de cálculo a fin de permitir el tráfico saliente en la red lógica a la que está conectada la máquina virtual. Consulte <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_020\"\n        target=\"_blank\"\n    >Agregar o modificar reglas de firewall de puerta de enlace de cálculo</a>.\n</p>",
    "what-can-i-do" : "<!--\ntitle: ¿Qué se puede hacer en Launchpad?\ncontext: [launchpad]\n-->\n<p>VMware Cloud Launchpad es un punto de partida consolidado para todas las soluciones de infraestructura de nube híbrida de VMware,\nasí como de las soluciones relacionadas. Puede utilizar los vínculos de esta página para comenzar a utilizar las soluciones de migración, examinar VMware Tanzu\nKubernetes Grid o empezar a crear la infraestructura que necesita para los próximos pasos de su travesía a la nube.</p>\n<p>\nPuede obtener más información sobre Launchpad en <a\n        href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_036\" target=\"_blank\"\n    >VMware Docs</a>.\n</p>",
    "what-happens-when-i-delete" : "<!--\ntitle: ¿Qué ocurre cuando se elimina un SDDC?\ncontext: [dashboard]\n-->\n<p>Cuando se elimina un SDDC:</p>\n<ul class=\"list\">\n    <li>Se finalizan todas las cargas de trabajo del SDDC.</li>\n    <li>Se eliminan todos los datos y las opciones de configuración del SDDC.</li>\n    <li>Se pierde todo el acceso de interfaz de usuario y API al SDDC.</li>\n    <li>Se liberan todas las direcciones IP públicas del SDDC.</li>\n    <li>Se eliminan todas las interfaces virtuales de Direct Connect en el SDDC.</li>\n</ul>\n<p>Antes de eliminar un SDDC, migre las máquinas virtuales de carga de trabajo y los datos esenciales, o bien cree una copia de seguridad de estos.</p>\n",
    "what-is-connected-amazon-vpc" : "<!--\ntitle: ¿Qué es el Amazon VPC conectado?\ncontext: [networking]\n-->\n<p>\n    Durante la creación del SDDC, puede conectar el SDDC a una cuenta de AWS, y seleccionar una VPC y una subred en dicha cuenta. Si usa una plantilla de CloudFormation, VMware Cloud on AWS creará una interfaz de red flexible (ENI) de AWS, lo que permitirá que el SDDC y los servicios de Amazon VPC y la subred de la cuenta de AWS se comuniquen sin necesidad de enrutar el tráfico a través de la puerta de enlace de Internet. Solo puede conectar un SDDC a cada instancia de Amazon VPC.\n</p>\n<p>\n    Para ver la información de la instancia de Amazon VPC conectada (como el identificador de cuenta, el identificador de VPC y la subred), haga clic en <b>VPC conectado</b> en la categoría <b>Sistema</b> de la pestaña <b>Redes y seguridad</b>.\n</p>\n",
    "what-is-direct-connect" : "<!--\ntitle: ¿Qué es Amazon Direct Connect?\ncontext: [networking, virtual-interfaces]\nfeature: directConnect\n-->\n<p>\n    <a href=\"https://aws.amazon.com/directconnect/\">AWS Direct Connect</a> es un servicio proporcionado por AWS que le permite crear una conexión de red dedicada de alta velocidad y baja latencia entre el centro de datos local y una ubicación de AWS Direct Connect. Puede acceder a Direct Connect a través de una interfaz virtual privada que cree en la consola de AWS. En un SDDC con redes respaldadas por NSX-T, todo el tráfico de Direct Connect (incluidos el tráfico de administración, el tráfico de puerta de enlace de cálculo y vMotion) utiliza una interfaz virtual privada.\n</p>\n",
    "what-is-preview" : "<!--\ntitle: ¿Cuáles son las funciones de Vista previa?\ncontext: [dashboard]\n-->\n<p>\n    En la vista previa se incluyeron funciones que permiten recoger comentarios. Estas funciones se marcan con el icono <b>Vista previa</b> en la interfaz de usuario. Puede que estas no estén disponibles para todos los clientes ni en todas las regiones de AWS. No podemos garantizar que las funciones en una \"Vista previa\" estarán disponibles en un periodo de tiempo concreto (ni si finalmente lo estarán). Base su decisión de compra únicamente en las funciones disponibles.\n</p>",
    "what-is-traffic-group" : "<!--\ntitle: ¿Qué es un grupo de tráfico?\ncontext: [networking, virtual-interfaces]\nfeature: uiEnableSddcGroups\n-->\n<p>\n    En la configuración predeterminada, su red de SDDC tiene un único enrutador de Edge a través del cual fluye todo el tráfico de norte\n     a sur. Para proporcionar ancho de banda adicional para un subconjunto de este tráfico, puede crear uno o varios grupos de tráfico, cada uno\n     de los cuales crea un enrutador de Edge adicional y, a continuación, crear una lista de bloques CIDR que desea enrutar a través del\n    nuevo enrutador de Edge. Consulte <a href=\"https://docs.vmware.com/es/VMware-Cloud-on-AWS/services/context?id=vmc_037\"\n        target=\"_blank\"\n    >Agregar grupos de tráfico para aumentar el ancho de banda de Edge</a> para obtener más información sobre la creación y la administración de grupos de tráfico.\n</p>\n",
    "what-languages" : "<!--\ntitle: ¿Qué idiomas se admiten en la interfaz de usuario de la consola de VMC?\ncontext: [dashboard]\nfeature: uiEnableLocalization\n-->\n<p>La consola de VMware Cloud on AWS se ofrece en inglés, francés, alemán, japonés, coreano, español, chino simplificado y chino tradicional.</p>\n<p>Para cambiar el idioma que utiliza VMware Cloud on AWS o cualquier otro servicio de nube de VMware, establezca la preferencia de idioma de la cuenta.</p>\n<ol class=\"list\">\n    <li>\n        En la consola de VMware Cloud Services, haga clic en el nombre de usuario y la organización en la barra de herramientas y seleccione <strong>Mi cuenta</strong>.\n    </li>\n    <li>\n        Haga clic en <strong>Preferencias</strong>.\n    </li>\n    <li>\n        Edite las opciones <strong>Idioma</strong> y <strong>Formato regional</strong>.\n    </li>\n</ol>\n"
  }
}