{
  "component" : "vmw-migration",
  "locale" : "es",
  "messages" : {
    "migration.resource-content.video-poster-img-alt-txt" : "Vídeo de demostración",
    "migration.task.detail.compute-ip-range" : "Para aprovisionar cargas de trabajo informáticas en el SDDC, debe crear al menos un segmento de red informática. Si bien el aprovisionamiento de un SDDC no es obligatorio, VMware recomienda asignar al menos un rango de direcciones IP para la red informática del SDDC. Después de aprovisionar el SDDC, puede crear un segmento de red con este rango de direcciones.",
    "migration.task.detail.create-sddc-step-2" : "El número y el tipo de hosts que se implementarán",
    "migration.task.detail.create-sddc-step-3" : "Si desea crear un clúster en una sola zona de disponibilidad o un clúster ampliado que abarque varias zonas de disponibilidad",
    "migration.task.detail.move-back" : "Revertir",
    "migration.task.detail.prepare-network-ranges" : "Al crear un SDDC, debe especificar un rango de direcciones IP para la red de administración. Este rango de direcciones IP no puede cambiarse después de crear el SDDC. Por ello, es fundamental que planifique cuidadosamente este rango de direcciones IP.",
    "migration.task.detail.size-consideration" : "El rango debe ser lo suficientemente amplio para facilitar todos los hosts que se implementarán el primer día, pero también debe tener en cuenta el crecimiento futuro",
    "task-detail.direct-connect-description-5" : "Consulte la documentación para obtener más información sobre la configuración de Direct Connect.",
    "vmc-migration-journey.browser-title" : "Trayecto de migración",
    "vmc-migration-journey.cancel" : "cancelar",
    "vmc-migration-journey.get-started" : "comenzar",
    "vmc-migration-journey.reset" : "Restablecer",
    "vmc-migration-journey.reset-btn-txt" : "Restablecer",
    "vmc-migration-journey.reset-confirmation" : "Esta acción borrará el progreso y establecerá el estado de cada paso como 'No iniciado'. Esta acción no se puede deshacer. ¿Seguro que desea restablecer todas las tareas?",
    "vmc-migration-journey.reset-err-alert-desc" : "No se pudo restablecer el estado de todas las tareas. Vuelva a intentarlo.",
    "vmc-migration-journey.reset-err-alert-title" : "Error en el restablecimiento.",
    "vmc-migration-journey.reset-modal.reset-confirmation" : "Esta acción borrará el progreso y establecerá el estado de cada paso como 'No iniciado'. Esta acción no se puede deshacer. ¿Seguro que desea restablecer todas las tareas?",
    "vmc-migration-journey.reset-modal.reset-tasks" : "Restablecer todas las tareas",
    "vmc-migration-journey.reset-success-alert-desc" : "El estado de todas las tareas se restableció correctamente.",
    "vmc-migration-journey.reset-success-alert-title" : "Restablecimiento correcto.",
    "vmc-migration-journey.reset-tasks" : "Restablecer todas las tareas",
    "vmc-migration-journey.reset-tracking" : "Para reiniciar la migración, haga clic en <strong>Restablecer</strong>. Esta acción borrará el progreso y establecerá el estado de\n cada paso en \"No iniciado\".\n    ",
    "vmc-migration-journey.title" : "Este es el primer paso de la migración",
    "vmc-migration-journey.view-details" : "Ver detalles",
    "vmc-migration-overview.browser-title" : "Descripción general de la migración",
    "vmc-migration-overview.build-cloud-environment" : "Crear el entorno de nube",
    "vmc-migration-overview.build-overview" : "En la etapa de creación, creará la infraestructura de VMware Cloud on AWS en función de las necesidades determinadas en la fase de planificación. Creará un SDDC en la nube y lo configurará para que pueda ejecutar las cargas de trabajo.",
    "vmc-migration-overview.getting-started" : "Comenzar",
    "vmc-migration-overview.migrate-overview" : "En la etapa de migración, configurará HCX y establecerá un túnel que se utilizará para migrar las cargas de trabajo. Asimismo, probará el resultado de la migración con los usuarios de la aplicación. Tras finalizar esta etapa, las máquinas virtuales se habrán migrado correctamente del centro de datos local a VMware Cloud on AWS.",
    "vmc-migration-overview.migrate-your-workloads" : "Migrar las cargas de trabajo",
    "vmc-migration-overview.plan-overview" : "En la etapa de planificación, obtendrá información sobre la plataforma de VMware Cloud on AWS, evaluará el tamaño de las cargas de trabajo locales y determinará las redes, la seguridad y otros recursos necesarios para admitir dichas cargas de trabajo. Esta información le permitirá determinar el tamaño y la configuración de la infraestructura de VMware Cloud on AWS. La planificación es una etapa muy importante, ya que sienta las bases de la migración.",
    "vmc-migration-overview.plan-your-migration" : "Planifique la migración",
    "vmc-migration-overview.sub-title" : "Una guía de migración detallada para el proyecto de migración de centros de datos a VMware Cloud on AWS.",
    "vmc-migration-overview.technical-overview" : "Descripción general técnica",
    "vmc-migration-overview.technical-overview-stage-description" : "En cada paso del proceso, la solución VMware Cloud Migration proporciona instrucciones, herramientas y vínculos a información adicional que se necesita para completar la migración. También se puede utilizar la solución Migration para realizar un seguimiento del progreso a medida que se completa cada paso. Al final de este proceso guiado, se habrán migrado correctamente las máquinas virtuales del centro de datos local a VMware Cloud on AWS.",
    "vmc-migration-overview.technical-overview-stages" : "La solución VMware Cloud Migration lo guiará en la migración de máquinas virtuales desde el centro de datos local hasta VMware Cloud on AWS. El proceso de migración incluye tres etapas: planificar, compilar y migrar. Cada etapa se divide en una serie de pasos sucesivos que lo guiarán a través de una migración exitosa.",
    "vmc-migration-overview.title" : "Migración",
    "vmc-migration-resource-content.demo-videos.introduction" : "Aprenda cómo se pueden migrar las cargas de trabajo a un SDDC de VMware Cloud on AWS.",
    "vmc-migration-resource-content.demo-videos.page-title" : "Videos de demostración: Migración",
    "vmc-migration-resource-content.office-hours.introduction" : "Póngase en contacto en horario laboral con el equipo de consecución del cliente de VMware para responder a sus preguntas sobre la migración",
    "vmc-migration-resource-content.office-hours.page-title" : "Horario laboral: Migración",
    "vmc-migration-resource-content.past-sessions" : "ver sesiones pasadas",
    "vmc-migration-resource-content.play-video" : "Reproducir video: guía del profesional",
    "vmc-migration-resource-content.quick-reference.btn-txt" : "ver referencia",
    "vmc-migration-resource-content.quick-reference.introduction" : "Esta guía de referencia rápida proporciona a los profesionales importantes consideraciones que se deben tener en cuenta antes, durante y después de una migración en la nube.",
    "vmc-migration-resource-content.quick-reference.page-title" : "Referencia rápida del profesional para la migración en la nube\n            ",
    "vmc-migration-resource-content.reference-architecture.btn-txt" : "ver arquitectura",
    "vmc-migration-resource-content.reference-architecture.introduction" : "La arquitectura de referencia proporciona instrucciones generales para iniciar la implementación de aplicaciones híbridas estándar en VMware Cloud on AWS a las que pueden acceder los usuarios locales.",
    "vmc-migration-resource-content.reference-architecture.page-title" : "Arquitectura de referencia: Migración de nube con VMware Cloud on AWS",
    "vmc-migration-resource-content.register-session" : "registrarse para una sesión",
    "vmc-migration-resource-content.solution-brief.btn-txt" : "ver resumen de la solución",
    "vmc-migration-resource-content.solution-brief.introduction" : "En este resumen de la solución, se explican los desafíos de la migración en la nube, el modo en que VMware Cloud on AWS resuelve esos desafíos y las capacidades clave de VMware Cloud on AWS específicas para los casos prácticos de la migración en la nube.",
    "vmc-migration-resource-content.solution-brief.page-title" : "Resumen de la solución: Migración en la nube con VMware Cloud on AWS",
    "vmc-migration-resource-content.view-more" : "ver más",
    "vmc-migration-resource-content.whitepapers.btn-txt" : "ver el documento técnico",
    "vmc-migration-resource-content.whitepapers.introduction" : "En este documento técnico se describen la nube híbrida, sus\n                 casos prácticos y sus oportunidades, así como sus desafíos y\n                  la manera en la que VMware Cloud on AWS los enfrenta.\n            ",
    "vmc-migration-resource-content.whitepapers.page-title" : "Documento técnico: Nube híbrida con migración y VMware Cloud on AWS",
    "vmc-migration-resources.browser-title" : "Recursos de migración",
    "vmc-migration-resources.demo-videos" : "Videos de demostración",
    "vmc-migration-resources.office-hours" : "Horario laboral",
    "vmc-migration-resources.quick-reference" : "Referencia rápida del profesional",
    "vmc-migration-resources.reference-architecture" : "Arquitectura de referencia",
    "vmc-migration-resources.solution-brief" : "Resumen de la solución",
    "vmc-migration-resources.whitepapers" : "Documentos técnicos",
    "vmc-migration-stage-detail.action" : "Acción",
    "vmc-migration-stage-detail.back" : "atrás",
    "vmc-migration-stage-detail.browser-title.build" : "Crear entorno de nube",
    "vmc-migration-stage-detail.browser-title.migrate" : "Migrar a la nube",
    "vmc-migration-stage-detail.browser-title.plan" : "Planificar migración",
    "vmc-migration-stage-detail.build-what-next" : "En la siguiente etapa, el objetivo es migrar las cargas de trabajo a VMware Cloud on AWS. Al final de la etapa, las cargas de trabajo se habrán migrado y se ejecutarán en el SDDC en VMware Cloud on AWS.",
    "vmc-migration-stage-detail.cancel" : "Cancelar",
    "vmc-migration-stage-detail.dont-ask-me-again" : "No volver a preguntarme.",
    "vmc-migration-stage-detail.error" : "Error: No se pudo completar la operación.",
    "vmc-migration-stage-detail.fetching-data" : "Recuperando datos",
    "vmc-migration-stage-detail.go-back-to-journey" : "volver a la página del recorrido",
    "vmc-migration-stage-detail.go-to-next-phase" : "Ir a la etapa {0}",
    "vmc-migration-stage-detail.log-in" : "Iniciar sesión",
    "vmc-migration-stage-detail.login-description" : "Debe iniciar sesión en VMware Cloud Services para guardar el progreso.",
    "vmc-migration-stage-detail.login-required" : "Inicio de sesión obligatorio",
    "vmc-migration-stage-detail.migration-task" : "Tarea de migración",
    "vmc-migration-stage-detail.not-yet" : "Todavía no",
    "vmc-migration-stage-detail.plan-what-next" : "En la siguiente etapa, el objetivo es compilar y configurar el SDDC de VMware Cloud on AWS. Al final de la etapa, habrá creado un entorno de nube con la conectividad de red deseada, un panel centralizado de administración y acceso al entorno de nube.",
    "vmc-migration-stage-detail.request-access-moadal.description" : "Para comenzar a utilizar VMware Cloud on AWS en la organización, debe solicitar acceso en las páginas de marketing de productos de VMware Cloud.",
    "vmc-migration-stage-detail.request-access-moadal.learn-more-btn" : "Más información",
    "vmc-migration-stage-detail.request-access-moadal.title" : "Solicitar acceso a VMware Cloud on AWS",
    "vmc-migration-stage-detail.required-modal.cancel-btn-text" : "Cancelar",
    "vmc-migration-stage-detail.required-modal.description" : "Debe iniciar sesión para guardar el progreso.",
    "vmc-migration-stage-detail.required-modal.submit-btn-text" : "Iniciar sesión",
    "vmc-migration-stage-detail.required-modal.title" : "Es necesario iniciar sesión",
    "vmc-migration-stage-detail.status" : "Estado",
    "vmc-migration-stage-detail.success-build" : "Buen trabajo al comprobar todos los elementos de la etapa de compilación. Ahora tiene que continuar con la siguiente fase del recorrido.",
    "vmc-migration-stage-detail.success-migrate" : "¡Felicitaciones! Ahora ya debería haber terminado el proyecto de migración del centro de datos.",
    "vmc-migration-stage-detail.success-plan" : "Buen trabajo al comprobar todos los elementos de la etapa de planificación. Ahora tiene que continuar con la siguiente fase del recorrido.",
    "vmc-migration-stage-detail.task" : "Tarea",
    "vmc-migration-stage-detail.track-any-way" : "Realizar el seguimiento de todos modos",
    "vmc-migration-stage-detail.tracking-alert" : "Alerta de seguimiento",
    "vmc-migration-stage-detail.tracking-alert-description" : "No se completaron todos los pasos anteriores. ¿Desea iniciar el seguimiento de este paso?",
    "vmc-migration-stage-detail.updated" : "Actualizados",
    "vmc-migration-stage-detail.whats-next" : "Próximos pasos",
    "vmc-migration-status-badge.completed" : "Completada",
    "vmc-migration-status-badge.in-progress" : "En curso",
    "vmc-migration-status-badge.not-started" : "No iniciada",
    "vmc-migration-status-badge.skipped" : "Omitida",
    "vmc-migration-status-dropdown.change-status" : "Cambiar estado",
    "vmc-migration-status-dropdown.change-status-for" : "Cambiar el estado de la tarea actual",
    "vmc-migration-status-dropdown.completed" : "Completada",
    "vmc-migration-status-dropdown.in-progress" : "En curso",
    "vmc-migration-status-dropdown.not-started" : "No iniciada",
    "vmc-migration-status-dropdown.set-status-to" : "Establecer estado como",
    "vmc-migration-status-dropdown.skipped" : "Omitida",
    "vmc-migration-task-detail.access-aws" : "¿Cómo se accede a los servicios de AWS?",
    "vmc-migration-task-detail.account-creation" : "Creación y administración de cuentas de VMware",
    "vmc-migration-task-detail.analyze-network-description-1" : "Opcionalmente, puede utilizar vRealize Network Insight Cloud para ayudarle a identificar dependencias de red de máquinas virtuales. Omita este paso si ya sabe cuáles son las máquinas virtuales que desea migrar a VMware Cloud on AWS.",
    "vmc-migration-task-detail.analyze-network-description-2" : "La asignación de dependencias de red muestra las máquinas virtuales que se comunican entre sí. Las máquinas virtuales que se comunican deben migrarse juntas para evitar cargos de tráfico de red, latencias y otros problemas de rendimiento.",
    "vmc-migration-task-detail.analyze-network-description-3" : "Determine la asignación de dependencias de red mediante el servicio vRealize Network Insight Cloud. vRealize Network Insight Cloud es un servicio de nube que le proporciona una vista detallada de la red y le permite crear una infraestructura de red segura, altamente disponible y optimizada en entornos de varias nubes.",
    "vmc-migration-task-detail.analyze-on-premises-workload-description-1" : "La migración a la nube suele ser un proceso iterativo y debe realizarse en \"oleadas\" (es decir, en grupos de máquinas virtuales que se migran al mismo tiempo). Identifique las cargas de trabajo que se migrarán a la nube y asígneles categorías en función de la facilidad con la que pueden migrarse. Por ejemplo, las cargas de trabajo provisionales o de desarrollo pueden considerarse \"fáciles\" puesto que suelen ser menos esenciales para la producción. Las cargas de trabajo grandes o con muchas E/S (como las bases de datos) podrían ser más difíciles de mover y se deben migrar en último lugar. Al categorizar las cargas de trabajo, puede que sea útil recopilar y revisar las métricas de E/S de almacenamiento y de red de todas las máquinas virtuales que se van a migrar. Estas métricas serán útiles durante el proceso de planificación de oleadas. ",
    "vmc-migration-task-detail.analyze-on-premises-workload-description-2" : "Una vez que identifique las máquinas virtuales que se migrarán y las agrupe en oleadas de migración, el siguiente paso consistirá en calcular los requisitos informáticos, de almacenamiento y de memoria totales de todas las máquinas virtuales. Esta información se requiere para determinar el número de hosts que se necesita para el SDDC de VMware Cloud on AWS.",
    "vmc-migration-task-detail.aws-direct-connect" : "AWS Direct Connect",
    "vmc-migration-task-detail.aws-vi" : "Qué son las interfaces virtuales de AWS Direct Connect",
    "vmc-migration-task-detail.back-to-choose" : "VOLVER A LA OPCIÓN DE SELECCIÓN DE RED",
    "vmc-migration-task-detail.boarding-handbook" : "Manual de incorporación a VMware Cloud",
    "vmc-migration-task-detail.boarding-presentation" : "Presentación de incorporación a VMware Cloud",
    "vmc-migration-task-detail.choose-method" : "Seleccione el método que mejor se adapte al entorno:",
    "vmc-migration-task-detail.compute-gateway" : "¿Cómo se agrega una zona de DNS de puerta de enlace de cómputo?",
    "vmc-migration-task-detail.configure-aws-connectivity" : "Además de la VPC de AWS con vínculos cruzados que se especificó al crear el SDDC, también puede conectarse a recursos de AWS que formen parte de otras VPC. Si bien la estrategia exacta utilizada para esta conectividad varía según el cliente, las más utilizadas son las siguientes:",
    "vmc-migration-task-detail.configure-aws-connectivity-direct-via-ip-sec" : "Directamente a través de IPsec: es posible establecer una VPN de IPsec directamente a una VGW dentro de una VPC. Esta estrategia es útil para conectarse a un número reducido de VPC.",
    "vmc-migration-task-detail.configure-aws-dc" : "Configurar AWS Direct Connect para VMware Cloud on AWS",
    "vmc-migration-task-detail.configure-hybrid-cloud-extension-description-1" : "VMware HCX (conocido anteriormente como Hybrid Cloud Extension y NSX Hybrid Connect) ofrece el mejor rendimiento en la migración de cargas de trabajo a VMware Cloud on AWS. HCX es una oferta de SaaS que proporciona movilidad de aplicaciones e hibridez de infraestructuras en diferentes versiones de vSphere (locales y en la nube). Es gratuito para todos los clientes VMware Cloud on AWS.",
    "vmc-migration-task-detail.configure-hybrid-cloud-extension-description-2" : "La migración correcta de cargas de trabajo al SDDC requiere un poco de planificación. Este proceso, conocido como \"planificación de oleadas\", permitirá garantizar una migración correcta y sin problemas a VMware Cloud on AWS.",
    "vmc-migration-task-detail.configure-network-description" : "Después de implementar el SDDC en la nube, acceda a la consola de VMC y configure la red del SDDC. Puede elegir AWS Direct Connect o la VPN de IPsec, o bien puede conectarse a través de la Internet pública. Consulte la etapa de planificación para obtener más información sobre estas opciones.",
    "vmc-migration-task-detail.configure-vpn" : "¿Cómo se configura una conexión VPN?",
    "vmc-migration-task-detail.cpu-utilization" : "Uso de CPU",
    "vmc-migration-task-detail.create-sddc" : "¿Cómo se crea un SDDC en VMware Cloud on AWS?",
    "vmc-migration-task-detail.create-sddc-description-1" : "Un centro de datos definido por software es una unidad de capacidad en la que se pueden ejecutar las cargas de trabajo. Con la información recopilada en el paso anterior, puede crear el SDDC en VMware Cloud on AWS.",
    "vmc-migration-task-detail.create-sddc-description-2" : "Al crear el SDDC, tenga en cuenta lo siguiente:",
    "vmc-migration-task-detail.create-sddc-step-1" : "La región en la que desea implementar el SDDC",
    "vmc-migration-task-detail.create-vmc-on-aws-account-description-1" : "Las cuentas de VMware Cloud on AWS se basan en una o varias organizaciones. Inicie sesión en la cuenta de VMware o cree una.",
    "vmc-migration-task-detail.create-vmc-on-aws-account-description-2" : "Cree un método de pago para VMware Cloud on AWS y, si lo desea, cree una suscripción. Las suscripciones le permiten ahorrar dinero, ya que usted se compromete a comprar una determinada cantidad de capacidad durante un período definido.",
    "vmc-migration-task-detail.deploy-hcx-console" : "Implementar VMware HCX Cloud desde la consola de VMC",
    "vmc-migration-task-detail.direct-connect" : "Direct Connect: si se utiliza Direct Connect, es posible transitar entre las VPC mediante Direct Connect.",
    "vmc-migration-task-detail.direct-connect-aws" : "Qué es Direct Connect en AWS",
    "vmc-migration-task-detail.direct-connect-description-1" : "Los SDDC de VMware Cloud on AWS pueden utilizar una o varias conexiones de Direct Connect que existan en la cuenta de AWS que pertenece al cliente. Una vez que se aprovisione una conexión de Direct Connect, puede crear una VIF privada y asignarla a la cuenta de AWS que pertenece a VMware que se creó para la organización de VMware Cloud Services. Este número de cuenta puede verse en la consola de VMC en el componente de interfaz de usuario de Direct Connect de un SDDC",
    "vmc-migration-task-detail.direct-connect-description-2" : "Para integrar Direct Connect, necesitará los siguientes elementos:",
    "vmc-migration-task-detail.direct-connect-description-3" : "Un rango de direcciones IP para la VIF privada. Para esto se suele utilizar el valor /30 del rango local de vínculo de IPv4 (168.254.x.x).",
    "vmc-migration-task-detail.direct-connect-description-4" : "Un número de sistema autónomo (ASN) de BGP para el lado local de la conexión y para el SDDC.",
    "vmc-migration-task-detail.download-hlm-gateway-1" : "Descargue vCenter Cloud Gateway Appliance si desea vincular la instancia de vCenter de VMware Cloud on AWS con el dominio local de vCenter Single Sign-On mediante Hybrid Linked Mode. Hybrid Linked Mode le permite ver y administrar el SDDC en la nube y el centro de datos local desde la misma interfaz y facilita la supervisión del progreso de tareas como la migración.",
    "vmc-migration-task-detail.download-hlm-gateway-2" : "Para configurar Hybrid Linked Mode, debe implementar vCenter Cloud Gateway Appliance en el centro de datos local y proporcionarle las credenciales de vCenter Single Sign-On. A continuación, debe vincular vCenter Cloud Gateway Appliance al SDDC en la nube.",
    "vmc-migration-task-detail.enable-log-intelligence" : "vRealize Log Insight Cloud ofrece un servicio de solución de problemas y análisis de registros totalmente administrado e integrado. Este servicio se recomienda para habilitar la visibilidad en el entorno de VMware Cloud on AWS.",
    "vmc-migration-task-detail.etc" : "Etcétera",
    "vmc-migration-task-detail.firewall-rule" : "¿Cómo se configuran las reglas de firewall para la puerta de enlace de administración?",
    "vmc-migration-task-detail.gateway-appliance" : "Descargar Cloud Gateway Appliance",
    "vmc-migration-task-detail.get-instruction" : "Obtener instrucciones",
    "vmc-migration-task-detail.get-started" : "Comenzar",
    "vmc-migration-task-detail.get-to-know-vmc" : "VMware Cloud on AWS le permite crear una nube basada en vSphere en la infraestructura de AWS. Revise los documentos relacionados para obtener información sobre el proceso de incorporación.",
    "vmc-migration-task-detail.get-to-know-vmc-description-1" : "VMware Cloud on AWS le permite crear una nube basada en vSphere en la infraestructura de AWS. Revise los documentos relacionados para obtener información sobre la incorporación.",
    "vmc-migration-task-detail.get-to-know-vmc-description-2" : "Antes de continuar al siguiente paso, debe realizar lo siguiente:",
    "vmc-migration-task-detail.get-to-know-vmc-description-3" : "Conozca los componentes básicos de un SDDC de VMware Cloud on AWS, lo que incluye vSphere, vSAN y NSX-T.",
    "vmc-migration-task-detail.get-to-know-vmc-description-4" : "Comprenda el propósito de una cuenta de organización e identifique al usuario que creará la cuenta de organización.",
    "vmc-migration-task-detail.get-to-know-vmc-description-5" : "Comprenda el propósito de la cuenta de cliente de AWS y el proceso de vincularla al SDDC de VMware Cloud on AWS.",
    "vmc-migration-task-detail.hcx-aws" : "VMware HCX en VMware Cloud on AWS",
    "vmc-migration-task-detail.hcx-deployment" : "Planificar implementaciones de VMware HCX de privadas a públicas",
    "vmc-migration-task-detail.hcx-direct-connect" : "Configurar VMware HCX para Direct Connect",
    "vmc-migration-task-detail.hcx-networking" : "Descripción general de las redes de VMware HCX",
    "vmc-migration-task-detail.hcx-overview" : "Descripción general de VMware HCX",
    "vmc-migration-task-detail.hub-and-spoke" : "Hub-radio: para interconectar grandes cantidades de VPC, a menudo resulta útil emplear un diseño de VPC de tránsito o de puerta de enlace de tránsito.",
    "vmc-migration-task-detail.hybrid-link-mode" : "¿Cómo se configura el modo vinculado híbrido?",
    "vmc-migration-task-detail.identify-compute-ip-range" : "Identificar rangos de direcciones IP informáticos del SDDC",
    "vmc-migration-task-detail.ip-range" : "¿Cómo se identifica el rango de IP de administración de SDDC al crear un SDDC?",
    "vmc-migration-task-detail.ipsec-vpn" : "VPN de IPsec",
    "vmc-migration-task-detail.ipsec-vpn-description-1" : "La VPN de IPsec puede utilizarse como un medio para proporcionar una conexión cifrada a un SDDC de VMware Cloud on AWS. Si bien se admiten VPN basadas en directivas y en rutas, se recomienda la VPN basada en rutas debido a su flexibilidad.",
    "vmc-migration-task-detail.ipsec-vpn-description-2" : "Para configurar una VPN de IPsec basada en rutas, necesitará los siguientes elementos:",
    "vmc-migration-task-detail.ipsec-vpn-description-3" : "Un rango de direcciones IP para la interfaz de túnel virtual (VTI). Para esto se suele utilizar el valor /30 del rango local de vínculo de IPv4 (168.254.x.x).",
    "vmc-migration-task-detail.ipsec-vpn-description-4" : "Un número de sistema autónomo (ASN) de BGP para el lado local de la conexión y para el SDDC.",
    "vmc-migration-task-detail.ipsec-vpn-description-5" : "Consulte la documentación para obtener más información sobre la configuración de la VPN de IPsec.",
    "vmc-migration-task-detail.launch-vmc-sizer" : "Iniciar VMC Sizer",
    "vmc-migration-task-detail.launch-vmware-cloud-on-aws" : "Iniciar VMware Cloud on AWS",
    "vmc-migration-task-detail.launch-vrealize-log" : "Iniciar vRealize Log Insight Cloud",
    "vmc-migration-task-detail.management-ip-range" : "Identificar el rango de direcciones IP de administración del SDDC",
    "vmc-migration-task-detail.mark-as-completed" : "Marcar como completado",
    "vmc-migration-task-detail.memory-utilization" : "Utilización de memoria",
    "vmc-migration-task-detail.migrate-by-wave" : "Después de instalar y probar por completo HCX, puede empezar a migrar cargas de trabajo. Las migraciones deben realizarse en oleadas, las cuales deben incluir validación y pruebas del usuario final para garantizar que cada fase de la migración se realice correctamente.",
    "vmc-migration-task-detail.migrate-vm-hcx" : "Migrar máquinas virtuales con VMware HCX",
    "vmc-migration-task-detail.network-segment" : "¿Cómo se crea un segmento de red?",
    "vmc-migration-task-detail.prepare-aws-resources-description-1" : "La creación de un SDDC de VMware Cloud on AWS requiere que establezca un vínculo con una cuenta de AWS que pertenece a un cliente. A continuación se presentan algunos puntos importantes sobre la cuenta de AWS que pertenece a un cliente:",
    "vmc-migration-task-detail.prepare-aws-resources-description-2" : "Se requiere una cuenta de AWS que pertenezca a un cliente para crear un SDDC.",
    "vmc-migration-task-detail.prepare-aws-resources-description-3" : "Se necesita la cuenta de AWS que pertenece al cliente para proporcionar al SDDC acceso a los servicios de AWS.",
    "vmc-migration-task-detail.prepare-aws-resources-description-4" : "La cuenta de AWS que pertenece al cliente no pertenece a VMware.",
    "vmc-migration-task-detail.prepare-aws-resources-description-5" : "La facturación de la cuenta de AWS se gestiona directamente a través de AWS.",
    "vmc-migration-task-detail.prepare-aws-resources-description-6" : "Identifique la cuenta de AWS que utilizará o cree una nueva. Cree una subred dedicada en la zona de disponibilidad de AWS deseada de la VPC de la cuenta de AWS que pertenece al cliente. El tamaño mínimo de subred es /26 (en notación CIDR).",
    "vmc-migration-task-detail.prepare-network-connection-description" : "La conexión del centro de datos local a un SDDC de VMware Cloud on AWS puede establecerse de varias maneras. Elija el método que mejor se adapte al entorno.",
    "vmc-migration-task-detail.prepare-network-dns" : "De forma predeterminada, el SDDC de VMware Cloud on AWS está configurado para utilizar servidores DNS públicos. Sin embargo, puede utilizar servidores DNS privados si lo desea. Un servidor DNS privado suele utilizarse al integrar un SDDC con redes locales u otras redes privadas, ya que permite la resolución de DNS para cargas de trabajo en estas redes privadas.",
    "vmc-migration-task-detail.public-internet" : "Internet pública",
    "vmc-migration-task-detail.public-internet.description-1" : "Aunque se recomienda emplear una conexión segura a un SDDC de VMware Cloud on AWS, se puede acceder a las cargas de trabajo en el SDDC directamente mediante la dirección IP pública a través de Internet. Como parte de la configuración inicial, se aprovisiona previamente una dirección IP pública a la instancia de vCenter Server en el SDDC. Por ello, puede acceder a vCenter Server directamente mediante HTTPS a través de esta dirección IP pública si permite el acceso mediante la puerta de enlace de administración con el firewall de puerta de enlace. Si lo desea, puede solicitar direcciones IP públicas adicionales para el SDDC y configurar NAT para máquinas virtuales de cálculo.",
    "vmc-migration-task-detail.public-internet.description-2" : "Consulte la documentación para obtener más información sobre la configuración del firewall de puerta de enlace y la solicitud de direcciones IP públicas.",
    "vmc-migration-task-detail.related-articles" : "Artículos relacionados",
    "vmc-migration-task-detail.request-public-ip" : "¿Cómo se solicita una dirección IP pública?",
    "vmc-migration-task-detail.size" : "Tamaño",
    "vmc-migration-task-detail.size-workloads-description" : "La herramienta VMware Cloud on AWS Sizer y TCO permite calcular el número de hosts necesario para ejecutar las cargas de trabajo en VMware Cloud on AWS. Utilice los datos recopilados sobre las cargas de trabajo locales para obtener un cálculo del tamaño del SDDC de VMware Cloud on AWS.",
    "vmc-migration-task-detail.sizer-tco" : "Cómo obtener un modelo de TCO y de dimensionamiento de VMware Cloud on AWS",
    "vmc-migration-task-detail.sizer-work-flow-description" : "En función del tipo de carga de trabajo, la herramienta VMware Cloud on AWS Sizer y TCO proporciona valores predeterminados razonables como punto de partida. Reemplace estos valores predeterminados en función de la información que recopiló del entorno local y de las expectativas relacionadas con las cargas de trabajo en VMware Cloud on AWS. La recomendación incluye la cantidad estimada de hosts que se necesita para ejecutar las cargas de trabajo migradas en VMware Cloud on AWS. La recomendación también incluye información adicional para proporcionar detalles sobre cómo se utiliza la capacidad de nube.",
    "vmc-migration-task-detail.storage-per-vm" : "Almacenamiento por máquina virtual (GB)",
    "vmc-migration-task-detail.team-subscription" : "¿Cómo se crea una suscripción de equipo en VMware Cloud on AWS?",
    "vmc-migration-task-detail.test-migration" : "La correcta instalación de HCX requiere un poco de preparación. Después de activar los componentes de HCX del lado de la nube, instale los componentes locales. Pruebe la instalación de HCX antes de migrar cargas de trabajo al SDDC.",
    "vmc-migration-task-detail.total-count-of-vms" : "Recuento total de máquinas virtuales",
    "vmc-migration-task-detail.uniqueness" : "Unicidad",
    "vmc-migration-task-detail.uniqueness-consideration" : "Debe aprovisionar un rango de direcciones IP que sea único en la organización. Esto es de especial importancia si va a conectarse al SDDC a través de una VPN o de Direct Connect, o si realiza una vinculación cruzada a una VPC de producción.",
    "vmc-migration-task-detail.vcpu-per-core" : "vCPU/núcleo",
    "vmc-migration-task-detail.view-hybrid-cloud-extension" : "Ver VMware HCX",
    "vmc-migration-task-detail.view-network-insight" : "Ver vRealize Network Insight Cloud",
    "vmc-migration-task-detail.view-vmware.hcx" : "Ver VMware HCX",
    "vmc-migration-task-detail.vmc-sizer-required-input" : "La herramienta VMware Cloud on AWS Sizer y TCO requiere una serie de entradas, las cuales incluyen:",
    "vmc-migration-task-detail.vpn-connectivity" : "Configurar la conectividad de VPN con el centro de datos local",
    "vmc-migration-task-detail.vrealize-li-aws" : "¿Cómo se habilita vRealize Log Insight Cloud para el SDDC de VMware Cloud on AWS?",
    "vmc-migration-task-detail.vrealize-ni" : "¿Cómo se utiliza vRealize Network Insight Cloud para la migración de aplicaciones?",
    "vmc-migration-task-detailvrealize-li." : "¿Qué es vRealize Log Insight Cloud?",
    "vmc-migration.task-translation.analyze-onprem-workload" : "Analizar cargas de trabajo locales",
    "vmc-migration.task-translation.build" : "Compilación",
    "vmc-migration.task-translation.build-cloud-overview" : "En la etapa de creación, creará la infraestructura de VMware Cloud on AWS en función de las necesidades determinadas en la fase de planificación. Creará un SDDC en la nube y lo configurará para que pueda ejecutar las cargas de trabajo.",
    "vmc-migration.task-translation.build-cloud-title" : "Crear el entorno de nube",
    "vmc-migration.task-translation.create-vmc-on-aws-account" : "Crear cuenta de VMware Cloud on AWS",
    "vmc-migration.task-translation.enable-log" : "Habilitar vRealize Log Insight Cloud (opcional)",
    "vmc-migration.task-translation.migrate" : "Migrar",
    "vmc-migration.task-translation.migrate-workloads-overview" : "En la etapa de migración, configurará HCX y establecerá un túnel que se utilizará para migrar las cargas de trabajo. Asimismo, probará el resultado de la migración con los usuarios de la aplicación. Tras finalizar esta etapa, las máquinas virtuales se habrán migrado correctamente del centro de datos local a VMware Cloud on AWS.",
    "vmc-migration.task-translation.migrate-workloads-title" : "Migrar cargas de trabajo a la nube",
    "vmc-migration.task-translation.plan" : "Plan",
    "vmc-migration.task-translation.plan-migration-overview" : "En la etapa de planificación, obtendrá información sobre la plataforma de VMware Cloud on AWS, evaluará el tamaño de las cargas de trabajo locales y determinará las redes, la seguridad y otros recursos necesarios para admitir dichas cargas de trabajo. Esta información le permitirá determinar el tamaño y la configuración de la infraestructura de VMware Cloud on AWS. La planificación es una etapa muy importante, ya que sienta las bases de la migración.",
    "vmc-migration.task-translation.plan-migration-title" : "Planifique la migración",
    "vmc-migration.task-translation.prepare-aws-resources" : "Preparar recursos de AWS",
    "vmc-migration.task-translation.prepare-network-ranges" : "Preparar rangos de redes",
    "vmc-migration.task-translation.sronly-build" : "ver detalles de etapa de creación",
    "vmc-migration.task-translation.sronly-migrate" : "ver detalles de etapa de migración",
    "vmc-migration.task-translation.sronly-plan" : "ver detalles de etapa de planificación",
    "vmc-migration.task-translation.stage-one" : "Etapa 1",
    "vmc-migration.task-translation.stage-three" : "Etapa 3",
    "vmc-migration.task-translation.stage-two" : "Etapa 2",
    "vmc-migration.task-translation.task.analyze-network" : "Analizar dependencias de red (opcional)",
    "vmc-migration.task-translation.task.aws-connectivity" : "Configurar la conectividad interna de AWS",
    "vmc-migration.task-translation.task.configure-network" : "Configurar red",
    "vmc-migration.task-translation.task.create-sddc" : "Crear SDDC",
    "vmc-migration.task-translation.task.download-gateway" : "Descargar puerta de enlace de HLM (opcional)",
    "vmc-migration.task-translation.task.get-to-know-vmc" : "Conozca VMware Cloud on AWS",
    "vmc-migration.task-translation.task.install-test-hcx" : "Instalación y prueba de HCX",
    "vmc-migration.task-translation.task.migrate-wave" : "Migrar por oleadas",
    "vmc-migration.task-translation.task.network-connection" : "Preparar para la conexión de red",
    "vmc-migration.task-translation.task.plan-migration" : "Planificación de la migración",
    "vmc-migration.task-translation.task.prepare-dns-strategy" : "Preparar estrategia de DNS",
    "vmc-migration.task-translation.task.size-workload" : "Tamaño de las cargas de trabajo",
    "welcome-home.aws-title" : "VMware Cloud on AWS",
    "welcome-home.infrastructure-label" : "Infraestructura admitida:"
  }
}