{
  "component" : "vmw-k8s",
  "locale" : "es",
  "messages" : {
    "vmc-kubernetes-cloud-as-platform.architecture-img-1-alt" : "Descripción general de Tanzu",
    "vmc-kubernetes-cloud-as-platform.architecture-img-2-alt" : "Flujo de extremo a extremo de Tanzu",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-acquisition-desc" : "La adquisición de Bitnami y Pivotal amplía los productos y servicios que podemos introducir en el mercado a través de VMware Tanzu. VMware ahora tiene una conexión mucho más profunda con la comunidad de desarrolladores y puede ofrecerles una completa cadena de suministro de aplicaciones modernas.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-packages-desc" : "Bitnami empaqueta y entrega aplicaciones para Kubernetes con un alcance increíble. Hoy en día, Bitnami Community Catalog ofrece 180 aplicaciones y componentes que se instalan más de 1 millón veces por mes. Anunciamos el lanzamiento de Project Galleon para aportar capacidades de Bitnami a la empresa a fin de ofrecer pilas de aplicaciones personalizadas a los desarrolladores finales.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-pivotal-desc-3" : "Pivotal es un importante guardián de uno de los marcos de aplicaciones más populares del mundo (Spring) y ofrece a los clientes una plataforma de aplicaciones comerciales líder (Pivotal Application Service, PAS). Pivotal adoptó de lleno Kubernetes y viene desarrollando tecnologías nativas de Kubernetes hace años. Recientemente, la empresa anunció que PAS y sus componentes, incluidos Pivotal Build Service y Pivotal Function Service, están evolucionando para poder ejecutarse en Kubernetes. En conjunto, Bitnami y Pivotal llegan a casi 5 millones de desarrolladores. Este escenario se vio amplificado con el ecosistema ISV de VMware; los socios de VMware se encuentran creando aplicaciones y ofreciendo servicios de valor agregado en Kubernetes, y se están integrando con la pila de SDDC de VMware.",
    "vmc-kubernetes-cloud-as-platform.build-modern-app-title" : "1. Compilar aplicaciones modernas",
    "vmc-kubernetes-cloud-as-platform.kubernetes-implementation-title" : "2. Ejecutar una implementación coherente de Kubernetes",
    "vmc-kubernetes-cloud-as-platform.kubernetes-title" : "Kubernetes",
    "vmc-kubernetes-cloud-as-platform.manage-environments-desc" : "A medida que Kubernetes aumente su disponibilidad en los entornos y que los equipos de desarrollo comiencen a aprovechar el servicio para respaldar la creación de aplicaciones modernas, su espacio será más complicado de administrar. Queremos ofrecer a nuestros clientes una manera de operar Kubernetes con coherencia en las nubes, los clústeres y los equipos a fin de proporcionar la máxima eficiencia operativa con un kit de herramientas empresariales. Es por eso que también presentamos VMware Tanzu Mission Control como parte de la cartera de VMware Tanzu.",
    "vmc-kubernetes-cloud-as-platform.manage-kubernetes-title" : "3. Administrar toda la infraestructura de Kubernetes desde un único punto de control",
    "vmc-kubernetes-cloud-as-platform.manage-mission-desc" : "Con VMware Tanzu Mission Control, los clientes podrán administrar todos sus clústeres de Kubernetes en vSphere, VMware PKS, nubes públicas, servicios administrados, distribuciones en paquetes o incluso una implementación por sus propios medios desde un único punto de control. Aprovisionarán nuevos clústeres de Kubernetes en estos entornos desde VMware Tanzu Mission Control y podrán aprovechar un motor de directivas para establecer barreras. En concreto, los operadores aplicarán directivas de seguridad, acceso, cuotas, copias de seguridad y otras a clústeres individuales o grupos de clústeres. Mientras tanto, los equipos de desarrolladores tendrán acceso a las áreas de trabajo en las que pueden consumir recursos y colaborar libremente.",
    "vmc-kubernetes-cloud-as-platform.pacific-implementation-desc" : "Project Pacific es un esfuerzo para integrar Kubernetes en vSphere. Si bien la integración de Kubernetes y vSphere se produce en las capas de la API y de la interfaz de usuario, también la capa de virtualización principal como ESXi podrá ejecutar Kubernetes de forma nativa. Project Pacific pondrá las capacidades de Kubernetes al alcance de cientos de miles de clientes vSphere y, posiblemente, de millones de administradores. Sin embargo, lo importante es que nuestro producto insignia vSphere unirá máquinas virtuales y contenedores de forma más eficaz a fin de ofrecer una única plataforma de aplicaciones para el futuro. Los operadores obtendrán acceso a las capacidades de Kubernetes a través de un conjunto conocido de herramientas y scripts, mientras que los desarrolladores podrán acceder a los recursos de nube mediante las API de Kubernetes.",
    "vmc-kubernetes-cloud-as-platform.pacific-link" : "Más información sobre Project Pacific",
    "vmc-kubernetes-cloud-as-platform.pacific-video-link" : "Video: Introducción a Project Pacific",
    "vmc-kubernetes-cloud-as-platform.project-pacific-img-alt-1" : "Marco de aplicaciones modernas de Tanzu",
    "vmc-kubernetes-cloud-as-platform.project-pacific-img-alt-2" : "Integración de Kubernetes y vSphere",
    "vmc-kubernetes-cloud-as-platform.tanzu" : "VMware Tanzu",
    "vmc-kubernetes-cloud-as-platform.tanzu-mission-control-img-alt" : "Tanzu Mission Control: Operar Kubernetes de forma coherente",
    "vmc-kubernetes-cloud-as-platform.tanzu-portfolio-desc" : "VMware Tanzu es nuestra cartera de productos y servicios destinada a transformar la manera en la que el mundo crea software en Kubernetes.",
    "vmc-kubernetes-cloud-as-platform.tanzu-strategy-desc" : "Ofrecemos VMware Tanzu como parte de nuestra estrategia para ayudar a los clientes a crear aplicaciones modernas, ejecutar Kubernetes de forma coherente en todos los entornos y administrarlo desde un único punto de control.",
    "vmc-kubernetes-cloud-as-platform.tanzu-title" : "{0} + {1} = {2}",
    "vmc-kubernetes-cloud-as-platform.tanzu-velocity-desc" : "Puede compilar aplicaciones con velocidad, ejecutar Kubernetes de código abierto con coherencia y administrar todo el espacio con confianza.",
    "vmc-kubernetes-cloud-as-platform.title" : "VMware Cloud como plataforma para Kubernetes",
    "vmc-kubernetes-cloud-as-platform.vision-implementation-desc" : "Los clientes que están entusiasmados por esta visión no deben esperar más. La oferta actual de Kubernetes, VMware PKS, se alinea por completo con VMware Tanzu, incluido Project Pacific. Todas las ofertas de VMware se compilan desde un núcleo común de Kubernetes de código abierto con administración integrada de los clústeres y el ciclo de vida. Los clientes que deseen ejecutar Kubernetes de forma coherente en diferentes nubes elegirán VMware PKS. En resumen, los clientes que se inician en la ruta de Kubernetes con VMware desearán dar el primer paso ahora con la compra y la implementación de VMware PKS.",
    "vmc-kubernetes-cloud-as-platform.vmware" : "VMware",
    "vmc-kubernetes-faqs.answer-1" : "VMware Tanzu Kubernetes Grid Plus ahora es compatible con VMware Cloud on AWS. Esto permite a los clientes implementar su SDDC en la nube, con los componentes necesarios para diseñar y ampliar Kubernetes de modo que se adapte a sus necesidades. VMware Tanzu Kubernetes Grid Plus es un tiempo de ejecución de Kubernetes certificado con acceso seguro a tecnologías de código abierto, incluidos Kubernetes, la administración del ciclo de vida del clúster (Cluster API) y la administración de imágenes de contenedor (Harbor). Con la ejecución de Tanzu Kubernetes Grid Plus en VMware Cloud on AWS, los clientes pueden implementar, escalar y administrar clústeres de Kubernetes en la nube. Esto establece una base fiable para la administración de aplicaciones nativas de la nube y la modernización de aplicaciones. Lea el blog <a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\">aquí<clr-icon shape=\"pop-out\"></clr-icon>.</a>",
    "vmc-kubernetes-faqs.answer-10" : "Póngase en contacto con su representante de VMware para obtener más información sobre los precios de TKG+ en VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-11" : "vSphere 7 with Kubernetes está disponible a través de VMware Cloud Foundation. Esta opción proporciona los servicios esenciales que potencian los servicios de infraestructura híbrida. Estos servicios y el servicio de Tanzu Kubernetes Grid forman parte de los servicios de VMware Cloud Foundation, disponibles en VMware Cloud Foundation 4. Obtenga más información en este blog. vSphere 7 with Kubernetes estará disponible en VMware Cloud on AWS más adelante. Los clientes que deseen comenzar con Kubernetes y los contenedores en VMware Cloud on AWS pueden empezar a utilizar Tanzu Kubernetes Grid Plus. Los clientes son responsables de implementar y administrar los clústeres de TKG+ en VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-12" : "El cliente puede obtener soporte para Tanzu Kubernetes Grid Plus en VMware Cloud on AWS a través de los canales de soporte de VMC existentes, incluido el soporte de chat.",
    "vmc-kubernetes-faqs.answer-2" : "TKG+ incluye los archivos binarios principales para instalar un clúster de TKG en VMware Cloud on AWS, así como el soporte del equipo de ingeniería de confiabilidad del cliente y servicios que permiten a los clientes planificar, implementar y mantener correctamente su entorno de Kubernetes. Puede encontrar una lista detallada de las tecnologías y los servicios admitidos en TKG+ en el artículo de la base de conocimientos <a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\">78173<clr-icon shape=\"pop-out\"></clr-icon></a>. Algunas de las referencias relevantes son las siguientes: <ul class=\"list\"><li>Revisiones de problemas críticos antes de las versiones ascendentes</li><li>Interfaz de almacenamiento de contenedor de vSAN (CSI)</li><li>Calico 2.6 y versiones posteriores</li><li>Contour para entrada</li><li>Registro de contenedores de Harbor</li><li>Velero para la copia de seguridad de los clústeres</li><li>Prometheus, Grafana y Fluentbit para la observación</li></ul>",
    "vmc-kubernetes-faqs.answer-3" : "Los clientes son responsables de implementar y administrar los clústeres de TKG+ en VMware Cloud on AWS. Los flujos de trabajo para implementar y administrar la infraestructura de TKG+ son los mismos que los de la instancia local. VMware se encarga de la administración de los componentes de software del SDDC y de la infraestructura de IaaS.",
    "vmc-kubernetes-faqs.answer-4" : "No. Tanzu Kubernetes Grid Plus es un software que los clientes pueden implementar en la infraestructura como servicio (Infrastructure-as-a-Service, IaaS) proporcionada por VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-5" : "Tanzu Kubernetes Grid Plus (TKG+) es igual que cualquier otra carga de trabajo en VMware Cloud on AWS que se instala en las máquinas virtuales. El clúster de administración puede ser una sola máquina virtual. El clúster de Kubernetes de carga de trabajo necesitará al menos una máquina virtual para el nodo principal y una máquina virtual para el nodo de trabajo (es decir, dos máquinas virtuales en total).",
    "vmc-kubernetes-faqs.answer-6" : "TKG+ en VMware Cloud on AWS es compatible con todas las regiones en las que VMware Cloud on AWS está disponible actualmente.",
    "vmc-kubernetes-faqs.answer-7" : "TKG+ es independiente de la infraestructura, y no hay ninguna dependencia para tener NSX-T de forma local si desea implementar los clústeres de TKG+ en VMware Cloud on AWS.",
    "vmc-kubernetes-faqs.answer-8" : "Con la suscripción a TKG +, los sistemas operativos compatibles con el nodo de Kubernetes incluyen Photon OS y Amazon Linux OS. El plan de desarrollo contempla actualmente incluir la compatibilidad con sistemas operativos adicionales.",
    "vmc-kubernetes-faqs.answer-9" : "La versión existente de Enterprise PKS o PKS Essentials no autoriza a los clientes a ejecutar TKG+ en VMware Cloud on AWS. Se pedirá a los clientes que compren una licencia de suscripción de TKG+.",
    "vmc-kubernetes-faqs.question-1" : "¿Qué se anunció con respecto a VMware Cloud on AWS y VMware Tanzu Kubernetes Grid Plus?",
    "vmc-kubernetes-faqs.question-10" : "¿Dónde se puede encontrar más información sobre los precios de TKG+ en VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-11" : "¿Cómo se relaciona Tanzu Kubernetes Grid Plus para VMware Cloud on AWS con vSphere with Kubernetes?",
    "vmc-kubernetes-faqs.question-12" : "¿De qué modo los clientes pueden obtener soporte para TKG+ en VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-2" : "¿Qué se incluye en TKG+?",
    "vmc-kubernetes-faqs.question-3" : "¿Quién es el responsable de implementar y administrar los clústeres de TKG+ en VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-4" : "¿Tanzu Kubernetes Grid Plus forma parte de VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-5" : "¿Cuál es la cantidad mínima de hosts de VMware Cloud on AWS requeridos para un clúster de TKG+?",
    "vmc-kubernetes-faqs.question-6" : "¿Qué regiones son compatibles con TKG+ en VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-7" : "¿Necesito tener NSX-T implementado de forma local para usar TKG+ en VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.question-8" : "¿Cuáles son los sistemas operativos compatibles con los nodos de Kubernetes?",
    "vmc-kubernetes-faqs.question-9" : "¿Los clientes pueden utilizar las licencias existentes de Enterprise PKS o PKS Essentials para implementar TKG+ en VMware Cloud on AWS?",
    "vmc-kubernetes-faqs.title" : "Preguntas frecuentes: Kubernetes",
    "vmc-kubernetes-journey.browser-title" : "Trayecto de Kubernetes",
    "vmc-kubernetes-journey.deploy-and-validate" : "Implementar y validar",
    "vmc-kubernetes-journey.deploy-and-validate-TKG" : "Implementar y validar Tanzu Kubernetes Grid",
    "vmc-kubernetes-journey.deploy-and-validate-demo-app" : "Cree una aplicación de demostración.",
    "vmc-kubernetes-journey.deploy-and-validate-ssh-demo" : "Ejecute SSH en el dispositivo de demostración de TKG.",
    "vmc-kubernetes-journey.deploy-and-validate-stage-desc" : "Después de configurar los requisitos previos, siga la guía para implementar Tanzu Kubernetes Grid. La guía le mostrará cómo crear la aplicación de demostración.",
    "vmc-kubernetes-journey.deploy-and-validate-tkg-demo" : "Implemente el archivo OVA de demostración de VMC TKG.",
    "vmc-kubernetes-journey.deploy-and-validate-workload-clusters" : "Implemente los clústeres de carga de trabajo y administración de TKG.",
    "vmc-kubernetes-journey.learn" : "Aprendizaje",
    "vmc-kubernetes-journey.learn-kubernetes" : "Información sobre Kubernetes",
    "vmc-kubernetes-journey.learn-stage-desc" : "Con nuestros recursos de aprendizaje, conocerá más sobre Kubernetes de lo que alguna vez imaginó \n                  y obtendrá la información que necesita para vender esta solución a sus equipos de aplicación.\n            ",
    "vmc-kubernetes-journey.learn.kubernetes-academy" : "Aprendizaje con los tutoriales en video de VMware Kubernetes Academy.",
    "vmc-kubernetes-journey.learn.kubernetes-view-faq" : "Vea las preguntas frecuentes.",
    "vmc-kubernetes-journey.learn.what-kubernetes" : "¿Qué es Kubernetes?",
    "vmc-kubernetes-journey.learn.why-kubernetes" : "¿Por qué VMware Cloud es una buena plataforma para Kubernetes?",
    "vmc-kubernetes-journey.pre-requisites" : "Requisitos previos para la instalación",
    "vmc-kubernetes-journey.prerequisites-1-node" : "SDDC existente o implementación de un nuevo SDDC de un nodo.",
    "vmc-kubernetes-journey.prerequisites-configure" : "Configure las redes y la instancia de vCenter.",
    "vmc-kubernetes-journey.prerequisites-demo-appliance" : "Escritorio para acceder al SDDC y al dispositivo de demostración de VMC TKG con puertos específicos abiertos.",
    "vmc-kubernetes-journey.prerequisites-dhcp" : "Red habilitada por DHCP para ejecutar cargas de trabajo de TKG.",
    "vmc-kubernetes-journey.prerequisites-review" : "Revise los requisitos previos.",
    "vmc-kubernetes-journey.prerequisites-stage-desc" : "Estos son algunos requisitos previos para implementar Tanzu Kubernetes Grid (TKG):",
    "vmc-kubernetes-journey.prerequisites-tkg-demo" : "Configure el archivo OVA de demostración de TKG.",
    "vmc-kubernetes-journey.prerequisites-view" : "Ver guía.",
    "vmc-kubernetes-journey.stage" : "Etapa ",
    "vmc-kubernetes-journey.title" : "Este es el primer paso de la migración a Kubernetes",
    "vmc-kubernetes-journey.view-guide-btn" : "Ver guía",
    "vmc-kubernetes-journey.view-guide-top-btn" : "Ver guía",
    "vmc-kubernetes-journey.view-resources-btn" : "Ver recursos",
    "vmc-kubernetes-overview.browser-title" : "Descripción general de Kubernetes",
    "vmc-kubernetes-overview.capabilities-automated-desc" : "<strong>Operaciones automatizadas de varios clústeres:</strong> gracias a la administración declarativa del ciclo de vida en varios clústeres, las actualizaciones y revisiones simplificadas, y las herramientas de API y CLI para operaciones automatizadas, Tanzu Kubernetes Grid Plus facilita la administración de las implementaciones de Kubernetes en varios clústeres a gran escala y la automatización de tareas manuales para reducir el riesgo empresarial y centrarse en el trabajo más estratégico.",
    "vmc-kubernetes-overview.capabilities-installation-desc" : "<strong>Instalación simplificada:</strong> el diseño de Tanzu Kubernetes Grid Plus incluye las herramientas y las tecnologías de código abierto necesarias para implementar y operar de forma coherente un entorno de Kubernetes ampliable donde sea que se deba ejecutar, ya sea en vSphere, en la nube administrada de VMware en la nube pública o en la instancia de Edge",
    "vmc-kubernetes-overview.capabilities-title" : "Capacidades clave",
    "vmc-kubernetes-overview.challenges-growth-desc" : "<strong>Los clientes desean reducir la carga operativa</strong> Los clientes desean reducir la carga operativa mientras implementan y administran una creciente cantidad de clústeres de Kubernetes.",
    "vmc-kubernetes-overview.challenges-lifecycle-desc" : "<strong>Los clientes desean concentrarse en las aplicaciones y la innovación</strong> en contraposición con la administración del ciclo de vida de una infraestructura de bajo valor.",
    "vmc-kubernetes-overview.challenges-operations-desc" : "<strong>Los clientes necesitan una infraestructura y operaciones coherentes</strong> para implementar, ejecutar y administrar clústeres de Kubernetes en entornos locales y de nube.",
    "vmc-kubernetes-overview.challenges-order-desc" : "Con el fin de desarrollar aplicaciones modernas, <strong>el cliente necesita una infraestructura ampliable</strong> en la nube que aborde las necesidades empresariales cambiantes y optimice el coste de la infraestructura.",
    "vmc-kubernetes-overview.challenges-title" : "Desafíos",
    "vmc-kubernetes-overview.description" : "Con Tanzu Kubernetes Grid Plus, los desarrolladores pueden compilar, ejecutar y administrar la próxima generación de aplicaciones mediante contenedores orquestados por Kubernetes.",
    "vmc-kubernetes-overview.enterprise-support-desc" : "<strong>Soporte de nivel empresarial:</strong> los clientes que implementan Tanzu Kubernetes Grid Plus en VMware Cloud on AWS pueden sacar partido de las ventajas del soporte break-fix disponible en todo momento para Kubernetes y las principales tecnologías de ecosistema de código abierto. Asimismo, los clientes que pretendan transformar el modo en que crean aplicaciones pueden aprovechar VMware Pivotal Labs para impulsar métodos de desarrollo ágiles en sus organizaciones y acortar la ruta a la producción.",
    "vmc-kubernetes-overview.get-started-btn" : "Comenzar",
    "vmc-kubernetes-overview.infrastructure-label" : "Infraestructura admitida:",
    "vmc-kubernetes-overview.integrated-services-desc" : "<strong>Servicios de plataforma integrados:</strong> Tanzu Kubernetes Grid Plus optimiza la implementación de los servicios locales y en el clúster para simplificar la configuración de las directivas de registro de imágenes de contenedor, la supervisión, el registro, la entrada, las redes y el almacenamiento; además, prepara el entorno de Kubernetes para las cargas de trabajo de producción.",
    "vmc-kubernetes-overview.open-source-desc" : "<strong>Alineación de código abierto:</strong> Tanzu Kubernetes Grid Plus facilita la ejecución de aplicaciones en contenedor en una distribución de Kubernetes con alineación ascendente y tecnologías de código abierto claves (como Cluster API, Fluentbit y Contour) para que pueda habilitar la portabilidad y aprovechar las ventajas del soporte y la innovación de la comunidad global de Kubernetes. También proporciona soporte break-fix y soporte proactivo para el ecosistema de código abierto mediante el equipo de ingeniería de confiabilidad del cliente.",
    "vmc-kubernetes-overview.solution-containerized-desc" : "Con Tanzu Kubernetes Grid Plus implementado en VMware Cloud on AWS, puede aprovechar la infraestructura de escalabilidad elástica en la nube para las cargas de trabajo en contenedor, y crear y escalar rápidamente los clústeres de Kubernetes según sus necesidades.",
    "vmc-kubernetes-overview.solution-establishes-desc" : "De esta forma, se establece una base elástica y fiable para la modernización de aplicaciones. Gracias a la base en Kubernetes, se obtiene una verdadera portabilidad de las aplicaciones, por lo que estas nunca se bloquean en una distribución específica del proveedor.",
    "vmc-kubernetes-overview.solution-overview-img-alt" : "Diagrama de la arquitectura de la solución",
    "vmc-kubernetes-overview.solution-release-desc" : "En el lanzamiento de una nueva versión de Kubernetes, VMware trabaja con la comunidad de código abierto para probar y proteger esta versión de forma ascendente. Una vez que se publiquen los archivos binarios ascendentes, VMware firmará los archivos binarios con fines de seguridad y los pondrá a disposición para su descarga. Nunca fue tan fácil crear y administrar VMware TKG gracias a que se desarrolló con los profesionales de Kubernetes.",
    "vmc-kubernetes-overview.solution-tanzu-grid-desc" : "VMware Tanzu Kubernetes Grid Plus en VMware Cloud on AWS permite implementar el SDDC en la nube, con todos los componentes necesarios para diseñar y escalar Kubernetes según sus necesidades. VMware Cloud on AWS proporciona una solución de nube híbrida integrada sin problemas que extiende los entornos de vSphere locales a un SDDC de VMware que se ejecuta en Amazon Elastic Compute Cloud (Amazon EC2), una infraestructura sin sistema operativo totalmente integrada como parte de AWS.",
    "vmc-kubernetes-overview.solution-title" : "Descripción de la solución",
    "vmc-kubernetes-overview.supported-infrastructure" : "VMware Cloud on AWS",
    "vmc-kubernetes-overview.tanzu-grid-development-desc" : "El desarrollo de aplicaciones tiene un ciclo evolutivo que requiere diferentes dependencias en la infraestructura. Las aplicaciones modernas exigen nuevas plataformas que adopten un uso declarativo, pero que también incorporen cualidades transitorias. La infraestructura subyacente debe adaptarse a estas nuevas tendencias para admitir las cargas de trabajo modernas.",
    "vmc-kubernetes-overview.tanzu-grid-modernization-desc" : "En línea con esta iniciativa de modernización, las organizaciones de TI experimentan una mayor necesidad de admitir aplicaciones basadas en contenedores. La velocidad de los cambios en el espacio de los contenedores se supera a sí misma cada trimestre. Las organizaciones de TI tradicionales que necesitan administrar todo tipo de infraestructuras y aplicaciones simplemente no tienen tiempo para mantener el paso. El ritmo al que empieza a quedar obsoleta la tecnología de contenedores exige una infraestructura de escalabilidad elástica según las necesidades de la empresa, que se ejecute en el software más reciente y más importante para ayudar a acelerar la innovación.",
    "vmc-kubernetes-overview.tanzu-grid-order-desc" : "Con el fin de ayudar a los clientes en este sentido, ofrecemos junto con VMware Cloud on AWS la solución VMware Tanzu Kubernetes Grid Plus (TKG), el tiempo de ejecución de Kubernetes compatible con VMware. Las organizaciones que deseen comenzar a ejecutar contenedores y Kubernetes en VMware Cloud on AWS pueden comenzar hoy mismo con VMware Tanzu Kubernetes Grid Plus. Diseñado para estar alineado con la comunidad de Kubernetes y garantizar la coherencia en los entornos, Tanzu Kubernetes Grid Plus ofrece acceso seguro a las tecnologías de código abierto esenciales como Kubernetes, administración del ciclo de vida del clúster (Cluster API) y un registro de imágenes de contenedor (Harbor).",
    "vmc-kubernetes-overview.tanzu-grid-progress-desc" : "A medida que las organizaciones avanzan en la creación y la implementación de aplicaciones nativas en la nube, es necesario disponer de una tecnología coherente y fiable que simplifique y elimine gran parte de las conjeturas subyacentes.",
    "vmc-kubernetes-overview.tanzu-grid-simplified-desc" : "Gracias a la compatibilidad con VMware Tanzu Kubernetes Grid Plus, los clientes disponen de una ruta de acceso simplificada para ejecutar Kubernetes en VMware Cloud on AWS. Esta solución ofrece la estandarización de infraestructuras, la conveniencia y la confiabilidad necesarias para abordar los desafíos de la implementación, y la administración de aplicaciones adaptadas a Kubernetes. Con VMware TKG en VMware Cloud on AWS, se combinan las capacidades empresariales del centro de datos definido por software (Software Defined Data Center, SDDC) de VMware, incluidos el cálculo, el almacenamiento y las redes, que se ofrecen como un servicio en AWS, con las capacidades líderes en el mercado de VMware TKG para una implementación de contenedor sencilla, segura y coherente.",
    "vmc-kubernetes-overview.tanzu-grid-title" : "VMware Tanzu Kubernetes Grid Plus en VMware Cloud on AWS",
    "vmc-kubernetes-overview.technical-overview" : "Descripción general técnica",
    "vmc-kubernetes-overview.technical-overview-apps-desc" : "Esta opción proporciona una ruta de acceso rápida para que los desarrolladores implementen aplicaciones modernas, a la vez que ofrece una experiencia de Kubernetes coherente para los operadores en todos los entornos empresariales, incluidos vSphere local, en la nube pública y en la instancia de Edge. Además, expande las aplicaciones basadas en contenedores que se ejecutan en Kubernetes para que estén disponibles en los dominios de error.",
    "vmc-kubernetes-overview.technical-overview-grid-desc" : "VMware Tanzu Kubernetes Grid Plus se ejecuta en el SDDC de VMware que funciona en una infraestructura elástica, dedicada y nativa de Amazon EC2. VMware Tanzu Kubernetes Grid Plus es un tiempo de ejecución de Kubernetes preparado para empresas que incluye tecnologías de código abierto y herramientas de automatización para permitirle ponerse en marcha rápidamente con un entorno de Kubernetes ampliable de varios clústeres. Cuando se implementa en VMware Cloud on AWS, proporciona una infraestructura de escalabilidad elástica para cargas de trabajo en contenedor, y ayuda a crear y escalar clústeres de Kubernetes según sus necesidades.",
    "vmc-kubernetes-overview.title" : "Kubernetes",
    "vmc-kubernetes-overview.video-btn" : "Reproducir video",
    "vmc-kubernetes-overview.video-poster-img-alt-txt" : "Tanzu Kubernetes Grid Plus en VMware Cloud on AWS",
    "vmc-kubernetes-resources.browser-title" : "Recursos de Kubernetes",
    "vmc-kubernetes-resources.cloud-as-platform" : "VMware Cloud como plataforma",
    "vmc-kubernetes-resources.faqs" : "Preguntas frecuentes",
    "vmc-kubernetes-resources.videos-and-docs" : "Videos y documentos",
    "vmc-kubernetes-resources.what-is-kubernetes" : "¿Qué es Kubernetes?",
    "vmc-kubernetes-videos-and-docs.click-here-1" : "Haga clic para ver la serie semanal de TGIKubernetes en directo por YouTube",
    "vmc-kubernetes-videos-and-docs.click-here-2" : "Haga clic aquí para leer este libro electrónico",
    "vmc-kubernetes-videos-and-docs.desc" : "Para obtener más información sobre Kubernetes, consulte a continuación un conjunto de recursos seleccionados, incluidos documentos técnicos, videos técnicos y más. Existen recursos adicionales disponibles<a href=\"{0}\" target=\"_blank\" rel=\"noopener noreferrer\"> aquí <clr-icon shape=\"pop-out\"></clr-icon></a>",
    "vmc-kubernetes-videos-and-docs.docs-title" : "Documentos",
    "vmc-kubernetes-videos-and-docs.kube-academy-click-here" : "Haga clic para ir a VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-btn" : "Ir a Kube Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-desc" : "¿Tiene poco tiempo, pero desea aprender sobre contenedores y Kubernetes? Aprenda de los expertos más importantes en Kube Academy. Los cursos de Kube Academy se componen de una serie de lecciones en segmentos de video desarrolladas por instructores expertos. Estos cursos lo ayudarán a comprender los nuevos conceptos de Kubernetes de forma gratuita, sin restricciones.",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-img-alt" : "VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.kubernetes-academy-title" : "VMware Kubernetes Academy",
    "vmc-kubernetes-videos-and-docs.managing-book-btn" : "Leer el libro electrónico",
    "vmc-kubernetes-videos-and-docs.managing-book-desc" : "Por un lado está la teoría de Kubernetes y, por otro lado, la práctica. Este libro electrónico es el último escrito por Brendan Burns (uno de los tres creadores originales de Kubernetes) y Craig Tracey (arquitecto de VMware Staff Kubernetes).",
    "vmc-kubernetes-videos-and-docs.managing-book-img-alt" : "Administrar Kubernetes",
    "vmc-kubernetes-videos-and-docs.managing-book-title" : "Administrar Kubernetes",
    "vmc-kubernetes-videos-and-docs.pdf-click-here" : "Haga clic aquí para leer este libro electrónico",
    "vmc-kubernetes-videos-and-docs.title" : "Videos y documentos: Kubernetes",
    "vmc-kubernetes-videos-and-docs.tutorials-desc" : "TGIKubernetes propone, en una transmisión en vivo semanal por YouTube, profundizar en las nuevas herramientas y conceptos de Kubernetes. Únase cada semana a las 13:00 PST para seguir los videos y aprender. Además, con VMware Kubernetes Academy, puede instruirse a partir de una serie de tutoriales en segmentos de video creados por los instructores líderes de VMware.",
    "vmc-kubernetes-videos-and-docs.tutorials-title" : "Tutoriales y series semanales en directo",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-btn" : "Leer el libro electrónico",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-desc" : "Acérquese de manera práctica al modo en que Kubernetes y la tecnología de contenedores pueden ayudarlo a alcanzar nuevos niveles de velocidad, agilidad, confiabilidad y eficacia.",
    "vmc-kubernetes-videos-and-docs.up-and-running-book-title" : "Kubernetes: En funcionamiento",
    "vmc-kubernetes-videos-and-docs.up-and-running-img-alt" : "Kubernetes en funcionamiento",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-btn" : "Ver en YouTube",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-desc" : "Únase a la exploración práctica que Joe Beda hará sobre Kubernetes y otros temas relacionados. En algunas secciones, verá a Joe explicar los conceptos que conoce bien. En otras, Joe explorará algo nuevo con el público. Puede formular preguntas, hacer comentarios y ayudar a decidir el rumbo de la transmisión.",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-img-alt" : "Series semanales de TGIKubernetes en directo por YouTube",
    "vmc-kubernetes-videos-and-docs.youtube-live-series-title" : "Series semanales en directo por YouTube: TGIKubernetes",
    "vmc-kubernetes-what-is-kubernetes.advantages-title" : "3. Ventajas de Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.applications" : "Kubernetes escala verticalmente los servidores web según la demanda de las aplicaciones de software y, a continuación, degrada las instancias de servidor web durante los tiempos de inactividad.",
    "vmc-kubernetes-what-is-kubernetes.architecture-desc" : "Kubernetes se desarrolló a partir del código que Google empleaba para administrar sus centros de datos a escala con la plataforma 'Borg'. Con el lanzamiento de la plataforma EC2, AWS presentó al público marcos de servidores web elásticos. Kubernetes permite a las empresas orquestar contenedores como EC2, pero usando código abierto. Google, AWS, Azure y los demás hosts de nube pública importantes ofrecen compatibilidad con Kubernetes para la orquestación de servidores web de nube. Los clientes pueden utilizar Kubernetes para la total externalización de centros de datos, las aplicaciones web o móviles, la compatibilidad con SaaS, el alojamiento web de nube o la computación de alto rendimiento.",
    "vmc-kubernetes-what-is-kubernetes.architecture-title" : "2. Arquitectura de Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.automate" : "Kubernetes ofrece la capacidad de automatizar el aprovisionamiento de servidores web de acuerdo con el nivel de tráfico web en la producción.",
    "vmc-kubernetes-what-is-kubernetes.automated" : "La principal ventaja de Kubernetes es la capacidad de operar una plataforma de servidor web automatizada y elástica en producción sin el bloqueo del proveedor para AWS con el servicio EC2.",
    "vmc-kubernetes-what-is-kubernetes.capabilities" : "Kubernetes también tiene capacidades avanzadas de equilibrio de carga para el enrutamiento de tráfico web a los servidores web en las operaciones.",
    "vmc-kubernetes-what-is-kubernetes.desc" : "Kubernetes es una plataforma de orquestación de contenedores de código abierto que permite el funcionamiento de un marco de servidores web elástico para las aplicaciones de nube. Kubernetes puede admitir la externalización de centros de datos a los proveedores de servicios de nube pública o se puede utilizar para el alojamiento web a escala. Los sitios web y las aplicaciones móviles con código personalizado complejo pueden implementarse mediante Kubernetes en un hardware básico para reducir los costes del aprovisionamiento de servidores web con hosts de nube pública y optimizar los procesos de desarrollo de software.",
    "vmc-kubernetes-what-is-kubernetes.docker-desc" : "Kubernetes es una plataforma de orquestación de contenedores de código abierto. Docker es el principal estándar de virtualización de contenedores que se utiliza con Kubernetes. Otros sistemas de orquestación de servidores web elásticos son Docker Swarm, CoreOS Tectonic y Mesosphere. Asimismo, Intel ofrece Kata, un estándar de contenedores que compite con el anterior, y existen varias versiones de contenedor de Linux. Docker tiene la mayor cuota del mercado de virtualización de contenedores para productos de software. Docker es una empresa de desarrollo de software que se especializa en la virtualización de contenedores, mientras que Kubernetes es un proyecto de código abierto sostenido por una comunidad de desarrolladores que incluye programadores profesionales de las empresas de TI más importantes.",
    "vmc-kubernetes-what-is-kubernetes.docker-title" : "5. Comparación de Kubernetes y Docker",
    "vmc-kubernetes-what-is-kubernetes.features-img-alt" : "Documento: Kubernetes para ejecutivos",
    "vmc-kubernetes-what-is-kubernetes.features-title" : "1. Características de Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.features-tooltip" : "Haga clic para leer el documento sobre Kubernetes para ejecutivos",
    "vmc-kubernetes-what-is-kubernetes.orchestration-desc" : "La orquestación de contenedores es la administración de servidores web individuales que operan en contenedores a través de particiones virtuales en el hardware del centro de datos. La orquestación de contenedores es un medio para mantener el marco elástico de los servidores web de un centro de datos de manera automatizada en la producción. Los administradores pueden establecer recursos que se inicien automáticamente si el tráfico web aumenta a través de la capacidad de un solo servidor. En las aplicaciones SaaS, esto se puede escalar para admitir millones de usuarios simultáneos.",
    "vmc-kubernetes-what-is-kubernetes.orchestration-title" : "4. Orquestación de contenedores de Kubernetes",
    "vmc-kubernetes-what-is-kubernetes.scalability" : "Kubernetes permite que cualquier empresa trabaje con su código de software en el mismo nivel de escalabilidad que las empresas más grandes del mundo con precios competitivos de centros de datos para los recursos de hardware.",
    "vmc-kubernetes-what-is-kubernetes.server" : "El hardware del servidor web puede encontrarse en diferentes centros de datos, en diferente hardware o a través de diferentes proveedores de alojamiento.",
    "vmc-kubernetes-what-is-kubernetes.services" : "Kubernetes se ejecuta en la mayoría de los servicios de alojamiento de nube pública, y todas las empresas más importantes ofrecen precios competitivos. Kubernetes permite la total externalización de un centro de datos corporativo.",
    "vmc-kubernetes-what-is-kubernetes.title" : "¿Qué es Kubernetes?",
    "vmc-kubernetes-what-is-kubernetes.video-poster-img-alt-txt" : "Kubernetes en 5 minutos",
    "vmc-kubernetes-what-is-kubernetes.web-traffic" : "Kubernetes también se puede utilizar para escalar aplicaciones móviles y web en producción a los niveles más altos de tráfico web."
  }
}